#$%送圆周率！（3.141592653589793860646274358622259488658754416659764815794568457485461146447545164879492584165497542138454215464664644212154875451234343434444969155675215541015210115601645897155151215647991758184911071015451458798154519781051……）
from random import *
from time import *
a = input("输入账号：")
b = input("输入密码：")
c = input("输入手机号：")
if len(c) != 11:
    print("\033[1;31m你是坏人！110！")
    for i in range(3):
        print("\033[2J",end="")
        print("\033[100A",end="")
        print("\033[1;33m代码运行结束")
        sleep(1-0.5)
    while True:
        print("\033[2J",end="")
        print("\033[100A",end="")
        print("\033[1;31m电脑已出故障！")
        sleep(0.01)
for y in range(1):
    print(" _______________________")
    print("|                       |")
    print("|        登陆中……       |")
    print("|>----------------------|")
    print("|                       |")
    print(" ———————————————————————")
    sleep(0.7)
    print("\033[2J",end="")
    print("\033[100A",end="")
    print(" _______________________")
    print("|                       |")
    print("|        登陆中……       |")
    print("|------------->---------|")
    print("|                       |")
    print(" ———————————————————————")
    sleep(0.8)
    print("\033[2J",end="")
    print("\033[100A",end="")
    print(" _______________________")
    print("|                       |")
    print("|        登陆中……       |")
    print("|--------------------->-|")
    print("|                       |")
    print(" ———————————————————————")
    sleep(0.8)
    print("\033[2J",end="")
    print("\033[100A",end="")
    print("(\033[46m \033[42m \033[0m)                    )")
    sleep(1.5)
    print("\033[2J",end="")
    print("\033[100A",end="")
    print("(\033[46m \033[42m \033[46m \033[42m \033[46m \033[42m \033[46m \033[42m \033[46m \033[42m \033[46m \033[42m \033[46m \033[42m \033[46m \033[42m \033[46m \033[42m \033[46m \033[42m \033[46m \033[0m)")
def fun(line):
    for i in range(len(line)):
        print("\r"+line[0:i+1],end="")
        sleep(0.1)
    print()
fun("解锁吧！")
a_jie = input("\033[1;33m手机号是：")
b_jie = input("\033[1;33m密码是：")
c_jie = input("\033[1;33m账号是：")
if a == c_jie and b == b_jie and c == a_jie:
    print(c[0:4],"***",c[7:11],"欢迎！")
else :
    print("\033[41m错！")






