input('''大公告

首先
原 宇宙工作室 现 宇宙工作室合并改为逆天工作室旗下
宇宙工作室已经进行裁员
逆天工作室和宇宙工作室的室长都是小轩
各成员注意了！！！

次，公告增加了

Enter继续
''')
input('''\033[2J\033[100A\033[3J\033[100A\b大公告

逆天少年团的历史：
+------------------------------------+
|2021/9    |逆天少年（小轩）         |
|2021/11   |逆天少年队（2人）        |
|2021/11   |逆天少年队（3人）        |
|2021/12   |逆天少年营（4人）        |
|2022/1/1  |逆天少年团（5人）        |
|2022/1/8  |逆天少年团巩固，正式成立 |
|2022/1/11 |团队开始逐渐明确级别     |
|2022/1/14 |开始决策及管理、运营     |
|2022/1/15 |创立"x.x"级的构思并投入  |
|2022/1/22 |线上部逆天工作室招新人   |
|2022/1/29 |线上部逆天工作室再招新人 |
+------------------------------------+
Enter继续
''')
print('''\033[2J\033[100A\033[3J\033[100A\b
\033[1;31m逆天少年团（逆天团队）：
\033[0m总管理员、团长：小轩

\033[1;34m线下-主部\033[0m
团长|小  轩| 3级
团员|张余辰| 2级
    |李俊鑫| 2级
    | Ella | 2级
    |      |
    |      |
    |      |

\033[1;34m线上
\033[1;32mC站-逆天工作室
室长|小  轩| 5.2级
副室|胡锦辉| 3.7级
专业|王翰德| 2级
室员|冀厚锦| 2.4级
    |张余辰| 1.8级
    |李俊鑫| 1.1级
    |      |
    |      |
    |      |
    |      |
\033[1;31m(等待并热烈欢迎逆天大神的加入)
\033[1;36mC站-宇宙工作室
室长|小  轩| 9.0级
副室|胡锦辉| 7.5级
经理|小  茗| 6.0级
    |黄浩朗| 6.0级
    |李官阳| 6.0级
    |曹羽翀| 5.5级
主任|彭逸航| 5.3级
    |李欣凌| 5.2级
    |张余辰| 3.8级
    |李俊鑫| 3.0级
管理|小  轩|   -级
室员|      | x.x级
    |      | x.x级
    |      | x.x级
    |      | 
    |      | 
\033[1;31m(等待你的加入，只要在社区活跃度高并且python在L2及以上就行了)
\033[1;33m小部-线上微信
人员|张余辰| 1级
    |李俊鑫| 1级
    | Ella | 1级
    |      |
    |      |

\033[0m
一共有下面这些等级：
trying级
going级
doing级
stu级
starts级
------------------
0级~3级（初级）
4级~5级（中级）
6级~7级（高级）
8级~10级（大佬）
10x级
------------------
s0~10级
s more级
most TOP级（最高等级）
\033[1;36m
+-------------------+
|逆         逆  天  |
|          逆天逆天 |
|逆天       | 工 |  |
|  天       | 作 |  |
|  天       逆室逆  |
|  天       逆      |
|  逆      天       |
|  天               |
|逆天逆天逆天工作室 |
+-------------------+\033[0m

彩蛋
众人：都半退站了还拼！
小轩：现在取消半退站，等初中再半退吧！

注意：上方还有内容，滚轮画上去康康
''')