print('''感谢学而思编程。
我已经来社区4年了，18年就来了，19年有了第一个作品。

对于学而思编程的建议：
1.我知道编程大作战的“让秃头掉头发的神秘功能 敬请期待”没了。
教研组是官方，解决一些技术问题遇到困难时会拖放很久，甚至就弃坑了。我也写了不少代码了，写得无聊就确实想弃坑了，但是答应了却删掉就不对了
只有想不到，没有做不到。运用现在Scratch云变量的websocket端口，在python也能靠你们的服务器存储数据。自己做一个编程社区也不是很难，但是教研组做的太慢了

2.多更新功能。而且连个首页都懒得换了

3.多处bug。用python爬虫通过抓包可以抓到上传数据，进而调用cookie传入api，导致许多问题

4.热度计算公式不科学。手动权重加还不如不加。改编热度值不应该最多，不应该+2，而应该+0.5

5.素材库应该扩大到原来的50倍左右，素材太少了没人用

6.素材区从20MB扩容到200MB，同时提高学而思云速度，免得用upload又慢又低效率了

7.违禁词不合理的问题。作品连接中带有64、89都不能发。没人知道64和89是神马意思，建议改进数据库，同时避免不可见间隔符、转义字符、空格

8.UI要改进，社区的版面看老了，要换个智能点的，背景颜色可以是深靛色，多些插图

9.编程IDE左上角的logo还是旧版的，应该和主页匹配

等等不列举了


对于我：
初中时间真的紧，周末可能都基本不来社区看了
寒假会有一定时间的。
玩一玩yzy的作品，逛一逛胡锦辉的主页，运行一下吴宇航的语言，看一眼wdd的个签，路过wlz，尝尝小饼干的鲜，用用富兰克林的xesapi，找找林圣杰，聊聊四会，跳上何嘉晨的clib，越过袁梓轩的游戏，开启谢法然的动画，翻过李官阳的html。
动一动自己的《小球世界》
我冷了。(含义至少3种)
''')