# 逆天聊 InverseSky Chat(INC)软件更新日志
# T0 开端 2015/8 V0.0 点亮一个梦想，就能创造世界

T1 探索
V0.1-1 2016/6 发现云
V0.1-2 2016/9 构思云
V0.1-3 2019/1 学python
V0.1-4 2019/2 腹稿
V0.1-5 2019/7 买书
V0.1-6 2020/2 自学python-socket

T2 尝试
V0.1.0 2020/2 python-socket尝试失败
V0.1.1 2021/2 大量查找资料，自学python-socket
V0.1.2 2021/2 没有IP，失败
V0.1.3 2021/3 寻找IP，找到了
V0.1.4 2021/3 尝试终端通讯，失败
V0.1.5 2021/8 尝试html聊天室
V0.1.6 2021/8 加入js
V0.1.7 2021/8 js失败，换cookie学习
V0.1.8 2021/8 失败，彻底放弃
V0.1.9 2021/11 学习服务器原理，重燃信心
V0.2.0 2021/12 大量查找资料，自学python-socket，失败
V0.3.0 2022/1 开启windows ip，失败
V0.4.0 2022/1 python+h5运行，失败
V0.4.1 2022/1 想要服务器，没钱
V0.4.2 2022/1 想注册网站，失败
V0.4.3 2022/1 想要注册域名，没钱
V0.5.0 2022/1 想用php，没资源，不会
V0.5.1 2022/1 找李官阳，失败
V0.6.0 2022/1 网上搬运的，但是不能标原创了，效果也一般，失败
V0.6.1 2022/1 重温python-socket
V0.7.0 2022/2 使用富兰克林的服务器，被拒绝，失败
V0.8.0 2022/3 搜集3000条资料，都没用
V0.9.0 2022/3 联合冀厚锦等人，爬虫，失败，只能改api
V0.9.1 2022/4 sc云变量出现，没法改api

T3 奠基
V0.1.0 2022/6 何嘉晨发现xes服务器端口开启py云变量
V0.1.1 2022/6/18 云变量修复版（截断存储），并且开启IdealXes计划
V0.2.0 2022/7/5 IdealXes计划鼎盛，提出聊天室
V0.3.0 2022/6/15 吴宇航完善云变量，不再出现<xml?>问题
V0.3.1 2022/6/15 小轩UI框架开始
V0.3.2 2022/6/15 分frame
V0.3.3 2022/6/15 布局
V0.3.4 2022/6/15 cloudlib
V0.3.5 2022/6/15 云存
V0.3.6 2022/6/15 textbox/button加入
V0.3.7 2022/6/15 爆肝，UI完成，开始发送信息
V0.3.8 2022/6/15 名字输入、发送信息存储
V0.3.9 2022/6/15 每次打开存储信息

T4 智造
V0.4.0 2022/6/15 逆天聊正式诞生，版本号4.0
V0.4.5 2022/6/16 修复<xml?>，登录框架
V0.5.0 2022/6/16 美化布局，修复发送的bug，增加时间，定制计划，登录注册系统，版本号5.0
V0.5.5 2022/6/16 登录加密
V0.6.0 2022/6/17 完全修复<xml?>，添加工具栏、表情按钮，版本号6.0
V0.6.1 2022/6/18 超链接
V0.6.2 2022/6/18 超链接按钮
V0.6.3 2022/6/18 文本发送去掉末行完善
V0.6.5/6 2022/6/18 表情制作、表情按钮、算法上的优化
V0.6.6 plus 2022/6/18 表情bug的解决
V0.6.6 plus 分支 2022/6/18 举报功能按钮，后来被撤销
V0.7.0-α 2022/6/19 文本存储转列表存储，定义：α内测 β公测 γ修复 δ完善公测
V0.7.0-β 2022/6/19 改bug，超长字符存储启动，个人中心框架
V0.7.0-γ 2022/6/19 改bug，列表存储的文字修复
V0.7.0-δ 2022/6/19 改bug，时刻刷新与窗口抖动

T5 稳定
V0.7.5-α 2022/6/19 文件按钮框架
V0.7.5-β 2022/6/20 文件上传、文件消息
V0.7.6-β 2022/6/20 文件上传成功啦！！！
V0.7.6-γ 2022/6/20 解决文件空格问题
V0.7.7-α 2022/6/20 解决文件cmd打不开问题、解决bug
V0.7.7-β 2022/6/20 解决文件不开卡死问题，再Thread
# 接下来待解决：发空、发脏话