print('''逆天团队官方文档: basic-01 (normal/简明扼要)
IDU:
进入下一阶段。准备先绘制材质，再编写pygame显示地图与剧本。
由于开学较繁忙，目前进展较慢，国庆期间会开发更快。

/林林:
提出逆天在C站举办活动以活跃气氛。小轩已经同意。
  目前规章制度等(之后仍然需要完善):
  1.可以使用任何语言编写。其中主要以python高阶为主。素材大小可以在20MB以内，但不得以任何云形式或压缩包挂载。GUI界面大加分。
  2.原创。新作或迭代旧作后新发布。使用常用库。无云传输内容。无违规或无意义信息。社区中可以直接运行。如有较麻烦规则，必须有明确教程和介绍。
  3.奖项:
    参与奖: 对小轩、林林、吴宇航等相关人员给出作品链接。可以抽取主页作品获得1-5个赞。
    优秀奖: 根据各个评委主观意见，作品在各个方面基本优秀，可以将其归入逆天团队编程人才预备数据库(后期表现优秀直接升级成3到2级技术员)，并奖励max(作品个数,10)个赞。
    创新奖: 不一定在各方面基本优秀，但作品有创新感的，奖励max(作品个数,20)个赞。抽取部分作品改编收藏增加热度，有5%的概率被人员举荐给秃头。直接进入逆天团队，但先为3级成员。
    幸运奖: 在An个参赛者中随机抽取第Ai(i=rand(A1,An))个用户，奖励max(作品个数,30)个赞。
    冠军奖: 直接进入逆天，成为3或2级技术员，奖励max(作品个数,20)个赞，参赛作品被收藏，并得到一个人的关注。(作品必须足够好，必须有GUI界面，实用，各方面完全优秀，否则第一页无法得到)
    主管奖励(奖励不比冠军奖差，但逆天看情况自定):
      逆天奖: 作品质量达到小轩，吴宇航，林林，黄羿杰，胡锦辉等人的水平，必须有GUI界面(并不易拿到)
      小轩奖: 作品质量让小轩刮目相看，水平极高，必须有GUI界面(并不易拿到)
      林林奖: 高质量沙盒作品(并不易拿到)
      付开霁奖: 高质量自制编程语言(并不易拿到)
      吴宇航奖: 超高质量各方面结合应用或游戏(并不易拿到)
    更多设定中...
  4.版权:
    仅仅是活动，作品版权仍然归作者所有。
  5.每次活动的特殊事项、详细内容由逆天团队官方讨论决定。
  6.参加对象: 所有C站用户。
  7.逆天成员参加，同样可以得到奖励。
  更多设定中...

/小轩:
初二真是紧张，但也挺舒服的，进来作业和默写一直全对，遥遥领先（
周末和国庆会来看社区、B站、洛谷
有新想法，打算开写自己的传记（？
更多评论区讨论？

-结语:
妈的，爸妈催睡了。''')

print('\n\n逆天团队[INS] (C)Copyright.2015-2023 保留所有权利。')