#include <iostream>
using namespace std;

int main() {
    cout << "    我的确是玩python的人，不过学校既然有个信竞队我就参加了。（我现在是我校信数双修）" << endl;
    cout << "    所以重拾一下cpp" << endl << endl;
    cout << "    一开始很多东西都忘了，几乎忘得只剩语法，不过我进度赶得还可以，一周多学掉了字符串结构体贪心二分搜索线性dp之类的" << endl;
    cout << "    最近一个月的话，我学了点树状数组，线段树，字典树，并查集之类的数据结构，一点图论，dp学了个背包和区间和树形，都是新知识，很有用" << endl;
    cout << "    可能是以前写过解释器了，思维有所提升，对这些结构的理解比较轻松吧。" << endl;
    cout << "    我的话指针比较玩不懂，因为打oi不怎么用" << endl << endl;
    cout << "    当时第一轮j/s都参加了。大家都说j比s还难，但是我不认为。我s的题目很多看不懂，算是瞎写写，j拿了82.5，s拿了59.5，都过了" << endl;
    cout << "    这周末就要去第二轮了，好久没看C站就回来说两句话。" << endl;
    cout << "    高一比较忙，住宿 + 单休。这两天我生病回来挂水，稍微发个作品表示一下。我生日那天还要去南京考j/s的第二轮。能否1=就看运气。毕竟是第一次打oi" << endl;
    cout << "    如果真没过，明年还有一次机会，我信心比较充足" << endl << endl;
    cout << "    另外说一句，高一九门课确实挺累的，作业忙不过来，心理压力也比较大，希望大家实在一点，不要想些有的没的，想做的事就去做吧。珍惜一下小学初中的时光。" << endl;
    cout << "    祝大家在校的期中全都获得好成绩，打竞赛的都rp++, pts++;" << endl << endl;
    cout << "    by 小轩（有思想的不定积分）";
    return 0;
}