print('''\033[1;32m最近没啥好发的，大抵是病了吧（
我以一篇诗歌开头：
  大鹏一日同风起，
  扶摇直上九万里。
  假令风歇时下来，
  犹能簸却沧溟水。
  世人见我恒殊调，
  闻余大言皆冷笑。
  宣父犹能畏后生，
  丈夫未可轻年少！
中二病犯了，不是吗（doge）
\033[0m

直接进入正题。
\033[1;33m对于过去：
呵呵，人真的很奇怪。我成长了吗？我并没有这种感觉。但是不管在什么时候，看一眼一年前的评论，都感觉好幼稚🤣 🤣 🤣
我过去自以为很强大。那么现在，是我变得相对更弱，还是我对“强大”的认识更深刻了呢？
我 是过去的 我 吗？我 对得起过去的 我 吗？
非常抱歉以前对凌锋的误解。几年前的我竟然没有细究事情的真相。非常幼稚的“敌对反攻”的模式。根本不知道查找凌以前的作品是否有重名和无差别转移其它作品。
非常抱歉之前对锋利笔尖的不接受，甚至写了一篇不明意义的反批判。我并未取得真正的胜利。还有对您未改名之前L++作品等“不属于你”的误判。
又想到以前因为我是最早发现封面的人之一，我自封“封面之父”，显然这个词语不太恰当，后来又自己撤销。
又想到那些奇奇怪怪的大多写了一半又弃坑的作品。
反观这些例子，足以看出以前的我是怎么一回事儿了。
忏悔吗？不是。或许只是精神状态有点正常而已。
罢 罢 罢，没必要和过去的自己争吵。朕如今大赦天下（？
以后再有任何人进行无理由喷，大概也不会理会了，删除评论罢。管他们再怎么使用激将法呢。
举个栗子，那李宇也不用管，他先在【计算器】下面乱喷，那是他的问题，跟我们无关，得出不用理会。
实变函数，林林，刘镕硕，蔡宇翔等人，就如此罢，以后也不必管和理睬这些了（
如果是发恶意的作品，那就让喷子发去。他们说什么，也跟我无关，是个主观臆断罢。
、、、
想过去，只会绝望和冷啸，无一分开心的滋味，在别人看来“666这个入是桂”，在我看来“就是小丑罢了”，不如看看当下。\033[0m

\033[1;34m对于现在：
当下又有什么呢，反而没以前那么“强”了，可能是环境对我的影响罢（除自身都是环境）
我悬着的心已经死了一半了，我作为一个逆反天命的人，却还是难以抵挡一些挫折，受着不断的痛苦而又不能放弃（放弃是什么？你们知道的。）
我从来没有查过抑郁症什么的，也没有必要。虽然很多人不懂我。（信息有点碎片和结构不完整，不要怪，这篇是随笔杂谈）
\033[32m逆天，逆天，逆天之路，或许是这样困难的罢。不懂得的人都说逆天之路的环境好，可是谁真正走过这条路呢😅 😅 🤣
  我发散心中善良  却只遭到它的藐视
  我追逐那年梦想  荆棘满地谁又知道
  世人都装作知道  而笑我年幼痴狂
  而我这大好青春  只作献祭天上
  我漫步逆天小路  一块石头摔倒十次
  我路上帮助多人  暗地只有反被背刺
  看着身边众人    无一个不啸
  在另一条赛道之上似乎又根本不如别人
  我铸造惊天板斧  妄想劈开天路
  我带领同志      杀尽拦路之虎
  在红光满天的前方终点已经发出亮光
  翻过这个山头才发现逆天之路还很漫长~~~
  路上细石纹路    天上宇宙星辰
  我思考万物运行  到底是什么哲理
  我以为正义永存  不想邪恶总是胜利
  我带领同志      杀尽前路邪恶
  在战鼓雷鸣的前方终点已经发出声响
  划过这条长河才发现胜利之路还很漫长~~~
  我倒在地上      准备放弃疯狂
  又忽然爬起      向终点缓步挪移
\033[34m笑死了，我怎么会写出这么幼稚的东西！
我大抵是病了疯了罢。
\033[31m不如就用网校学员的《病》二创一番？很快就能见到。
\033[34m我也不知道为什么会这样。学校？家长？同志？我自己？恐怕不知道。
笑死了，这还写个毛线啊，反正写了又没人能懂，san值都掉光了。。。
\033[32m痛~~~~~~~啊~~~~~~~~~~~~~~~~~~
  时代的接力棒  我的真假梦想
  轰击无用政策  怎么如愿正常
  形式主义嚣张  我无法一人反抗
  痛恨正义不到  价值观都不一样
  我慢慢思考    我存在的必要
  我停下脚步    拿出镜子来照
  我抹去血泪    只在半路喝吆
  我啸那众人    不懂真的闪耀
\033[34m笑死了，我怎么又双叒叕写出这么幼稚的东西！
真的没法写了！
这是篇废稿罢，还是别发出来了。
对了说一句，@林林 我是普通人
\033[32m呃，我怎么进行比较呢
  终点向下望  虚伪名声扬
  压根就只有  悬崖在前方
  搭上个吊桥  来到那对岸
  天神告诉我  虚拟世界能上岸
  上个**的岸啊，当老子是鱼吗，老子不干了！
\033[34m最沉浸的一次，从“对于现在：”开始到上一行结束是睡着了写的
证据是写的时候用嘴呼吸，眼睛微闭
所以如果前面写了什么都不要管，我也不知道写了什么
这里才是真的要写的东西。
我是不怕困难的，遇到什么问题也会主动改正，多半需要点成长。
IDU项目是我最近写的项目，2D部分会和实变函数持续在社区发布，望大家多多支持。毕竟我是限流，欢迎支持实变函数或者分享我的作品。
打字是很累的，我每天几乎上线8到14个小时，眼睛会有点累。
这不去吃点东西补充点能量（笑。
引用一句林林的话：
——没有人的文明，毫无意义！！！（振动水滴）
哦，还有，之前说的什么大赦天下，什么乱写的一堆实现性的东西，大抵是我写完《病》之后才能实施罢。
量变产生质变。涌现！写个集贸啊！\033[0m

\033[1;36m对于未来：
这里就写得轻松点吧。
人类文明微不足道，但它距离创世神，只有一个东西需要解决。
那就是意识。（这是哲学问题吗？我想在此处已经不是了。）
人类需要研究意识控制（思想钢印？不会吧）、意识交互（输入输出）、意识上传（到虚拟世界）
就可以达到成为创世神的状态。
研究意识的本质和性质
就可以达到追溯创世神的状态。（为何追溯在成为之后？想一想。）
\033[2m什么金钱，什么夸克，什么宇宙，什么人的皮囊，这时候万物都是废物。
\033[0m\033[1;36m-------------------------------
还不去写我的IDU项目雏形（写完了也是雏形，为什么？想一想。）😀 😀 😀
还不去玩IDU💩 💩 💩\033[0m

\033[7m文稿献祭80分钟的宝贵青春。\033[0m\033[8m\033[3A\033[?25l''', end='')