print('''
虽然一直在掉粉
但我发现涨粉比掉粉快
想取关的，我也不强求
想关注的，请关注吧
谢谢你们的一路陪伴
鼓励我做好作品
给我好的建议

好了，不客套了，马上进入正题！
我顺带说一下，我现在目标明确了，自己在C站不是为了
赞、关注、荣誉感
而是为了
找厉害的人
组成一项科研团队（怎么有点《银河帝国：基地》的感觉）
以后一起向未来
懂了吧

由于我L6毕业了
在C站这个水平线混真的没意思
以后暑假(2022/7-8)我可能上洛谷、python.org、各种编程网站了
我决定以后我要开发中国的电脑系统，为中国加油~！~！~！
争取超越Windows(maybe)/Mac(doge)/Linux(what)

粉丝们，我快有500粉了！为什么我的发的每个作品连5个赞(占粉丝的1%)/50浏览(占粉丝的10%)都没？
这不是我要的，上面已经提过。但是这反映了一种C站现象，懂的都懂

所以呢？
所以呢？
所以呢？

自己想去吧！
---------------------------------
竟然L1的人会说L2/L3的人好
却说L4/L5/L6/毕业的垃圾
恐怕是**不懂吧！
（特别提到某个叫****的人一直只会*）

好了，想跟我就跟，不想跟拉倒！！！
上面的内容，记得滚轮！！！
''')