print("""这期写逆天的重大会议。
会议编号：INSameet04
会议名称：逆天编程奇点会

会议人员：
1.逆天内部成员
2.高技术人员、社区大佬等
3.活跃与外交人员
4.oier
5.编程构架人员
6.高等数学研究者
7.量子力学研究者
8.对哲学感兴趣的人
9.社区内历史、科学、编程、社会学研究者
10.有空闲的、看着玩的人
注：并非专业人员，只要有点接触的研究者，都只要随便看看，不一定参与

讨论者限制：
1.会点编程，哪怕sc
2.满足会议人员中任意一条
3.三年级以上
4.懂点基础的科学
5.善于思考
6.能正确讨论，不随意M人，文明讨论，不过于看低他人
7.不看低或者看高本项目
8.不对这个项目抱太大希望，不然失望会很大

会议传播：逆天团队成员互相转告，感兴趣者可以传播
会议预测：弄着弄着就成功地玩起来了

会议内容（正片开始）：
越往下越深入、越疯狂、越对很多人劝退
1.开启INS编程社区网站与本地同时编撰，扩大编程范围(你绝对想不到这么大型的东西仅仅被放作第一位)
  进程：INS编程社区 3%
        INS-IDE 30%
        0.8k行左右
  打包占用预计存储：300MB及以内
  其他：碾压社区一切编辑器
2.公布《小球世界》新一版本，提出意见，大型制作(是个游戏，源自我的小说，更以前是个梦，不建议多人制作)
  进程：整部游戏 1%
        基础 10%  大约300行
        秘密中心 0.5% 涉及30行
        内容 2% 大约1k行
        其他 大约200行
  打包占用预计存储：700MB及以内
  其他：碾压《传说之下》
3.三体运动预测(涉及到一些。。。问题，所以需要场外支援)(注意有一个行星哦)
  进程：未开始
  打包占用预计存储：1GB及以内
  其他：吓晕我主
4.insjhx语言重写(支持分支、循环、控制语句、特别数据库、比python速度快、有虚拟机、函数、类、结构体、复合体、结构机、链接多语言、接近自然语言等)
  旧版进程：60%弃坑
  进程：未开始
  打包占用预计存储：100MB及以内
  其他：碾压全世界
5.人类社会基础模型(不知难到什么程度，做出来直接创造历史)
  进程：未开始
  打包占用预计存储：5GB及以内
  其他：或许很有意思
6.高强度宇宙模型(有没有吓到)
  进程：未开始
  打包占用预计存储：100GB及以内(对我随便放10T的电脑来说就是渣)
  其他：骂我想象力吧
----------------------------------------------------
F1.节点探问(秘密计划)
  打包占用预计存储：10TB及以内(可以不用想)
  进程：未开始
F2.AI_model(机密计划)
  进程：未开始
F3.极密计划
  进程：未开始

感谢你目前的观看并且忍着不喷我！或许我的想象力还会让我多生产一些计划的！

这个“奇点”，是有意义的，同时处理逆天内政
改革晚点

其他什么不说，先写到这里
有补充和问题评论区见~
（特别支持付XX等没有编程助手的人，用了py基础）""")