class InternalConfig:
    # --------------------------------- 渲染 --------------------------------
    # 渲染距离（以区块为单位）
    RENDER_DISTANCE = 1.5

    # 视野
    FOV = 90

    # --------------------------------- 性能 ---------------------------------
    # 每帧的每个区块中最大子区块更新数
    CHUNK_UPDATES = 4

    # 是否开启循环并行
    PARALLEL = False

    # 是否使用 early-z
    EARLY_Z = False

    # early-z 的排序算法
    EARLY_Z_ALGORITHM = 'quicksort'

    # --------------------------------- 质量 ---------------------------------
    # 环境光遮蔽和平滑光照
    SMOOTH_LIGHTING = True
    # 平滑光照通过对每个顶点的光线进行线性插值来实现，从而在每个片段上实现光的平滑效果
    # 它还添加环境光遮蔽，以模拟被不透明对象阻挡的光线
    # 此功能会严重影响区块更新/构建速度

    # 缩放比，用于清晰度
    SCALE_RATIO = 1

    # 是否使用平滑缩放
    USE_SMOOTH_SCALE = False
