print('''逆天团队全览2024
逆天团队是由小轩创立的团队。
逆天团队是自小轩的A字团队、宇宙工作室等团队创新路线以来的最新统领团队。
人力无限，人定胜天。
逆天团队的人员供应有学而思、qq、洛谷、b站、github等多种线上渠道，以及线下对同学的招揽。
逆天团队最早可以追溯的前身是2015年的想想队，在宇宙工作室(2020年)是关键的线上组织时期，到逆天工作室(2022年)逐渐稳固地位。
逆天团队在非必要情况下，在之后的几年内，继续均由小轩负责担任团长职位。

\033[1;32m以下是逆天团队的构成部分:
1.逆天工作室(核心)
2.宇宙工作室(外层)
3.联梦部(重要分部)
  (支部I) 联梦工作室
  (支部II) 联梦全国学习协会
  *(支部II+) 联梦研学社(开发中，附属于支部II，最早的话暑假开放)
4.油饼组织(分部)
5.INS-OI(算法交流支部)
6.A字团队(线下支部)\033[0m
---------------------------------------------



详细表单(不区分排序，如有组别也不分高低级，但和活跃度等相关):
\033[1;32m1.逆天工作室 | qq: 652920883\033[0m
管理:
    室长: 小轩
    副室长A组: 吴宇航 黄羿杰
    副室长B组: 胡锦辉 何嘉晨
    主管A组: 林林 袁梓轩 Mozart 李梦唐 鱼翔浅底
    主管B组: 张余辰 王翰德 可乐 浅梦 李博闻 李弈霖(小宝) 刘镕硕
    主管C组: 实变函数 陈致 张振宇 徐一茗 黄浩朗 冀厚锦 蔡宇翔 李官阳
    线下主管: 张余辰(A) 柳树(B)
开发:
    应用A组:
        小轩 吴宇航 黄羿杰 胡锦辉 何嘉晨 袁梓轩 林林
        李梦唐 鱼翔浅底 浅梦 刘镕硕
    应用B组:
        李弈霖 冀厚锦 尹鹏皓 邹启航 张颢译 杨鲲霖
        黄浩朗 蔡宇翔 王翰德 刘元序 陈子衿 周绪航
        程煜轩(b站:游戏玩家鸡翅) 张振宇 李官阳
        实变函数 落月花林 徐天宇 季煜杰 杨一诺
    应用C组:
        网校学员(uid=44673885) 彭逸航 樊伊航 王瀚哲
        刘牛牛 梁纳源 傅宇桐 刘粤辰 冯俊曦 邓子阳 李子园
        秋秋 贺宏毅 欧文杰 王张弛
    应用D组:
        王麒凯 刘子宁 刘宇杰 赵乐 倪梓航
        高熙程 初与久歌) 王捷 沪思乐阿拉(b站)
        西西 王彬如 杨浩轩 克隆人 锦辉论科技
    应用E组:
        彭新峰 张恺宁 李梓涵 刘维开 朱梓萱
        吴漾 囡汐菲菲 梁乐天 刘某杰(刘宇杰小号)
    算法A组:
        Mozart 可乐 黄羿杰 王祎嘉(Justin) 袁梓轩
    算法B组:
        小轩 鱼翔浅底 胡锦辉 丁康骏 sssvip(洛谷) 林将军
        JC_Lee(洛谷) 薛亦涵(孙亦承) Gracezhuzhu(洛谷) 杨鲲霖
    科研组:
        小轩 柳树 陈鸡猴 朱哥 航航 朱洺扬
        张余辰 李俊鑫 张宋佳
        王翰德 实变函数
    各类部长:
        Scratch: 李梦唐
        Python: 小轩 吴宇航 黄羿杰 林林
        Py-Cloud: 何嘉晨 吴宇航
        C++: Mozart 可乐 黄羿杰
        Javascript: 林林 李梦唐
        Typescript: 吴宇航
        H5: 小轩 吴宇航 李官阳
        Py-Flask: 小轩 李梦唐 尹鹏皓
        外交: 吴宇航
        人事: 小轩
美工: 小轩 林林 程煜轩 朱洺扬
搬运工: 苏永昌
反喷: 林天辰
史官: 朱昊涵(c站史) 柳树(世界史)
开团功臣: 张余辰(逆天线下部)
          杨一诺(宇宙工作室宣传)
          胡锦辉(宇宙工作室副室)
          吴宇航(杰出团内贡献)
          李俊鑫(A字团队)
退站纪念: 曹羽翀 胡家瑞 孔维禹 王毓轩 陈禹安

---------------
\033[1;32m2.宇宙工作室 | qq: 无\033[0m
室长: 小轩
副室长A组: 吴宇航 胡锦辉
副室长B组: 袁梓轩 何嘉晨
主管A组: 林林 张余辰 李俊鑫 李官阳 徐一茗 黄浩朗
主管B组: 曹羽翀 彭逸航 李欣凌 王翰德 王瀚哲 王张弛
成员: 李梓涵 梁乐天 冯俊曦 陈奕鸣
      许卓楠 林承逸 黄智灏 何秋勇
      何若琳 高原 次元之主唐博虎
      梁子程 妥海阳 王梓瑶 李哲宸
      徐周韬 李胜豪

---------------
\033[1;32m3.联梦部 | II支部qq: 721181354\033[0m
\033[1;33mI. 联梦工作室\033[0m
    室长: 小轩 吴宇航
    副室长: 胡锦辉 李弈霖 黄羿杰
    成员: 林林 浅梦 王翰德 王瀚哲
    顾问: 付开霁 Mozart 宋佳豪 王玎珰 张振宇 林林
          李梦唐 彭禹嘉 符汉衡 郭燕铭 等
\033[1;33mII. 联梦全国学习协会(主要支部) | qq: 721181354\033[0m
    会长: 小轩
    副会长: 柳树 张余辰 Mozart 黄羿杰
    会员: 林林 Justin 曹曦文 丁康骏
          雪豹是一只肥豹 花有人怜
          好 今天熬夜学习 lilac
          李俊鑫 旻偲 袁梓轩 雨晨
          何季航 朱洺扬 Ray -
\033[1;33m*II+. 联梦研学社(开发中)\033[0m

---------------
\033[1;32m4.油饼组织 | qq: 不便透露\033[0m
\033[1;33mI. 油饼团队总支\033[0m
    团长: 柳树 小轩
    成员共11人，由线下成员构成，涉及大量真实姓名，不便发布
\033[1;33mII. 油饼学习小组\033[0m
    团长: 陈鸡猴
    成员: 成员共9人，由线下成员构成，涉及大量真实姓名，不便发布
\033[1;33mIII. 小丑会\033[0m
    会长: 小轩
    成员: 不便展示

---------------
\033[1;32m5.INS-OI | qq: 649263817\033[0m
团总: 小轩 Mozart 可乐 Justin
群主: Mozart
群管: 小轩 可乐 袁梓轩 黄羿杰 QWQ_123 Justin
      月明かりを注 烟雨任平生 Shine_Caie
成员: 约60人(详细名单过长，可以加群查看)

---------------
\033[1;32m6.A字团队 | qq: 无\033[0m
团长: 小轩
成员: 约10人(不便透露真名)
虚拟角色: 约50人(不是真人)
---------------------------------------------



\033[1;36m分工作室、友军、友好人员、友好合作工作室及室长等:\033[0m
*[注意: 有部分团队已经更新/改名/销毁/合并，所以此处不是最新更新]
方圆工作室(吴宇航)
mac工作室(胡锦辉)
MA工作室(李梦唐)
wood工作室(张颢译)
五凌(广山凌联)
四会(朱昊涵)
星迹(浅梦)
小王工作室(王翰德)
CZ工作室(陈致)
rabbit工作室(蔡宇翔)
砂糖工作室(季煜杰)
疾烽工作室(张振宇)
Windows滑稽病毒工作室(王张弛)
|竹|工作室(袁梓轩)
若宇工作室(王若宇)
ppy工作室(王祎嘉)
Python工作室(邓子阳)
北极星集团(刘牛牛)
三侠集团(焦旸惠)
黄昏工作室(杨鲲霖)
快乐儒艮(杨鲲霖)
瑜瑾工作室(郑钰涵)
东方红工作室(刘宇杰)
Keps工作室(胡家瑞)
可多工作室(老W)
HYOI（拜火教）(王玎珰)
战神之队(luogu:ssssvip)
阿豆工作室
社区公会
天海蚁会
刘炳毅 王玎珰 符汉衡
严子昱 赵喆 轩弥
十字骨 赵乐 周周
宋佳豪 郭燕铭 谢法然
汤浩辰 李健睿 奥利给
温岚之 刘元序 刘汉元
小饼干丶 郭铸锋 倪亦柯
富兰克林 灵笼INCARATION


\033[1;34m逆天团队(Copyright.2015-2024)\033[0m
\033[1;32m*由于篇幅较长，请滚轮/拖动条移到终端顶端开始观看！
\033[8m\033[6A\033[?25l''',end='')