print('''昨晚又被骂了。
我就搞不清楚，我身为一个学霸，我妈为什么要这样担心我。
我不知道哪里做错了，就是暑假玩玩就有什么事吗？编程有什么坏处？
会有人说编程会伤眼，但是这是我唯一的最喜欢的兴趣爱好，我又不会成瞎子，最多就是有点近视，又有什么？
我妈说我不写，别人还在卷，过了暑假就会超过我了？？？我以前从来就没有遇到过这样的事，又为什么要担心？
我明明自己规划好了暑假，是的，我本来规划好了暑假，但是每次都被家长打乱了。他们会说对我很好，别人家长的限制肯定更多了，我就想不清楚，我还是编程，我同学还都在打游戏呢，就是内卷，他们也没有比我成绩好啊，有什么资本来说我没完成，营销号看多了？
这两天尤其催逼，我作业到现在还没做完。做完，我拿什么做完？
语文要写124篇阅读理解，7篇600字作文，1篇1000字读后感，20篇《红星照耀中国》和《昆虫记》的仿写200字+好词好句，30篇练字150字，课外阅读
英语要写62篇阅读理解
数学还免了
还有一本《暑假学习生活》，类似于快乐暑假
还有读背，还有线上作业，妈的，真疯了！
今天不看书，回来就要把书扔了撕了卖了，这就是快乐阅读理念？？？今天写了一堆作业，回来还受骂。打个洛谷oi比赛都不安心
呵呵，暑假还打算运动的，到现在一天都没锻炼。
作业没做完，
b站视频堆满，
c站作品来不及做，
洛谷比赛变蒟蒻，
csp-j课和题目来不及搞，
qq来不及聊，
也没有提前学，
体育还是不及格。
到了哪里都是被欺负的份，分数高了遭人嫉妒，分数低了训话，分数中了不甘心，我怎么考？我怎么考？？？
真的服了，真的，我过一段时间就可能想死，但我又不想死，我还有梦想。你让我怎么有梦想？？？
我天天就在这里痛苦，听别人牛逼，永远都是人为刀俎我为鱼肉，我在家里不能释放，同学来一次多骂几句，根本找不到释放，网上交流又恶性循环
关键是，我本来比别人厉害啊，为什么？我还不够格吗，我写八股文写到人人都满意彳亍吗？！
小学体验小学的苦，初中体验初中的苦。可能有人会说，和家长沟通。
什么东西啊？沟通是什么啊？我家长说我口才好，我见人就自来熟，我滔滔不绝，我讨论知识，我书写文章，我怎么就说服不了你们呢？沟通有啥用啊，我的思想觉悟高你们几个台阶了，我自己解释了一万年都解释不清楚！信我不如信同学和营销号！！！ 
真的，太痛苦了，简直不是人，我默默忍受一切，没人懂我，亦或是懂我的人帮不到我，我怎么办？我只能这样。
我要怎么才能自由？我当然可以辍学了白手起家直接编程，可是也赚不到什么￥，况且，班里的倒数都能好好活着，凭什么我就不能好好活着？不会遭笑话吗？我不想，我还有同伴和老师，我还是我自己，我需要理解！
啊，我是(____)，我还不能说违禁词，我要怎么样才能直抒胸臆呢？啊，啊，我已经无法用语言来形容了，啊啊，啊，啊，啊啊啊，啊啊，啊，啊！
哎，我就不能自由按照我的意愿执行吗？我永远是阶下囚？我如何缓解？缓解有毛线用？啊，啊，啊，啊，啊，啊，啊，啊
真的，我太聪明了，以至于聪明得我想不到逃生路线，啊，啊，啊，啊，啊，啊，啊，啊，啊，啊，啊，啊，还真不是复制，啊，啊！
这个世界太无聊了，啊，啊，啊，啊，啊，啊，啊，啊
实在太美，啊，啊，啊，啊，啊，啊，啊，啊，啊啊，啊，啊，啊，啊，啊，啊，啊，啊，啊啊，啊啊，啊啊啊啊，啊，啊，啊，啊
我是笼中的九天玄鸟，我是没有伯乐的千里马，我是鱼肉，我是天神，我是封存的封存，我是鲁迅笔下的人，我是李白嘴中的诗，我是马斯克口中的星舰，我是print，我必须input，我只是iostream，我是宇宙，我是奇点，我是人，我是彳亍，我是人，我是人。
我是空灵，我是，啊，啊，啊，啊，啊，啊，啊，啊，啊，啊，啊，啊，啊，啊，啊！
我不能表达出我的难受，因为表达了别人会让我更难受，啊，啊，啊，啊，啊，啊，，啊，啊，啊，啊，啊，啊，啊，，啊~~
我相信有人能看懂，有人能看不懂，啊，啊，啊，啊，啊，啊，啊，啊，啊，啊，啊，啊，啊，，啊，啊，啊，啊，啊，啊，
时间晚了，已经下午了，到了，啊，啊，啊，啊，我不想再浪费时间了，可是我必须浪费时间，我想？(?，az,az,az,az,啊，啊，啊，啊，
啊，啊，啊，啊，啊，啊，啊，啊，啊，啊，啊，啊，啊，
啊，，啊，，啊，，啊，，
啊，，，啊，，，
啊、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、
？！？！@#！￥@&》！#￥》&》……&￥@*》）（）+~·@21·55483`23&*>^#%^=>114514<1919810>>endl;21?que@34Ewque32？@#！
。。

行路难！行路难！
多歧路，今安在！
长风破浪会有时？！？！？？直挂云帆济沧海！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！
啊！啊啊！！！！！！！！！

markdown LaTeX
| 
| 暑假是快乐和悲催的。平时是悲催和快乐的。——insjhx(逆天小轩)
| ''')