print('''方块信息表(toGUIversion) Version 0.1
逆天小轩 Copyright.2015-2023 INS
保留所有权利。 All rights reserved.

2023/7/8 第1版
---------------------------------
id: 0
名称: 空气方块
个数: 50000000 (为标准个数，但因人而异，后面的个数也如此，缩放情况下此作为比例)
描述: 普通空气，看不见，摸不着。

id: 1
名称: 草方块(也可作艹方块)
个数: 1000
描述: 一颗小草也可可爱爱呢，通常长在陆地上

id: 2
名称: 土块
个数: 8000
描述: 地下面不就是泥土吗哈哈哈

id: 3
名称: 矿块-铁矿
个数: 48000
描述: 挖下去，可以看到矿物质吗？

id: 4
名称: 矿块-银矿
个数: 15000
描述: 这玩意似乎闪闪发光

id: 5
名称: 矿块-金矿
个数: 35000
描述: 听说黄金很贵的

id: 6
名称: 矿块-钻石矿
个数: 11000
描述: 稀有值钱还有用

id: 7
名称: 矿块-绿钻矿
个数: 2000
描述: 很少见到绿色的钻石捏

id: 8
名称: 矿块-黑钻矿 (黑曜石)
个数: 1000
描述: 这种矿石是黑紫色的，非常硬，价值极高

id: 9
名称: 矿块-超级黑钻矿 (超固黑曜石)
个数: 300
描述: 矿石之王，传说钻石镐都挖不掉

id: 10
名称: 矿块-创世矿
个数: 10
描述: 创世级别的矿石，有多少人能拥有呢？

id: 11
名称: 基石
个数: 不定
描述: 不可铲除，相当于mc中的基岩

id: 12
名称: 木块
个数: 66000
描述: 生命力顽强的树，数量很多呢

id: 13
名称: 叶块
个数: 100000
描述: 树叶，不知道有何用？

id: 14
名称: 岩浆块
个数: 4000
描述: 似乎很烫诶

id: 15
名称: 水块
个数: 150000
描述: 这东西很水，但是是生命之源！

id: 16
名称: 岩浆块
个数: 15000
描述: 这水的颜色怎么怪怪的？？？试试在里面游泳！

id: 17
名称: 沙块
个数: 33000
描述: 沙滩少不了

id: 18
名称: 命令方块
个数: 100
描述: 这玩意能输入指令？

id: 19
名称: 留言板
个数: 150
描述: 一块小板板？

id: 20
名称: 砖块
个数: 4000
描述: 砖头是红色的

id: 21
名称: 存储块
个数: 6000
描述: 它似乎是个箱子……

id: 22
名称: 塑料块
个数: 20000
描述: 世界上有很多塑料，造东西用

id: 23
名称: 计算器
个数: 20
描述: 如何快速四则运算？

id: 24
名称: 炸药块(TNT)
个数: 2000
描述: 紧急情况才用

id: 25
名称: 材料块
个数: 1500
描述: 这个东西变化多端

id: 26
名称: 混凝土块
个数: 16000
描述: 造楼用
---------------------------------
有建议请提出。
希望大家想象更多方块。''')