#补充第26行代码，利用列表遍历的方法遍历列表p，生成p列表中障碍物位置
#补充第41行代码，随机设置8个随机障碍
from map import *
from random import *
#背景和形象设置
bg("bg2.png")            #可替换背景
role("王立松.png")            #可替换成你喜欢的人物形象
barrier("barrier2.png")  #可替换成你喜欢的障碍物形象
reward("reward1.png")    #可替换成你喜欢的宝箱形象

#位置列表
pos = ["a2","a3","a4","a5","a6","a7",\
    "b1","b2","b3","b4","b5","b6","b7",\
    "c1","c2","c3","c4","c5","c6","c7",\
    "d1","d2","d3","d4","d5","d6","d7",\
    "e1","e2","e3","e4","e5","e6","e7",\
    "f1","f2","f3","f4","f5","f6","f7",\
    "g1","g2","g3","g4","g5","g6"]
    
########################################
level(1) #第一关

#设置障碍物位置（下面障碍物的可以增加、删减或者修改）
p = ["b1","d3","e3","f3","a4","b4","c4","d4","a6","d6","e6","f6","g6"]

#补充第26行代码，利用列表遍历的方法遍历列表p，生成p列表中障碍物位置
for i in p:
    bpos(i)

#设置宝箱位置（下面宝箱的可以增加、删减或者修改）   
r = ["c2","d2","e7","b6"]
for i in r:
    rpos(i)

#enemy(1)  #可以增加、减少敌人的数量

#################################
level(2)  #第2关


#补充第41行代码，随机设置8个随机障碍物
for i in range(8):
    t = choice(pos)      #从位置列表中随机选取一个位置
    bpos(t)

#设置宝箱位置（下面宝箱的可以增加、删减或者修改）          
r = ["c6","c6","d2","g6"]
for i in r:
    rpos(i)

enemy(1) #可以增加、减少敌人的数量

################################
level(3) #第3关

#设置障碍物位置（下面障碍物的可以增加、删减或者修改）
p = ["f1","b3","f3","b4","c4","d5","f4","b5","f5","d6","g6","d7"]
for i in p:
    bpos(i)

#设置宝箱位置（下面障碍物的可以增加、删减或者修改）    
r = ["e5","f6"]
for i in r:
    rpos(i)

enemy(1) #可以增加、减少敌人的数量

########################################

#启动游戏
play()