print('''我也是三个月没更新作品了，都快忘了C站了。
这次中考出分了，发个作品记录一下。

语文 130/150 （考前生病，这个时候腹泻，不过扛下来了，成绩也还行）
数学 143.5/150 （尺规作图两解漏解）
英语 116/130 （整个初中发挥最差之一）
物理 96/100 （后面急了，不过还可以，前面全对）
化学 75/80 （不知道哪错了）
政治 45/50 （正常）
历史 47/50 （看错一题，可以接受）
体育 40/40 （不评价）
总分 692.5/750 （正常发挥）

分数应该比省重点分数线高个20分左右。和同学互相分享了一下，感觉不算高，也不低。
700+的人也有些，我这次班级第4，是这个学期排名最靠后的一次。
可能考前生病有一些影响。
不过现在基本上进重高就可以了。唯一的遗憾是不足够保送强化班。

新的旅途又要开始了，过去的都过去了。
我可能要忘掉一些旧的观念，学习新的东西了。
初中确实多彩，给我带来了很多。
但我说实话，这三年也是混着过来的。没补课，没刷题，没看一本课外书，周末刷视频到作业来不及补。能这样也是很有运气。

接下来，我打算列一个愿望单，暑假能实现几个是几个。
我还要扩展一下团队，然后在B站尝试火一下（靠我的作品《打破窗口》，之后在C站和github都会发布）。
待进入高中，我的眼界应该提高一些。我需要找回我的勇气和探索精神，在实践中取得成长，寻找曾经的、现在的、未来的同伴，一起奔向这个多彩的世界，搞出新花样。

这几天我熬夜玩mc，刷视频，和人唠嗑，出去吃东西，也是很累了。
玩得差不多了就正式开始我的暑假生活。
希望C站还有活跃的人。

有思想的不定积分(小轩)
2025/6/28''')