print('''今天我想要下载vmware(当然是整蛊用，Hyper-V不好用)，然后搜索了wmware官网，还好我英语还行，能看懂不少
然后我去了VMware Version 16安装源下载，**慢，国外网站，要下2-3小时，真是要疯逼了
于是我在网上找到一个下载网站，管它有无病毒**呢，直接干，4分钟完结了。完美，找到下载就是双击安装包
然后开始了一段安装引导，不断跳出小框又突然消失，复制了一些些文件以后，它又叫我做一个选择：
○输入许可证激活秘钥
+———————————————————————+
|   -   -   -   -   -   |
+———————————————————————+
○30天体验

焯，我没买，只能30天体验了？
诶，等等……万一网上有……
嘿，还真在网上发现了，而且一大堆，那我直接搞进去
激活以后安装完成，我开始使用了，那安装啥系统呢
那……win10吧
我新建虚拟机，点击典型，按网上说，接下来应该点击以三个选项，先留空，系统稍后装
然后跳出来一长排，我选了windows10 x64就安利了
结果整了一会蛊，搞坏了，因为iso要自己下
**的，我**直接给那篇文章点踩行不！！！
“未登录不等进行次操作”
啊啊啊啊啊啊啊啊啊——————

于是我准备选择第二个选项，我去网上找镜像源
大多带病毒，伪造了，好不容易找到microsoft官方win10
于是我就欧了
我下载了工具，过了30分钟，iso肝完毕了
然后安利虚拟机
“识别到windows10 x64”
哦好了nb！还挺智能的嘛
安装系统开始
加载.
加载..
加载...
loading......
结果出来一个boot manager，lj玩意儿，干啥啥不行

我焯，废了！
找了好久，没教程，只好自己肝了
过了大概1.5小时，捣鼓出来设置的高级里面
竟然**的**不是**BIOS驱动！！！！！！！！！！！！
我，吐了
然后我手动改为BIOS

终于...成功了啊啊啊
接下来就是练得滚瓜烂熟的windows10安装界面
肝。。。
海内存知己，天涯若比邻
嗨，别来无恙啊
一切即将准备就绪
这可能需要几分钟
经典台词过了欧可ok
 - - -
完成啦！vmware真好！''')