#补充完整第25行代码，设计获得课堂称号的规则吧！

print("请小极客设计获得课堂称号的规则吧！")

num = int(input("请输入你答对的题目数量："))

# --------------------
#|  数量   |   称号   |
#|--------------------|
#|    1    |   学萌   |
#|    2    |   学童   |
#|  3到4   |   学徒   |
#|  5到6   |   荣耀   |
#|  7到9   |   至尊   |
#|  超过10 |  未来星  |
# --------------------
if num == 1:
    print("恭喜你获得学萌称号！")
elif num == 2:
    print("恭喜你获得学童称号！")
elif num < 5:
    print("恭喜你获得学徒称号！")
#作答区域。
#补充完整第25行代码，当答题数量num在5到6之间时，获得荣耀称号。
elif num < 7:
    print("恭喜你获得荣耀称号！")
elif num < 10:
    print("恭喜你获得至尊称号！")
else:
    print("恭喜你成为本节课的未来星！")