from time import *
print('宇宙工作室公告')
print('宇宙工作室开始招聘啦！宇宙工作室成立啦！')
print("聊天区见https://code.xueersi.com/home/project/detail?lang=code&pid=9792552&version=offline&form=python&langType=python")
print('请看下去︾︾︾')
sleep(1)
print('\033[2J\033[100A')
def load(n,color,color2):
    for i in range(32):
        print('\033[1;33m资源正在加载……')
        print(color+n+'/'+'5'+'▌'*i+color2+'▌'*(30-i+1))
        sleep(0.025)
        print('\033[2J\033[100A')
load('1','\033[1;32m','\033[1;31m')
load('2','\033[1;33m','\033[1;32m')
load('3','\033[1;34m','\033[1;33m')
load('4','\033[1;36m','\033[1;34m')
load('5','\033[1;35m','\033[1;36m')
load('6','\033[1;37m','\033[1;35m')
print('\033[0m加载完毕')
sleep(1)
print('\033[2J\033[100A')
print('Part 1:招人')
print('-'*40)
print('''lesson 1：创始人级别人物
室长：小轩

lesson 2：程序员级别人物
（室长非常人性化，等级上升、下降、不动看你表现）
\033[1;31m目前：6人\033[0m
特级黑客：名额3人，L5~L6
高级黑客：总名额6人，现名额4人，L4及以上
中级黑客：名额8人，L3及以上
普通黑客：总名额7人，现名额6人，L2及以上
科学程序员：总名额4人，现名额2人，L1上满12课即可加入，但要热爱编程、科学
\033[1;31m小白程序员：名额已满\033[0m

lesson 3：其他级别人物
（目前只开了2个，想添加在评论区发言）
信息传送员：名额不限
社区查看员：名额不限

lesson 4：宇宙工作室不做任何工作室的旗下
我们工作室要称王者
口号：宇宙之大，无人能及；宇宙之神秘，无人知晓；宇宙之工作室，永远无敌！''')
input('回车立刻进入下一个界面')
print('\033[2J\033[100A')

print('Part 2:关于室长')
print('-'*40)
print('''︾︾︾︾︾︾︾︾︾︾︾︾︾︾︾
室长非常人性化，公正
室长是在大米（王敏）班的王者级人物
曾引发过‘小轩事件’，‘小轩讲课’
，‘小轩大作’，‘米粉大王’
你只要和室长待久了
你就知道室长是怎样一个好人了
额，那室长是谁呢？
就是我，小轩！
我的笔名是(我的姓+A)
直接叫我小轩、A就行了
我在线下也有‘团队’
就是jhx团队。
jhx团队中我是团长
jhx就是由我的*******命名的
我的团队下级为Hero B~Z
我是德智兼优的人
不是夸口，等你来试
关于我的更多就先不说了''')
input('回车立刻进入下一个界面')
print('\033[2J\033[100A')

print('Part 3:2020-8室长新作')
print('-'*40)
print('''厉害的扫雷
快捷的聊天工具
好玩的游戏
宇宙工作室的第一个代表作
等你来助力！
来看、点赞、收藏！
来关注我！
我的作品一直上不去
只有我们团结一心才能！
其他我先不多说
马上，宇宙工作室将会崛起！''')
input('回车立刻进入下一个界面')
print('\033[2J\033[100A')

print('Part 4:工作室专属库、标志logo')
print('-'*40)
print('''所有库、标志logo
都由我亲手造就！
标志logo会出的！
库吗………………………
jhx库，比xingyunlib还
厉害！快捷！
由 classmethod_def
和 __init__(class)
还有2层class
jhx 1.0诞生！
马上就发布给你们！
新的好东西：：：
jhx宇宙病毒
jhx宇宙…………
真正的品牌哦！
会出的！社区好起来！
关于我们和别的工作室
达成[合作协议]
快快点击Enter吧！''')
input('回车立刻进入下一个界面')
print('\033[2J\033[100A')

print('Part 5:合作')
print('-'*40)
print('''将会合作：
星光工作室
火焰工作室
麻烦的工作室''')
input('回车立刻进入下一个界面')
print('\033[2J\033[100A')

print('Part 6:招募范围与不好信息的处理')
print('-'*40)
print('''lesson1:
Python 招募 L0~L6 所有等级
2020年8月：我这个语言L4上刚学完
L6的水平我也架得住



lesson2:
对于信息不好的东东
我自会处理

作品有极重不良信息
直接举报、删除
直接把作者踢出编程社区

作品有严重不良信息
直接举报、删除
直接把作者踢出工作室

作品有很重不良信息
直接删除
直接把作者降3级

作品有某些不良信息
直接删除
一周内把作者降2级

作品有少量不良信息
删除不良信息
一周内把作者降1级''')
input('回车立刻进入下一个界面')
print('\033[2J\033[100A')

print('''评论有极重不良信息
直接举报、删除
直接把作者踢出工作室

评论有严重不良信息
直接举报
直接把作者降2级

评论有很重、某些不良信息
直接举报
直接把作者降1级

评论有少量不良信息
直接删除
警告作者

其他不良信息：我们一起处理

更多公告：下次再见
不过︾︾︾︾︾︾︾︾︾''')
input('回车立刻进入下一个界面')
print('\033[2J\033[100A')
print("点赞，让更多人看到！")
print("          公告终")