print('''
我的Python线：
\n先前：自学了l0的内容
\n2019-10-13 我开始了我l1下的学习(梁光明老师)
\n2020-07-23 ~ 2020-08-02 我学习的pygame 来到了社区制作了第一个作品[至今未发布]-数字大乱斗
\n2021-02 我学习了python中的类，对pygame有了更深的了解，制作的春节3个节庆作品
1.红包冲突 2.年兽跑酷 3. 除旧鼠迎新牛前两个作品通过辅导老师的宣传过了100观看（其中第3个作品-成功上了首页）这让我有了创作的欲望
\n2021-02(03) 社区新增功能封面，我首次用了小轩的模板，认识了封面之父，同时我开始学习tk
\n2021年元宵节 我先后推出节庆游戏 1.猜灯谜 2.(借助小饼干的作品改编的)圆吃圆
其中第一个作品上了首页 但我认为那个作品并不怎么好
\n2021 3-4月 我用tk推出了原码破解和单词助手(但是这两个作品在后续没能抢救回来)，同时开始学c++(具体见c++线)
\n2021 5-6月 我推出了色彩游戏 ，再次登上首页，并创建了还原系列
\n2021 6-未知 我创建了手速系列 （创建了sc还原系列）
\n2021 7-8 传说之下sans火遍C站sc区 ，我用py 还原并改变成作业之下，并添加血条功能，上了首页 ，同时认识了很多人，包括胡锦辉，之后我加入了胡锦辉的Mac工作室，逆天什么时候加的忘了
           同月，我突发奇想，创作了像素画图片，上了首页
  \n2021-09-01 我进入了上海实验学校分校之一\n
\n2021 9-未知 我创作了random-music 原因是我一个只学html三件套的人，展示了她所做的随机播放音乐，那是我正好看见了向xes云端上传文件的作品，更具此作品，我做出了这个作品
\n2021-未知，当时那个游戏挺火的 然后我正好看到sc区有做这个的，就还原了
\n2021-10(11) 跑酷、走迷宫sc区很火，我有了两个想法，用pygame封装跑酷库或者迷宫库
  终于迷宫做成了，库至今未封装，跑库应为技术原因失败了，这个时候我好想认识了一个大佬
\n2022-10~2 做成了我的网页（第一版）并在github上发布，但因为速度太慢 正好被吴宇航看到我的作品建议我用vercel封装，所以我认识了吴宇航
\n2022-冬奥会期间 我用爬虫做了奖牌榜，被冀厚锦看到，认识了他 之后又做了升级版的残奥会爬虫（有获奖者名单实时更新）只不过那个网站后来不对外开放了，说了获奖者名单就空了一大部分
\n2022-开学 6下学业更繁忙了，暂退
\n2022 疫情期间 上海居家学习 回归 创作字符画图片和视频库 发布了一年前未完工的大作 竹-文字游戏
\n2022年 疫情期间 作品消失 详情见https://code.xueersi.com/home/project/detail?lang=code&pid=33348919&version=python&form=python&langType=python
         部分作品永久丢失，主要是辅导老师和客服不太给力，不给我恢复。
\n2022-疫情期间 本地arrest复原部分作品，设计点名程序，帮助课代表线上点名
\n2022-疫情期间中晚期 看到冀厚锦的有趣的api等一系列的爬虫作品，简单初步了解了api和cookie并学会了找xes的api制作了Api 获取你所有作品的信息， 然后又找到一个有趣的api 结合一个py语音库 做了青云客聊天机器人
\n2022-疫情期间中晚期 竹|成立 目前只有5个人 所有作品改名 竹|...... 认识了成智宇
\n暑假前夕 应为吴宇航的IdealXes 计划认识了何嘉晨和富兰克林
\n加入IdealXes 做了两个打杂的小库，确实很渺小
\n小轩INS计划启动并完成，小轩退站https://code.xueersi.com/home/project/detail?lang=code&pid=36447582&version=offline&form=python&langType=python
\n\n\n''')
print('''
我的C++线：
    前言：故事要从我看一本杂书说起
    我们班有个人看这本书，正好是我朋友，然后我借他数看了之后感觉很好看，于是就买了几本，加入了作者的粉丝群
    我怎么也没有想到，这和我学c++有极大的关系
    进粉丝群后，我添加了管理员的wechat于是乎有一天，有人聊起编程来，我就问了一下有没有在xes编程的，还真有有加了他，问他有没有工作室
    还真有，我就加进去了，过了半个月，这个群里有一个学c++的，叫凌凯航，他天天在工作室群里发一些我看起了高深的c++代码
    于是我萌生了学c++的念头，并结合自己在菜鸟教程上学，有问题问他的方式 学习了2个月+一个暑假 后来得知c++有竞赛 于是我想尝试一下
    \n\n
    2021-9月 c++一级通过
    碰到递归，我碰到了编程中的第一屏障
    2021年-2022年6月 凌凯航中考 我没有打扰他，考入了我们学校的编程社，跟随编程社老师学习，并报了c++的班，知道现在
    今年暑假，凌凯航考上了理想高中 我开始学习其他数据结构如哈希表也只有哈希表，开始继续在leetcode上刷题 备战今年cspj
''')
print('''
我的html-css-js线：
    自2021 5月 我快小学毕业了 于是想做个网站 于是 找到我们班一个同学 学会盒模型之后就做了个简易网站
    在凌凯航指导下传到github
    2022-7 在凌凯航建议下重抓基础（这个基础我很烂）继续学习............
    
''')
print('''
当小轩退站的时候，我也意识到了，这世界上有这么多比我厉害很多的大佬：小轩、吴宇航、李官阳、冀厚锦、富兰克林、胡锦辉、凌凯航......(排名无先后)
所以我的编程之路还很长，而这，也仅仅只是个开始
    2022-08-05-袁梓轩
    
    
''')

