# 原始内容，无 \033
"""
哎，又是一个 “网校学员” 入站了。

XesCoding 还有生机么？

我看必然有，但是概率十分小。
比如 “无韵于《离骚》？” 的 XesExt 和 XesAurora，开创了C站 Tampermonkey 之路。
但是之后 熊谷 凌 也陨落了，创建了 FurryR/esu。
再比如 AK之神黄翌杰 的 IDU-3D，技术确实 6。
以及 lrs，似乎也开创了 xes_py_helper 通过下载 python_embed 实现了打开 PySide6 程序？
而且 async/await 似乎也厉害？UI 都可以不卡。（虽然 Thread 也行）
还有小轩的实力也是不错的，至少比我牛。
最后，也不知道那个 “网校学员”（林） 有什么样的故事？
以上说的，都是一些值得关注的人。

回归正题，生机是什么？就是能用就行的社区吗？
也许 XesCoding 现在就已经没生机了。
我们还能挽救 XesCoding 吗？
NewXesFrontend 最近似乎都没怎么提交代码，看来作者似乎无心啊。
欸？逆天QQ群里好像说了在搞 OTP Client，难怪呢。据说还有个 WaterChat
然后，IdealXes 早没了，XesClient 才没了呢。
而且，违禁词，违禁词，更加难有生机。
最后，骗赞刷赞，抄袭什么的，十分常见。
起义军？有吗？有秃头也不会管的。

C站就是个轮回？同意。
【C 站 是 个 轮 回】https://code.xueersi.com/home/project/detail?lang=code&pid=53904879&version=offline&form=python&langType=python
```（不完全引用）
听说前辈们提过2019年C站盛行的抄袭骗赞。
在2020-2021年经过了相对的兴盛，2022年的沉淀，2023年的不变，C站似乎已经回到了2019年那个时代。
2020年那段时间称霸一方的大佬们，如今都在哪里了呢？
现在他们大多已经退站了。他们现在都在读初高中，离开了C站，这里注定是小学生的乐园了。
没错，C站简直是个轮回。
虽然这里还有几个为数不多的大佬、中佬，可他们又能创造什么呢？
过去了，留下了。时间就这样默默离去了。
我再看热度榜，一群赞比浏览多（非唯c被骗赞的结果）。这就是盲目点赞被骗。所谓的“点赞才能玩”？不存在的！
我们就做默默的观察者，观察着不同的时代，不同的情况，不同的技术，一样的结果重演。
值得安慰的是，我们已经看淡了这些。所以我们只把这里当做互相交流学习的安逸的地方得了。
我们的作品有没有人看也都一样了，这不过是我们之间的回忆罢了。
别人看了也没有价值。
很多人的鉴赏能力未达标。
好了，谢谢。少年们，C站是属于你们的，好好享受你们的童年乐趣吧，这样的时光不可多得的。
```

正如 lrs 所评论道：
```（不完全引用）
编程人士减少，新学员增多，抄袭骗赞只会更多。
除此之外，不是提升编程能力就是上学，因此，大佬/中佬有很大概率会减少，使C站价值减少。
终有一天，将会增加价值，但那时C站也许已经没什么大佬愿意入驻了。
```

以及，学而思陷害了 XesCoding，也同意。
【是谁，陷害了XesCoding？】https://code.xueersi.com/home/project/detail?lang=scratch&pid=25489182&version=3.0&langType=scratch
```（不完全引用）
而且，“微笑服务”，
也证实了学而思内部所谓的“好”。
是谁，陷害了 XesCoding？大家清楚了吧？
就是 XesCoding 自已陷害的 XesCoding。
现在，取消全屏，玩玩MC或者干点其他的吧。
```

总而言之，即时会有生机，也只是个乐子罢了。只有徘徊罢了。
XesCoding 的生机？不存在的，存在也很久才能出现了。

↑ 大量内容，请滚动到顶部开始阅读 ↑
Tips: 有引用的内容，所以实际内容不是很多？
使用 XesExt（不推荐） 或 XesAurora 阅读效果更佳哦~
"""

a = input("有音频，是否播放？Y或N，默认为Y> ")
if a != "" and a.strip().lower()[0] == "n":
    print("\033[32m不播放音乐\033[0m\n")
else:
    print('#xzeysx#{"type": "result", "desc": "\\u64ad\\u653e\\u97f3\\u4e50", "value": "https://livefile.xesimg.com/programme/python_assets/9fcd68525b3b3dc68fa65b83e2adb4c7.m4a"}#xzeysx#')

print("""
哎，又是一个 \033[34m“网校学员”\033[0m 入站了。

\033[35mXesCoding\033[0m 还有生机么？

我看必然有，但是概率十分小。
比如 \033[36m“无韵于《离骚》？”\033[0m 的 \033[35mXesExt\033[0m 和 \033[35mXesAurora\033[0m，开创了C站 \033[35mTampermonkey\033[0m 之路。
但是之后 \033[34m熊谷 凌\033[0m 也陨落了，创建了 \033[35mFurryR/esu\033[0m。
再比如 \033[34mAK之神黄翌杰\033[0m 的 \033[35mIDU-3D\033[0m，技术确实 6。
以及 \033[34mlrs\033[0m，似乎也开创了 \033[35mxes_py_helper\033[0m 通过下载 \033[35mpython_embed\033[0m 实现了打开 \033[35mPySide6\033[0m 程序？
而且 \033[33masync/await\033[0m 似乎也厉害？\033[33mUI\033[0m 都可以不卡。（虽然 \033[33mThread\033[0m 也行）
还有 \033[34m小轩\033[0m 的实力也是不错的，至少比我牛。
最后，也不知道那个 \033[34m“网校学员”（林）\033[0m 有什么样的故事？
以上说的，都是一些值得关注的人，都或多或少有些实力。

回归正题，生机是什么？就是能用就行的社区吗？
也许 \033[35mXesCoding\033[0m 现在就已经没生机了。
我们还能挽救 \033[35mXesCoding\033[0m 吗？
\033[35mNewXesFrontend\033[0m 最近似乎都没怎么提交代码，看来作者似乎无心啊。
欸？逆天QQ群里好像说了在搞 \033[35mOTP Client\033[0m，难怪呢。据说还有个 \033[35mWaterChat\033[0m
然后，\033[35mIdealXes\033[0m 早没了，\033[35mXesClient\033[0m 才没了呢。
而且，违禁词，违禁词，更加难有生机。
最后，骗赞刷赞，抄袭什么的，十分常见。
起义军？有吗？有秃头也不会管的。

C站就是个轮回？同意。
\033[36m【C 站 是 个 轮 回】https://code.xueersi.com/home/project/detail?lang=code&pid=53904879&version=offline&form=python&langType=python\033[0m
\033[32m```（不完全引用）
听说前辈们提过2019年C站盛行的抄袭骗赞。
在2020-2021年经过了相对的兴盛，2022年的沉淀，2023年的不变，C站似乎已经回到了2019年那个时代。
2020年那段时间称霸一方的大佬们，如今都在哪里了呢？
现在他们大多已经退站了。他们现在都在读初高中，离开了C站，这里注定是小学生的乐园了。
没错，C站简直是个轮回。
虽然这里还有几个为数不多的大佬、中佬，可他们又能创造什么呢？
过去了，留下了。时间就这样默默离去了。
我再看热度榜，一群赞比浏览多（非唯c被骗赞的结果）。这就是盲目点赞被骗。所谓的“点赞才能玩”？不存在的！
我们就做默默的观察者，观察着不同的时代，不同的情况，不同的技术，一样的结果重演。
值得安慰的是，我们已经看淡了这些。所以我们只把这里当做互相交流学习的安逸的地方得了。
我们的作品有没有人看也都一样了，这不过是我们之间的回忆罢了。
别人看了也没有价值。
很多人的鉴赏能力未达标。
好了，谢谢。少年们，C站是属于你们的，好好享受你们的童年乐趣吧，这样的时光不可多得的。
```\033[0m

正如 \033[34mlrs\033[0m 所评论道：
\033[32m```（不完全引用）
编程人士减少，新学员增多，抄袭骗赞只会更多。
除此之外，不是提升编程能力就是上学，因此，大佬/中佬有很大概率会减少，使C站价值减少。
终有一天，将会增加价值，但那时C站也许已经没什么大佬愿意入驻了。
```\033[0m

以及，学而思陷害了 \033[35mXesCoding\033[0m，也同意。
\033[36m【是谁，陷害了XesCoding？】https://code.xueersi.com/home/project/detail?lang=scratch&pid=25489182&version=3.0&langType=scratch\033[0m
\033[32m```（不完全引用）
而且，“微笑服务”，
也证实了学而思内部所谓的“好”。
是谁，陷害了 XesCoding？大家清楚了吧？
就是 XesCoding 自已陷害的 XesCoding。
现在，取消全屏，玩玩MC或者干点其他的吧。
```\033[0m

总而言之，即时会有生机，也只是个乐子罢了。只有徘徊罢了。
\033[35mXesCoding\033[0m 的生机？不存在的，存在也很久才能出现了。

\033[31m↑ 大量内容，请滚动到顶部开始阅读 ↑\033[0m
\033[31mTips: 有引用的内容，所以实际内容不是很多？\033[0m
使用 \033[35mXesExt（不推荐）\033[0m 或 \033[35mXesAurora\033[0m 阅读效果更佳哦~
"""[1:-1])
