import os
from time import *
input('''意见多多
作者：小轩

未经允许不可改编
必须回复，还得在评论区

我一直以为秃头很好
但，这几日，秃头同时下架我3作品
下架原因：【氵作】
好，你们回车（Enter）看下图片



''')
os.system('1.png')
print('''不堪回首
ε=(´ο｀*)))唉
我这么辛苦，给你们做这么多好看的作品
平均一般每个作品用了30小时以上做好
大佬级别的一般写100小时以上
代码一般不下300行
大佬级别的不下600行
修了多少bug

难得水几下，不行吗？
给粉福，给休闲，不行吗？
你们不想放松嘛？
算了，不申诉了
本来要惩罚粉丝也不弄了
而且我又要给你们精心策划宇宙战舰的作品了！

警告C站！

请 举报者自己在评论区回复 并 惩罚自己 黑自己电脑
第二，社区首页的全都是底层作品，说的不好听点是垃#作品
ε=(´ο｀*)))唉！
我们这种好作品都。。。
ε=(´ο｀*)))唉！
真**，
ε=(´ο｀*)))唉！

我承认，这是一个氵作
你——可以举报！
但是，你还想举报吗？
举报氵作者，无耻！
我才5个氵作
你们不举报王玎珰是因为你们不敢得罪Ta的氵作！
反氵作人，自我检讨！
打字真累，恨不得半退站，再这样，我就退掉！

再见！
''')