print('''这里环境运行不了。文件放在改编素材区。最低需要python3.10支持。
可以自己下载运行。IDU24H3.py是最新的。其他有一些日志文件高兴的也可以看看。

直接把2024年的工作量肝完了，所以接下来的25H1改为24H4计划了。
然而24H4有很多新的难点。
1.抛出物品的计算，应该是知道鼠标的坐标和人手的坐标，人期望向鼠标方向抛。
  这个要考虑到重力的印象、力和路程的关系。或者是使用一些数学的函数方法强解，但不是很有思路。
  所以不是很有头绪，希望大家可以给点建议。
2.生物。完全不知道从哪里开始做起。
  首先我不是很会画画，我都不知道怎么二维画出方方正正的那种牛羊。
  其次是不知道生物应该怎么运动才比较自然。不知道运动算法。更难的是战逃反应。24H4只会有友好生物，所以只要考虑逃跑。
        其中如果要动物有点智能就能难了：怎么选择最短路线、怎么发现自己被围住赶紧逃走。
  最后是生物逝世以后的掉落物应该怎么爆炸出来。以及动物的死亡动画怎么做，这个很麻烦。
  另：大量生物在世界中，全部遍历速度会慢。如何懒加载？多线程是否合适？如何不遍历全部对象？
3.对话框应该怎么设计才会更加简单？

（* 有一点点好玩和可爱的感觉了。）''')