print('''IDU又要重写了。
1900行代码将会作废，全部从0开始再重写。
我以前从未对一个项目有如此毅力（笑。

原因：
1.有一些比较高级的知识（涉及不少高中的数学和物理知识），需要慢慢学
2.代码有很多不完善的地方（目前的版本就是提供一些大概的框架）
3.速度上可能要一些优化
4.不方便维护，到时候会分多文件，并且添加一个专门的IDU_api类进行游戏api控制，学习黄羿杰优秀的代码风格
5.材质包和属性要大量更新，有很多补丁和bug要清除，一些不必要的东西要删去。
6.重写地形。
7.写一些其他的东西（剧情、开始界面、游戏下载、加载界面、音乐、美术、关联小游戏等。）有大量情节和故事设定不完善。需要完善基础框架。
8.学习先进的pygame-ce 2.5.1的一些技巧
9.添加一些合适的装饰（2D光照等。）
10.准备编写流体算法（浮力、摩擦力、空气阻力以后都要考虑）
11.更好更实用的函数，方便main.py调用。

这将会是25H1的大更新！
* 24H4更新完成了，而25H1预计要到2025年暑假发布！

接下来的重写分板块分文件，不会一起更新，而是每个文件各自分阶段更新。
为了轻松些，接下来发布一些情节和预设游戏之类。
另外，到时候要麻烦逆天的成员写一些pygame交互组件和IDU插件，引入较为新型的pygame-ce2.5+技术，使用python3.13 （懒加载以外部分、成就、进度之类可能使用多线程。）
以及一些相关的mask和sprite之类的高级应用。谢谢观看。

* 目前有一些画功或者编写音乐经验的，内部有executer和朱洺扬，但是一个没电脑一个没空，或许要和玻糖联动（？

附：预计需要的pygame控件：
类似于tk的Label Entry Text Button List，需要滚动条和容纳窗口(Page，类似于tk.Frame)

以及，后期是打算设计一些黑科技的（雾），比如窗口内的人平滑地走到窗口外，不过这样的话或许只能兼容windows系统。
the end.''')