from time import sleep as s
p = print
p("\033[1;34;47;7m@宇宙工作室 全员    宇宙工作室全员一览表")
s(1)
p('''
\033[32m室长 小轩
副室长 胡锦辉
经理 小茗 黄浩朗
副经理 許卓楠 曹羽翀
外交部部长 李官阳
队长 杨一诺 李胜豪
副队长 李欣凌 张嘉毅
助攻委员[我推荐的我们班同学] 李俊鑫（老李子、李C） 张余辰（张D）
管理员 小轩
社交 小轩 胡锦辉 黄浩朗 李俊鑫

\033[0msc\033[43m领导前锋---------------------------------主（小轩）-------副（曹羽翀）
小轩 曹羽翀 許卓楠 徐周韬 王梓瑶

\033[0mpython\033[41m领导前锋----------------------------------------主（小轩）-------副（胡锦辉）
python 小轩 杨一诺 李俊鑫 张余辰 曹羽翀 李官阳 李欣凌 李胜豪
pygame 小轩 胡锦辉 黄浩朗 何若琳 李胜豪
py_turtle 小轩 曹羽翀 胡锦辉 张嘉毅 李胜豪
py_web_spider 小轩 胡锦辉 黄浩朗
py掌机 唐博虎
专业程序[类似于os之类] 小轩  梁子程

\033[0mc++\033[44m领导前锋--------------------------主（小茗）-------副（胡锦辉）
小茗 曹羽翀 胡锦辉

\033[0mhtml\033[45m领导前锋-------------------------主（小轩）-------副（胡锦辉）
小轩 胡锦辉

\033[46m源码破译
妥海阳 小茗 小轩

“氵”作搞笑“砖”家
高原

最最普通的成员
何秋勇 李哲宸
\033[0m''')