print('''我也没顾上家长的叱责，自己的宝贵时间，一天总是6-8小时在肝作品
然而就是有喷子
我告诉你们，请不要用语言和作品来喷击别人
首先，我对自己改革

1.放弃所有云作品，再也不在C站做有关云的应用，没了应用，所有的云都是躯壳
2.尽量停更水作，你们很难看到我日更和高产了，或许一月一更
3.对于任何喷而并非良性建议的话，我一律不理会，删评，因为没空理
4.所有作品及资源版权所有，不得以任何方式借用、抄袭、改编。不会关闭源码区，但是可能会封装成exe
5.同样尽量不使用别人的方法
6.尽量不更新爬虫作品

逆天的改革
1.加强与火焰的友好关系（刘炳毅现不属于火焰）
2.除吴宇航、胡锦辉、何嘉晨、袁梓轩以外，不用云
3.减少跟cookie有关的作品，减少api类作品
4.不允许任何人使用任何形式攻击、诽谤、侮辱等手段攻击逆天团队，违反则适当反击
5.不允许任何cpp支持者看不起python支持者，反之亦然
6.见作品[逆天团队7周年庆]，其中外交部成员必须维护逆天的尊严

很多话想了一夜，我也不想说了
谢谢各位一直以来对逆天团队和我的支持
不过这些条例，必须明确了！
感谢配合！
（yzy的潜水是所有人最终的最好结果，yzy是正确的）
2022/8/28[逆天1改]''')