print('''
我目前的回复，写在下面的[评论之引]中。
我评论被举报多了，就被限制了3天，见素材区。
唉 现在评论机制那么差的吗。真好，一个优秀的评论被举报就随意下架（是谁干的还是自动判断）
good，你真的太good了

从现在开始，我将处于潜水状态，尽量少评论，但作品不停止。
没有学而思，同样可以在以下网站和我交流：
[B 站] https://space.bilibili.com/418073971
[洛谷] https://www.luogu.com.cn/user/714541

我喜欢这种状态。老同志可能明白。你们以前在C站过过2018-2020/6的日子吗
这段日子，是没有评论的。只能通过作品对话。现在又来了，就当回到2019，我最爱的python伊甸园时光

现在我进入了一个逻辑怪圈：
1.随便发评论
2.被举报
3.多次举报限制评论，暂停处理举报
4.限制解除，继续处理举报，回到第1或2步
出不去的怪圈！

没逝，评论算什么呢
现在正式公布一些措施
1.不要朝我在c站发评论，除了逆天成员和我的支持者，否则就当没看见。
2.撤销关于所有“封面之父”的舆论。这个不太恰当。忘记这个称呼。提到关于我和封面时，只要提到我是第一个做封面模板的学员就行，以后出现我不接受。
3.称呼我只能用“小轩”、“逆天团长”之类，其他头衔拒不接受。
4.不要管凌锋，对于他对我的讽刺，不会郑重反击。
5.作品不每次发布在C站，发布仅仅为一个象征性的意思。
6.对所有想举报的，只举报其中的十分之一。
7.点赞收藏关注都不再感兴趣。只希望看我作品。
8.INS社区发布时希望广大人员参与。
9.如想帮我解围(目前不用，只限制3天)，可以建议反馈，暂时缓解等。但是也不长远。
10.想一下有没有可能突破这种困局的api

以后肯定还会有问题 那就用作品交流
感谢大家对我的支持。

[新] 3D logo终端打印
\033[1;40;32m
1D:
----INS----

2D:
————— +   + +————
  |   |\  | |
  |   | \ | +———+
  |   |  \|     |
————— +   + ————+

3D:
  ___     __________     __________    
 |\  \   |\   ____  \   |\   ______\      
 \ \  \  \ \  \   \  \  \ \  \_______     
  \ \  \  \ \  \   \  \  \ \_______  \    
   \ \  \  \ \  \   \  \  \_______\033[4m|\033[0m\033[1;40;32m\  \   
    \ \  \  \ \  \   \  \     ______\  \  
     \ \__\  \ \__\   \__\   |\_________\ 
      \|__|   \|__|   |__|   \|_________| 
\033[0m

如果你觉得这个作品幼稚就对了

[评论之引]

{回复吴宇航作品https://code.xueersi.com/home/project/detail?lang=code&pid=24873230&version=offline&form=python&langType=python:
发现早期人类征服学而思云的作品
https://code.xueersi.com/space/1702220?to=collection
就你一个作品还存在}

{回复何嘉晨:我这里还能抓包，有空抓了发出来}

{回复我的支持者:我没事，平淡}

{回复我的反对者:我没事，不用谢}

{回复胡锦辉:我没事，想聊以后在B站说吧}

{回复大家:我很快继续INS社区的进程，早日摆脱学而思}

{回复吴宇航:ij的if语句太难写了，我到时候再发}

{回复袁梓轩:杀伤力和你账号被盗的杀伤力有共鸣}

{回复逆天成员:某副室长即将升到室长职位}

{回复袁梓轩:杀伤力和你账号被盗的杀伤力有共鸣}

{袁梓轩:在吗？为什么说主页100天更新一次？
    我的回复:在的，我没听说、、、
}

{蔡宇翔:为什么我学而思的编译器变成了这样 小轩救我
    我的回复:这是暗色风格，可能你下载了什么插件，比如xesext
}

{何嘉晨:我估计被永久封了现在还不行
    我的回复:我被学而思封了，到时候我来抓包
}

【本来此处还有话，但是社管给我来了信】
【日常】致全体唯C的一封简书2023Part-1
0，首先，感谢能看到这段文字的你，证明你还和C站在一起
1，过去一年多的时间里，我确实很忙，但我一直都在
2，未来一年，我还是会很忙
3，但下面几个月，针对以下两类行为的处理会更加严厉
3-1，不文明用语（不要辱骂他人）
3-2，不适宜未成年人言语行为（一些词汇，还不适合你们这个年纪来用。但等长大之后，就没关系了）
4，想必有一部分朋友已经领到了3天的体验卡。我可能有误判，赶紧申诉下，今晚10点前的，我都会一一处理；
5，作为C站的超管，我是权限进行封号操作的，但并不常用
5-1，部分小朋友为了博得更多的关注，谎称自己被我严惩封号，还用上P图甚至剪辑视频的高招来展示所谓的证据
5-2，这种心理我我懂，我也是从你们那个年龄长大的，必定人最关注的是自己被关注
5-3，其实这种造假的行为，在我看来，着实很可爱。无妨，可继续
6，另外C站是不鼓励大家追星的，后面可能会其他方式来体现这个事情
7，AI审核在准确度方面的效果不尽人意，对于举报的处理，我也没能及时判反馈。这些是我做的不到位的地方，但我确实太忙了，只能一点点尝试优化。希望有一天C站可以回到2020年的样子
8，想必有些朋友会认为，我对一些问题避而不谈。嗯，确实过去一年C站的问题很多，我真正处理得过来的很少。后面我会一点点和大家说说我的想法
9，最后，再次感谢能看到这段文字的你。可能是老朋友，可能是新朋友，但我由衷的希望
9-1，你们能在C站「发现自己，找到伙伴」，无论这个过程是喜怒还是哀乐
9-2，当我发出今年的第二封简书时，希望你还能看到
祝朋友们新春快乐~ 
秃头

\033[1;3;4;40;32m谢谢你，秃头。\033[0m
上面还有内容''')