print('''亲爱的朋友们，我的第三次大退站即将开始，这段时间将会很少上社区，用电脑
俗称：大停(dī)更(gǔ)/doge
封面只因太旧而停止(暗藏)，编程会减少一些
原因为现在的个签“亲爱的卷狗们，让我也要开始学习了。编程放慢吧，封面停用了。”
鉴于我几年的资深摆烂水平，小学一直年级名列前茅，现在初一人数多了几倍，很难hold住，在班里也只能50人里面前五了，年级上30个班甩到一百多名，太垃圾
我近期需要把学习力度从5%调到20%左右，这需要巨大的毅力和时间/doge
总之是从无视学习到轻视学习了。卷！卷！卷！
希望大家继续多多关注，不过最近作品可能会越来越少了（最近月考有个英语还可以，英语老师说初一考的高一的难度，86.5/100分

逆天qq群 652920883 这个编程/科学素养/理论知识/学习/剪辑等技术高或者与逆天成员/合作都可以加入
小轩C站  https://code.xueersi.com/space/12907647?to=homepages
小轩洛谷 https://www.luogu.com.cn/user/714541
逆天洛谷 https://www.luogu.com.cn/team/46415
方圆洛谷(室长吴宇航) https://www.luogu.com.cn/team/47647
Mac洛谷(室长胡锦辉) https://www.luogu.com.cn/team/39857
小轩B站  https://space.bilibili.com/418073971?spm_id_from=333.1007.0.0

蓄力ing...
要去学后面的东西了

\t完毕
油饼！
INS逆天小轩
2023/5/19.
(可以看改编。大多来不及说了，有问题问吧)''')