print('''初三中考，我们初二放三天半。别问为什么，问就是端午节没放，调休了。
前几周事情比较多，亲戚请吃饭也很多，b站也刷得多。这几天有空，我看几眼C站。
IDU计划不断取得进展。
黄羿杰的3D技术已经有mc的基本样子了，还制作了一个2D屏幕
我和实变函数的作品（IDU2D dev0.4-0.10）是我和实变函数一起制作的。我们之前加了qq互相讨论过思路。可能里面两个人的代码风格会比较杂乱。整体思路还是清晰的。
另外特别鸣谢林林的共同作战，也希望THW（The Hidden World）越做越好。感谢林岩对IDU沙盒的支持。
特别鸣谢吴宇航一直提供帮助支持和讨论，以及提出一些有创意的想法。感谢我班上同学对我沙盒的鼓励。
（对了，我没下过steam，那玩意能写python游戏吗，还是可以直接打包成exe）
最后，祝我和大家期末考试顺利，也祝中高考的朋友们能金榜题名。

IDU部分
材质包和人物整个都是我亲自绘制的，感觉画得一般别介意。点开改编素材即可查看。
稍微写点情节，在代码16行开始。''')

'''
[作者1.png]
作者: 欢迎来到IDU(Inverse-Sky-Team DreamSky Universe)，逆天团队联梦宇宙。我是作者。
      这是一款沙盒游戏……吗？或许算是，你可以把这个世界当成宇宙。
      它和现实世界有所不同。你玩玩就知道了。
      看到那个红色的矩形了吗？那就是你。什么，你说你为什么长这样？
      当然有特殊意义！这叫简约版！
[作者6.png]
作者: 说实话，是我懒得画（
[作者4.png]
作者: 那我们话不多说，切入正题！这个世界是由各种方块组成的。
      玩过《我的世界》吗？这个游戏的玩法和它非常类似，它是由python编写的。
      方块大小为50px*50px，我们规定1m=100px，所以一个方块是半米。
      所以你的大小是0.4m*1.2m，矮矮的也很可爱呢！（我自己好像一样矮来着，当然现实中我绝不矮（
      这个世界有各种种类的方块、生物、工具、物品，地形多彩，区块有各自的特色，等你来玩。
      这里还有成就系统哦。我会经常伴随着你，在必要时我会出现。
      哦，对了，为了增加游戏挑战性，我创造了一堆敌对生物，不要怪我（
      不过有个家伙，见到千万不要理他。我之前不小心把他培养坏了，我的追踪系统一直找不到他。
      他有很多本领，他依仗着这些本领到处屠杀和破坏，给游戏整除bug，所以你理他远点。
      他的样子是一个圆角正方形，中间有个大大的问号，有时候也会以其他形式出现。他还有许多小兵。
      对了，游戏可以存档，但是那家伙可能会破坏存档。还有，他名如其人，叫“问号方”。
      最后，上下左右/wsad移动。q扔出物品，e打开背包和合成，c打开命令工具。左上角有你个人属性面板。
      剩下还有很多话要说，不过我想不到什么多说的了，到时候遇到问题再说吧。再见！
(玩家开始游戏)
(玩家挖到钻石矿)
[作者1.png]
作者: 好久不见！你似乎已经挖到钻石矿了！
      你的装备即将产生质的飞跃。这之后我可以给你介绍更多的内容了。
      有了钻石等工具，你可以制造出传送门，去到一些神秘的地方。
      哦，对了，我要给你解锁一个新的区块。那里有我的一个朋友，他是一个商人。
      他自称“胡雪岩”，拥有一个商店，可以交易物品。另外，你还会在那里发现许多新事物。
      对了，不要对胡雪岩搞恶作剧。我的朋友大多是由性情的，你惹怒了他，我也不好办。
      他如果把你当成敌人——你知道的，他有很多装备，你是打不过他的。
      哦，再提醒一句，如果遇到问号方，不要理他，别被他的不良言论洗脑。
      最后，走到这个世界的边缘，可以到达相邻的对应的区块。OK，我先走了，再见！
玩家: 等等，请留步。
      你能送我点物资吗，谢谢了。
作者: 当然可以，我给你几个惊喜小礼物，你可以看看。拜拜！
(玩家接收礼物，然后煅烧钻石，然后到新的区块和制造传送门)
......
'''