print('\033[1;31m退站警告2次。')
print('''
\033[1;32m本次退站警告对于小轩在C站的日常的改动：
1.每天上线时间恢复一段（好消息）
2.退站改为半退，再改为小退（好消息）
3.有些好作品可能能发一些了
即将出小轩有史以来最大作品《小A机器人》了！！！
目前内测此作的人有：
# 1.胡锦辉
# 2.李俊鑫
# 3.徐一茗
# 4.张颢译
# 5.吴宇航
# 6.暂无名额|【疯狂暗示评论区的支持我的人】
# 7.暂无名额|【疯狂暗示评论区的支持我的人】
# 8.暂无名额|【疯狂暗示评论区的支持我的人】
（好消息）
4.小轩退站之歌现在公开地播报

退站之歌~
随机抽取您的一个作品发此评论。（这是之前说的）
您是第*个知道我要半退站的人。（不读取那个浏览量了，嫌烦还举报）
这条消息不会发给很多人。（现在已经广播了）
我将于秋天结束后学完python L6。
从那时候我的C站生涯告一段落。

不要告诉别人（现在公开了） 小轩 日期 谨上（也懒得读取现在时间）

私发给下面的人了（前两位发的时候还没成形，仅仅是告诉）
（并不代表未收到的人就不是我好朋友，是因为我忙不过来，所以只能随机抽取发）
# 1李俊鑫 2021/7/23
# 2胡锦辉         |
# 3孟轩           |
# 4王玎珰         |
# 5黄浩朗         |
# 6徐一茗         |
# 7李欣凌         |
# 8王捷           |
# 9惜暮   2021/7/23
# 10吴翰琦 2021/8/4
# 11黄乐言        |
# 12陈禹安        |
# 13曹羽翀        |
# 14胡家瑞        |
# 15杨一诺 2021/8/4
# 16刘粤辰2021/8/10

\033[1;33m目前活跃程度：69~78%
可以从个签看到

\033[1;34m活跃程度对照表(四舍五入)------------------------
100%         |每天15小时及以上在线
99.5~99.9%   |每天12小时~15小时在线
99~99.4%     |每天10小时~12小时在线
98~98.9%     |每天7小时~9小时在线
97~97.9%     |每天5小时~7小时在线
95~96.9%     |每天3.5小时~5小时在线
92~94.9%     |每天2.5小时~3.5小时在线
90~91.9%     |每天2小时~2.5小时在线
85~89%       |每天100m~2小时在线
80~84%       |每天80m~100m在线
75~79%       |每天60m~80m在线
70~74%       |每天40m~60m在线
65~69%       |每天30m~40m在线
60~64%       |每天上线<30m
50~69%       |每2天~5天上线一次
40~49%       |每6天~2周上线一次
30~39%       |每2周~1个月上线一次（30%退站）
20~29%       |每1个月~2个月上线一次（半退站V1）
10~19%       |每2个月~半年上线一次（半退站V2）
5~9%         |每半年~9个月上线一次（半退站V3）
3~4%         |每半年~一年上线一次（80%退站）
1~2%         |每9个月~一年上线一次（85%退站）
0.5~0.9%     |每年上线一次（91%退站）
0.1~0.4%     |每2年上线一次（基本退站）
0.01~0.09%   |每>2年上线一次（大程度退站）
0%           |永远不再上线（完全绝对 退.）

\033[38;2;255;181;140m下一版：退站之前
上面还有内容，鼠标滚轮滑上去试试
每……个……人……都……有……自……己……的……落……日……
每……个……人……都……有……自……己……的……落……日……
每……个……人……都……有……自……己……的……落……日……
【疯狂暗示】
''')