from time import sleep
print('4.23开编')
sleep(1)
def c():
    print('\033[2J\033[100A\033[3J\033[100A')
def ps(text,time=0.5,cl=False):
    print(text)
    sleep(time)
    if cl == True:
        c()
ps("4",0.1,True)
ps("4.",0.1,True)
ps("4.2",0.1,True)
ps("4.23",0.1,True)
ps("4.23 ",0.1,True)
ps("4.23 世",0.1,True)
ps("4.23 世界",0.1,True)
ps("4.23 世界 ",0.1,True)
ps("4.23 世界 #",0.1,True)
ps("4.23 世界 #读",0.1,True)
ps("4.23 世界 #读书",0.1,True)
ps("4.23 世界 #读书日",0.1,True)
ps("4.23 世界 #读书日#",0.1,True)
ps("4.23 世界 #读书日# ",0.1,True)
ps("4.23 世界 #读书日# 2",0.1,True)
ps("4.23 世界 #读书日# 20",0.1,True)
ps("4.23 世界 #读书日# 202",0.1,True)
ps("4.23 世界 #读书日# 2021",0.1,True)
ps("4.23 世界 #读书日# 2021 ",0.1,True)
ps("4.23 世界 #读书日# 2021 用",0.1,True)
ps("4.23 世界 #读书日# 2021 用P",0.1,True)
ps("4.23 世界 #读书日# 2021 用Py",0.1,True)
ps("4.23 世界 #读书日# 2021 用Pyt",0.1,True)
ps("4.23 世界 #读书日# 2021 用Pyth",0.1,True)
ps("4.23 世界 #读书日# 2021 用Pytho",0.1,True)
ps("4.23 世界 #读书日# 2021 用Python",0.1,True)
ps("4.23 世界 #读书日# 2021 用Python讲",0.1,True)
ps("4.23 世界 #读书日# 2021 用Python讲述",0.1,True)
ps("4.23 世界 #读书日# 2021 用Python讲述「",0.1,True)
ps("4.23 世界 #读书日# 2021 用Python讲述「我",0.1,True)
ps("4.23 世界 #读书日# 2021 用Python讲述「我」",0.1,True)
ps("4.23 世界 #读书日# 2021 用Python讲述「我」与",0.1,True)
ps("4.23 世界 #读书日# 2021 用Python讲述「我」与「",0.1,True)
ps("4.23 世界 #读书日# 2021 用Python讲述「我」与「书",0.1,True)
ps("4.23 世界 #读书日# 2021 用Python讲述「我」与「书」",0.1,True)
ps("4.23 世界 #读书日# 2021 用Python讲述「我」与「书」的",0.1,True)
ps("4.23 世界 #读书日# 2021 用Python讲述「我」与「书」的故",0.1,True)
ps("4.23 世界 #读书日# 2021 用Python讲述「我」与「书」的故事",0.1,True)
ps("4.23 世界 #读书日# 2021 用Python讲述「我」与「书」的故事~",1,True)
ps("4.23 世界  读书日# 2021 用Pyth  讲述「我」与「书  的故事~",0.1,True)
ps(" 4.23 世界  读书日# 2021 用 yth  讲述「我」与「书  的  事~",0.1,True)
ps("  4.23 世    读书日  2021    yth  讲述「我」与「书  的  事~",0.1,True)
ps("   4. 3 世    读书日  2021    y h  讲述「  」与「书      事~",0.1,True)
ps("    4  3       读书日  2021    y    讲述    」  「书      事 ",0.1,True)
ps("     4          读  日  2021    y    讲述          书         ",0.1,True)
ps("    4              日  2021                       书         ",0.1,True)
ps("   4                  20 1                       书         ",0.1,True)
ps("  4                     1                                  ",0.1,True)
ps(" 4                                                        ",0.1,True)
ps("  4",0.1,True)
ps("   4",0.1,True)
ps("    4",0.1,True)
ps("     4",0.1,True)
ps("      4",0.1,True)
ps("      4.",0.1,True)
ps("      4.2",0.1,True)
ps("      4.23",0.1,True)
ps("读    4.23",0.1,True)
ps("读书  4.23",0.1,True)
ps("  书日4.23",0.1,True)
ps("    日4.23",0.1,True)
ps("      4.23",0.1,True)
ps("故      23",0.1,True)
ps("故事     3",0.1,True)
ps("故事即    ",0.1,True)
ps("故事即将  ",0.1,True)
ps("故事即将开始",0.1,True)
ps("  事即将开始",0.1,True)
ps("故  即将开始",0.1,True)
ps("故事  将开始",0.1,True)
ps("故事即  开始",0.1,True)
ps("故事即将  始",0.1,True)
ps("故事即将开  ",0.1,True)
ps("故 事 即 将 开 始",0.1,True)
ps("",1,True)
ps("我小时候妈妈给我订了绘本，读故事，我被吸引，然后。。。氵爆了",0.5)
input('''
就怪了。。。
我渐渐爱上了阅读（一本10页的那种），小班以后就自己看了
我看到的书越来越多，学到的知识也越来越多，最后。。。氵爆了

第1页
（回车继续）
''')
c()
input('''
就怪了,才不水呢。。。
我渐渐喜欢阅读（一本30页的那种），中班以后就自己看了
我看到的书越来越多，学到的知识也越来越多，最后。。。hiahia
我到这里已经认识了3500字左右
我想：作家能写书，为啥我就不能？？？
于是，我写了一篇氵作文！
几十字吧

第2页
（回车继续）
''')
c()
input('''
“我今天出去玩，去超市玩，超时很好玩啊很好玩，真呀真好玩
有吃的，有玩的，还有喝的，啥都有。（现在增加：没有人民币）
我很快回家，看书，看电视，然后玩玩具
我高兴地写了这本书，然后继续玩
吃晚饭了，饭很香，还是奶奶烧饭
哇！(╯▽╰ )好香~~！（现在添加图片、颜文字）
然后，然后就还有啥呢？
想起来了，然后我丢（看看我的错别字，去）刷牙洗脸
睡觉吧，睡着了，新的一天开始了”

以上原文改版

“我今天出去玩，去chao shi玩，chao shi很好玩a hen好玩，zhen呀zhen好玩
有吃的，有玩的，还有he的，sha dou有
我hen kuai回家，kan书，kan电shi，然后玩玩ju
我gao兴地写了这本书，然后ji xu玩
吃wan饭了，饭很xiang，还是奶奶shao饭
哇！好香！
然后，然后jiu还有sha呢？
相起来了，然后我丢shua牙xi lian
shui叫吧，shui着了，xin的一无开始子”

第3页
（回车继续）
''')
c()
input('''
大班我已经认识了4200个字左右，还会写300个字左右
我当时不会再写错别字了，认识完几千字才开始预习拼音
我能看报纸，也能看100~150页的文字书
我超爱看书结果抱了一大沓书带到家里
这一阶段我的阅读直线上升
最后，我还发现了一本叫"跟着小猫学编程"的书
编程？我记得以前中班时看过一个动画片，里面说编程就能写代码，向黑客一样nb!!!
一翻开，莫有代码，只有模块。。。
从此，我就开始了编程之旅。。。
“scratch 1.0 2.0 3.0”

第4页
（回车继续）
''')
c()
input('''
一年级我已经认识了6500个字左右，还会写1500个字左右
我能看200~300页的文字书
我开始接触考卷、作业、学习和课程
  咳  咳  
 a
   666 
    gogogo
     gogogo
    额……
二年级我已经认识了7000个字左右，还会写3000个字左右
我能看300~350页的文字书，还发现了漫画
我开始接触字典
我发现我超爱科学
数理化的理科类知识
而且很快又喜欢上了宇宙
后来还喜欢文言文和作文
作文开始变好了！

第5页
（回车继续）
''')
c()
input('''
三年级我已经认识了8000个字左右，还会写6500个字左右
我能看380页及以下页数的文字书
我开始接触更多的练习
我觉得sc没意思
结果发现了学而思，开始学python L1
(当时，只有敏学班，只有L1(基础),L2(升级),L3(大数据),L4(人工智能))
认识了编程社区！！！
我超爱科学，专门钻研宇宙、相对论、大爆炸、星体等深度理论
文学方面开始出现真正的习作，我最多能写350字（标准80字）
下班学期学而思的py就更新了L5,L6
(还是只有敏学班（我一直在敏学），有L1(基础),L2(升级),L3(游戏),L4(处理数据、爬虫),L5(网页),L6(人工智能))
当前进度L2
英语就是3年级起步

第6页
（回车继续）
''')
c()
input('''
4年级我已经认识了10000个字左右，还会写9500个字左右，文字大约就在这儿徘徊了。。。
I can read任何页数的文字book
我开始接触任何练习
(有敏学班，有L0~6，勤思班，有L0~4)
当前进度L3~L4
game、big data
English学得很好（这里开始出现some English words），三门学科平均一般97及以上
Chinese isn\'t allowed to get full marks, even if it is perfect, you should deliberately deduct reading or writing
上面的allowed，deliberately deduct是靠翻译的
暑假7月创立宇宙工作室，编程社区大更新

第7页
（回车继续）
''')

c()
input('''
5年级
read《三体》科幻小说，解开Space深度秘密
蓝桥杯一等奖
当前进度L5下
html
读书呢，永无止境了……

第8页
（回车继续）
''')

c()
ps("希",0.1,True)
ps("希望",0.1,True)
ps("希望大",0.1,True)
ps("希望大家",0.1,True)
ps("希望大家爱",0.1,True)
ps("希望大家爱上",0.1,True)
ps("希望大家爱上阅",0.1,True)
ps("希望大家爱上阅读",0.1,True)
ps("希望大家爱上阅读！",0.1,True)
ps("希望大家爱上阅读！！！",0.1,True)
ps("希望大家爱上阅读！！！",0.1)
ps("希望大家爱上阅读！！！",0.1)
ps("希望大家爱上阅读！！！",0.1)
ps("希望大家爱上阅读！！！",0.1)
ps("希望大家爱上阅读！！！",0.1)
ps("希望大家爱上阅读！！！",0.1)
ps("by 小轩",1)
c()
ps("b",0.1)
ps("by",0.1)
ps("by ",0.1)
ps("by 小",0.1)
ps("by 小轩",0.1)
ps("by 小轩 6",0.1)
ps("by 小轩 66",0.1)
ps("by 小轩 666",0.1)
ps(" y 小轩 666",0.1)
ps("   小轩 666",0.1)
ps("     轩 666",0.1)
ps("        666",0.1)
ps("         66",0.1)
ps("          6",0.1)
c()
ps("b",0.1,True)
ps("by",0.1,True)
ps("by ",0.1,True)
ps("by 小",0.1,True)
ps("by 小轩",0.1,True)
ps("by 小轩 6",0.1,True)
ps("by 小轩 66",0.1,True)
ps("by 小轩 666",0.1,True)
ps(" y 小轩 666",0.1,True)
ps("   小轩 666",0.1,True)
ps("     轩 666",0.1,True)
ps("        666",0.1,True)
ps("         66",0.1,True)
ps("          6",0.1,True)
ps("",0.05)
ps(".",0.1)
ps("",0.05)
ps(".",0.1)
ps("",0.05)
ps(".",0.1)
c()
ps("",0.05,True)
ps(".",0.1,True)
ps("",0.05,True)
ps(".",0.1,True)
ps("",0.05,True)
ps(".",0.1,True)
print('宇宙工作室-小轩')