from poemslib import *
#1、修改程序循环次数，让程序出10道题目
#2、补充代码，完成输入内容和正确答案不相等的情况
# 请你修改程序循环次数，让程序出10道题目吧~
a = 0
for i in range(1):
    print(question())
    my = input("请输入答案：")
    ans = answer()
    if my == ans:
        print("恭喜你，答对了！")
    #=====================================================    
    # 请你在第18行补充输入内容和正确答案不相等的情况：
    # 请注意缩进格式哦~
    if my != ans:
        a = a + 1
        print("很抱歉，答错了！正确答案是",ans)
        print("完整诗词为：")
        print(poem())
    #====================================================
    print("---------------------")
print("你错了",a,"题")
#https://code.xueersi.com/space/13159581 老师看一下呗！！！！