print('''对于最近几个cpp能手，我实在忍不住要发这个作品
你们编写的东西：
1.《逆天团队及Scratch云变量的漏洞》：https://code.xueersi.com/home/project/detail?lang=code&pid=36761391&version=cpp&form=cpp&langType=cpp
2.《关于被逆天科技侮辱“不会网络编程”的反击》：https://code.xueersi.com/home/project/detail?lang=code&pid=36761996&version=cpp&form=cpp&langType=cpp
3.《关于小轩，四会和逆天，星迹》：https://code.xueersi.com/home/project/detail?lang=code&pid=36761391&version=cpp&form=cpp&langType=cpp
我不明白，你们为什么要刻意来诬陷我和我的团队。

首先，关于作品1：
“经过对cloudlibrary的研究，我们发现scratch云变量操作及文件上传都是不鉴权的。
这意味着，你的数据可能被cloudlibrary覆盖写入，或者直接删除。
Scratch云变量同上。
出于安全考虑，我们建议您停用此类功能，以防数据被他人篡改。”

我们来分析：
1.经过对cloudlibrary的研究。首先，他是写cpp的，所以对于python不熟，如果当做看伪代码，暂且原谅
2.scratch云变量操作及文件上传都是不鉴权的，这一点，是学而思的情况，如果你要做到一些事，必须自己开服务器，代码也麻烦。一旦我开了源码，我就只能接受这件事实，任何人都是，而我一般不会闭源
3.cloudlibrary覆盖写入，或者直接删除。这一点，对于我做过的所有云产品，如遇破坏，我都能立刻恢复。恢复的代码因隐私不能告诉大家，所以这一点不能怀疑，你们也见到，被破坏的我都修复了
4.出于安全考虑，我们建议您停用此类功能，以防数据被他人篡改。这句话我特别不认同：由于那个时候一直有人被盗号，你发布这句话会让很多人忧虑，并影响逆天的一些事情，我知道，你只想说是云变量被篡改，很多人会理解成个人学而思账户会被篡改。同时数据篡改不会有事。首先，正式的含隐私作品我会闭源封装成exe的形式发布，并且防止反编译，这样没人能知道是那个sc存储了这玩意儿；数据也能修复，上面也说明了。

对于我着急的心理，我表示郑重地道歉。不过你们也有用词不当的，并且大部分都说错了，所以，你们也要为诬陷我的措辞负责任。以及很多对我的脏话，都要负责任，我自己一句脏话也没有，骂人是不带脏字的，可以去看看原作


其次，关于作品2：
1.那些作品对我来说不值钱，也没有多少人用，我觉得真的比较烂。做的再好，没有人用，那你还做什么？？？那些复杂的用途都用不到
2.cloudlib小小短短精简代码不是屎山，精简有用，可读性强，类似伪代码，共同写的人也不多，代码中没有bug
3.关于云的创造，跟你们的cpp没有任何关系，全部去问何嘉晨，他才是首个学而思py-sc云开发者
4.0-1%的构思作品也好意思拿出来
5.作品介绍 现在是谁菜呢？ 我不觉得我很菜
6.严子昱 所以是底层技术人员和实现的互殴？其实你也错了，为什么大佬开发的都是和我们一样“拉”的作品？其实别装逼了，我们都一样
7.steven 小轩只不过是笑话罢了 作者我支持你。告诉你，刘炳毅，python中级组初赛二等奖省赛没名字的垃圾玩意儿，cpp电子学会六级的超级大佬，你就评论python/cpp，玩去吧！！！hhh xswl
8.“你们的都是底层，没有我们软件等的开发人员你的开发都白搭了。”我认为：几百个star？都是你做的吗？别人都用吗？

对于我的激烈言论，我当然再次道歉，不过你们继续得为这个作品的诽谤负责任

还有作品3：
1.我不明白，把我和四会星迹放在一起是什么意思
2.你去管政治发道理就够了，关我啥事
3.无缘无故，“关于小轩的逆天发言和双标行为，望周知，这里不再多说。”
4.如果你是指之前两个作品，那么我也说了，所以你也错了，不要引战。你也有很多不会的，至少你不会我写的那些python中作、大作

对于所有人，我就这么说：
python人员以后不准看不起cpp的编程编写速度慢，代码多，散装
cpp人员以后不准看不起python的执行慢，看不懂，多个库胶水起来
python的应用是长处
cpp的执行效率是长处
刑，那我既然道歉和说明了，你们是不是接下来要为自己的行为买单了呢？''')