print('''24H4 差不多好了，还差一些材质更新就能发正式版（24H4 总β10）了，这里先发一个β9，也差不多了。
IDU_24H4.py是主程序。打开改编看素材！学而思环境不能运行，这个要python3.10+，推荐vscode + python3.12.5 + pygame-ce 2.5.1！普通pygame将会因FRect被屏蔽运行。
总代码数：1930 lines 更新于 10/4
github发布版本为β7

这次加入了很多东西，牛，羊，投掷物品，疾跑，下蹲，对话框等等一系列新功能。
欢迎尝鲜游玩。（牛羊卡墙是因为懒得写正确生成位置，现在主要是测试生物运动功能。）

然而。25H1版本的更新非常繁多、困难：
音乐美术两大现实难题
怪物流体两大技术难题
剧情进度两大情节难题
详见update.py！

对了，我还弄了一个参考视频，放在xes cdn，打开链接即可：
https://livefile.xesimg.com/programme/python_assets/10b22b24c7a11f68201e735f8069643a.mp4
没环境的可以粘贴链接看看！''')