print('''目前参与IDU项目的人员
设计
小轩 吴宇航

剧本制作
小轩

创意制作
小轩

人物/物品の设定
小轩

2D 世界引擎(地形生成+世界参数+玩家操作+各种类): 小轩
   指令集: 小轩
   文本输入框插件: 黄羿杰
   文件操作管理: 小轩
   web引擎: 小轩
   区块传输: 小轩
   算法: 小轩
   语言: 小轩
   语言顾问: 付开霁 吴宇航
   总顾问: 吴宇航
   云技术: 吴宇航 何嘉晨 小轩
   云技术顾问: 吴宇航 何嘉晨 冀厚锦
   pygame小插件: 小轩 胡锦辉 黄羿杰
   沙盒顾问: 林林 浅梦 吴宇航 李梦唐
   scratch: 李梦唐
   其他互通世界(列举一部分: Undertale,AlanBecker,PvZ,Bilibili,Luogu,Xes,Unity,ccw,insjhx,INSIDE,inssys,inscommunity): 小轩
   特别: 由于本体是沙盒所以暂不考虑联通mc，后期版本会有联网

3D 世界引擎: 吴宇航 黄羿杰 林林 小轩 何嘉晨
   插件预备: 小轩 黄羿杰 林林 吴宇航 付开霁
   物理引擎: 吴宇航 林林 黄羿杰 小轩
   区块处理: 小轩 吴宇航
   文件管理: 小轩
   云技术: 吴宇航 何嘉晨 小轩
   云技术顾问: 吴宇航 何嘉晨 冀厚锦
   其他: 吴宇航 小轩 林林 黄羿杰 胡锦辉 何嘉晨 付开霁 浅梦

Game OS: 小轩

主要开发团队:
逆天团队-INS 小轩
方圆工作室 吴宇航
Mac工作室 胡锦辉
MA工作室 李梦唐

主要建议团队:
|竹| 袁梓轩
CZ 蔡宇翔
星迹(?) 浅梦

建议者计划(提建议成员):
1级建议者(排名不分前后)
小轩 吴宇航 何嘉晨 林林 胡锦辉
李梦唐 浅梦 付开霁 黄羿杰 袁梓轩
2级建议者(排名不分前后)
蔡宇翔 冀厚锦 李官阳 李俊鑫 张余辰
郭燕铭 王翰德 宋佳豪 曹羽翀 黄浩朗
尹鹏皓
其他建议者(怀旧，应该是不会来了，致敬旧社区)
严子昱 林圣杰 王玎珰
欢迎广大群众提出建议

鸣谢(排名不分前后):
林林 浅梦 鱼翔浅底
张功喆 周绪航 何嘉晨
胡锦辉 李梦唐

技术支持(实际开发团队):INS逆天团队-逆天工作室核心部
欢迎大家踊跃参与


\033[1;36m代码运行结束(逆天团队提供技术支持)
\033[6A\033[8m\033[?25l''')