print('\033[1;31m退站警告1次。')
print('''
\033[1;32m本次退站警告对于小轩在C站的日常的改动：
1.每天上线时间缩到90min以内，45min时休息10min
2.将于生日（11/1）左右退站
3.有些好作品可能来不及发了，都是因为喷我的喷子
包括《宇宙战舰大战(现约1.5k行代码)》等32款游戏，py+sc
和《超能计算器》11个实用作品
以及1部小说《梦幻游戏》
4.小轩退站之歌将会公开地播报

\033[1;36m退站原因：
C站太差 小白太多 喷子太多 L6快结束了 快六年级了 等

\033[1;33m目前活跃程度：73~83%
可以从个签看到

\033[1;34m活跃程度对照表(四舍五入)------------------------
100%         |每天15小时及以上在线
99.5~99.9%   |每天12小时~15小时在线
99~99.4%     |每天10小时~12小时在线
98~98.9%     |每天7小时~9小时在线
97~97.9%     |每天5小时~7小时在线
95~96.9%     |每天3.5小时~5小时在线
92~94.9%     |每天2.5小时~3.5小时在线
90~91.9%     |每天2小时~2.5小时在线
85~89%       |每天100m~2小时在线
80~84%       |每天80m~100m在线
75~79%       |每天60m~80m在线
70~74%       |每天40m~60m在线
65~69%       |每天30m~40m在线
60~64%       |每天上线<30m
50~69%       |每2天~5天上线一次
40~49%       |每6天~2周上线一次
30~39%       |每2周~1个月上线一次（30%退站）
20~29%       |每1个月~2个月上线一次（半退站V1）
10~19%       |每2个月~半年上线一次（半退站V2）
5~9%         |每半年~9个月上线一次（半退站V3）
3~4%         |每半年~一年上线一次（80%退站）
1~2%         |每9个月~一年上线一次（85%退站）
0.5~0.9%     |每年上线一次（91%退站）
0.1~0.4%     |每2年上线一次（基本退站）
0.01~0.09%   |每>2年上线一次（大程度退站）
0%           |永远不再上线（完全绝对 退.）

\033[38;2;255;181;140m下一版：退站警告1次
\033[0m上面还有内容，鼠标滚轮滑上去试试
每 个 人 都 有 自 己 的 落 日
''')