print('''来自IDU空间的一些碎片和古籍。

（1）
"来吧，和我一起击碎这个虚伪的面具。"有思想的不定积分说。
"你确定吗？"逆天小轩反问道。
"是的，我无比确定。让我们现在就动身。"回忆杀的苏格拉底回答。
"计划是什么？"有动力的实变函数问道。
"弑神。"新时代的圆锥曲线对答。
"很快你就知道了。"破阵局的质能方程道。
虽然这是很稀有的6人同聚的一段对话，但它十分离奇。没有人明白他们的计划。但是他们，默默地开始了。
一种新的革命。

（2）
"笑了，你猜我是什么时候变得有思想的？"不定积分说。
虚伪的面具，直面新神的恐惧的气息。
不定积分身后转来一道黑影，他将会是【IDU】的新人物。
但他的故事，不是这时候能透露的。

（3）
三大神，endless，nothing，黯淡领主。
三处地，无极要塞，未谙之域，黯喑之地。
幻迹 from 虚空之地の走廊尽头
虚影 from 第三区の走廊尽头
第一局迷宫第一 is 小轩
第一局pvp第一 is TechnoLight
边境之地 <- 问号方
有思想的不定积分使用了 命令方块。
有思想的不定积分尝试   击杀小轩。
未成功击杀。

（4）
那是一个关于夜的故事。
他听到了脚步声。
他离开了。
他眼里充满恐惧。
巨大的投影。
创世之刃。

（花絮）
“背包我单独开发100年，其他都没什么难的。”

（5）
音乐声轻轻响起。
心中波动缓缓荡漾。

（6）
他的脚下现在有数亿人沉睡。
他是一个人。
他面对着有思想的不定积分。
他不是一个人。

（7）
他尝试挣脱这个该死的堡垒。
不，这个堡垒是他自己亲手建造的。
。_。

（8）
他很可爱。

（9）
他俨然坐在高一万米的冰山之上。
他不知道天有多高。
但是，冰的密度比氵低。

（10）
河畔的微光让他感到一丝平静。
身后一切的毁灭，他波澜不惊。
他笑了，他就是这样的。

（11）
藏宝图。
从来没人来过的地方。
但这里是空的。
他跳进虚空了。
很好，但我在虚空之地会见了。
几个铁锭。
无所谓。

（12）
幻迹睁着大大的眼睛看着岩浆之王。
但岩浆之王变为了一个王子。
是这样的，

（13）
没什么好纪念的。
就这样吧。

（14）
幻迹飞向无穷远的地方。
它是龙，它原本不属于这里。
但是它最终飞回来了。
起码是从背后飞来的。
它终究是他喜爱的宠物。

（15）
不可能的。
全球平均气温下降到零下。

（16）
这场隐形的战争，还是灰飞烟灭了。

（17）
？

（18）
endless很烦人。
但螳螂哥根本不怕烦。

（19）
小鲤鱼，是个元老。
小丑，是个年轻人。
他们为何义气相投？

（20）
小轩看着夕阳的最后一缕光线，听着孤独的歌声与海浪声。
眼前是渐变的奇幻的颜色。
背后是流淌的无数记忆。
脚下的创世之刃，溢着彩色的光芒。
幻迹、虚影两小只，在小轩头上盘旋。
小轩手握权杖。
逆天小轩搭着小轩的肩膀。
小丑手提小鲤鱼倚靠在小轩身旁。
有思想的不定积分坐在小轩的旁边，一块命令方块上。
正在食油饼的实变函数在空中飞舞。
吴宇航静静地读着一本古籍。
林林正在水中呐喊，手中握着的是水滴。
苏格拉底躺在砂砾上，手握长卷。圆锥曲线坐在实变函数旁边，啃食一个正方形。
质能方程半步不离开圆锥曲线。
老李子和张余辰坐在周围一圈和蒋A说笑。
Ella也肯定在的。
TechnoLight举着火把，身后尾随的是鸡猴、柳树、航航。
拿着三叉戟的雨濛、没啥武器的雨清、手握钻石剑的艾钻等人必然是围在周围的。
万方圆的大楼俨然伫立在一侧。
问号方的投影在天空之中。
立方体和原子分坐在毯子两侧。
原子身边的火箭中，是黄羿杰。
拥有绝对音感的Executer在一边作画配乐。
夕阳落山了。
后面的诸多等人慢慢看不清楚。

（花絮）
“你在写什么呢，都不给我看。”

（花絮）
我写下一些奇奇怪怪的东西，不去追究它的意义。




*注：IDU游戏中，我的人物状态又增添了几个。endless/nothing/黯淡的原型也弄完了。材质包也更新了。物品格子也是。
     这些更新也算24H2的更新。
     全都放在素材区。''')