print('''
C站，全站人民，开会啦！
此会议支持宣传并且在评论区发出举手及对话。
@宇宙工作室。

许多天前，小轩发现社管不在了，猫博士等号自行停作，秃头离奇失踪，未找到一点线索。

小轩：真的，我最近发现秃头不在了
张余辰：我怎么没感觉呢？
李俊鑫：我有种不想的预感。
小轩：我也有
Sans：要不要发作品宣传？
张余辰：我看算了，再观察观察。
李俊鑫：建议反馈
infinity QL：我举报过一个作品一个月了还没回复
小轩：我支持张余辰。
李俊鑫：emmm...

“我决定观察观察”回车回复。
''')
input()
print('''
我：我决定观察观察
小轩：好的，收到。
李俊鑫：首页的作品一直堆积在那里被人看，我们的作品还怎么上去！！！
小轩：就是。

“好像看你的小A机器人”回车回复。
''')
input()
print('''
我：好像看你的小A机器人
infinity QL：你打错子了
李俊鑫：你也打错了。
小轩：谢谢，还有就是首页的幻灯片也不换，社管不出现，什
么也不更新，编程大作战的排位赛也没有。
张余辰：你打字累不累？
小轩：要不要提醒秃头？
张余辰：嗯。
小轩：算了，发个作品提醒大家。

但没人做。

“您是室长啊，请求你做”回车回复。
''')
input()
print('''
我：您是室长啊，请求你做
Sans：额
Ella：小轩你的数学题快给我看
小轩：我发了，大家看完这个作品在留言区表示你的看法。还有数学题我给你。


请在留言区发言。
''')