print('''逆天团队全部成员列表

逆天团队(INS)(同级不区分排名)
团长: 小轩
| 核心(逆天工作室)
| 
| 室长: 小轩
| 副室长: 吴宇航 胡锦辉 何嘉晨
|
| 经理: 黄羿杰 袁梓轩 林林 李梦唐 Mozart 王翰德 鱼翔浅底
| 副经理: 张余辰 徐一茗 黄浩朗 冀厚锦
| 高管: 可乐 浅梦 李弈霖(小宝) 蔡宇翔 王玎珰 张振宇 陈致
| 线下主管: 小轩 张余辰 李俊鑫 Ella 刘硕 朱洺扬 曹曦文
| 
| 寄术员(综合评分,和活跃度等也有关,同级不区分排名):
|  1级技术员:
|  小轩 吴宇航 何嘉晨 黄羿杰 袁梓轩 林林 Mozart
|  可乐 胡锦辉 冀厚锦 李梦唐 鱼翔浅底
|  
|  2级技术员:
|  李弈霖 浅梦 黄浩朗 蔡宇翔 王翰德 邹启航 张颢译 杨鲲霖 尹鹏皓
|  李子园 刘元序 陈子衿 周绪航 王祎嘉 网校学员(uid=44673885)
|  程煜轩(b站游戏玩家鸡翅) 林将军 落月花林 sssvip(洛谷)
|  JC_Lee(洛谷) 薛亦涵(孙亦承) Gracezhuzhu(洛谷) 刘牛牛
|  李博闻 樊伊航 王麒凯 徐天宇 张振宇 邓子阳 梁纳源 季煜杰
|  刘子宁 刘宇杰 赵乐 王瀚哲 彭逸航 倪梓航
|  
|  3级技术员:
|  傅宇桐 刘粤辰 冯俊曦 高熙程 初与久歌(某人开了小号?) 王捷
|  丁康骏 沪思乐阿拉(b站) 西西 王彬如 秋秋 贺宏毅 欧文杰 杨浩轩
|  克隆人(胡锦辉小号) 锦辉论科技(胡锦辉小号) 彭新峰 李梓涵
|  刘维开 朱梓萱 刘某杰(刘宇杰小号) 吴漾 囡汐菲菲 梁乐天 张恺宁
| 
| 美工: 程煜轩 朱洺扬
| 搬运工: 苏永昌
| 史官: 朱昊涵(c站历史) 刘硕(世界历史)
| 
| 部长/副部长(不区分排序):
|  Scratch: 李梦唐 / 无需
|  Python: 小轩 吴宇航 / 黄羿杰 胡锦辉 袁梓轩 林林
|  C++: 可乐 Mozart / 袁梓轩 小轩
|  通信: 何嘉晨 吴宇航 / 冀厚锦 小轩
|  js: 林林 / 李梦唐
|  html+css: 林林 吴宇航 / 小轩 胡锦辉
|  后端: 小轩 林林 / 李梦唐 尹鹏皓
|  外交: 吴宇航 / 小轩 林林
|  人事+内政: 小轩 / 吴宇航 胡锦辉
|  学术: 小轩 王翰德 Mozart / 胡锦辉 Ella
| 
| 顾问(不区分排序):
|  应用编程顾问: 小轩 吴宇航 袁梓轩 胡锦辉 林林
|  算法顾问: Mozart 可乐
|  学习顾问: 小轩 王翰德 落月花林 Mozart Ella
|  游戏顾问: 吴宇航 李俊鑫 陈加禾 刘硕 浅梦
|  沙盒顾问/非成员沙盒顾问: 林林 浅梦 吴宇航 / zxr
|  编程语言顾问: 付开霁 吴宇航 鱼翔浅底
|  pygame顾问: 小轩 黄羿杰 胡锦辉 吴宇航 何嘉晨 林林
|  scratch顾问: 李梦唐
| 
| 开团功臣: 张余辰 杨一诺 胡锦辉 吴宇航
| 纪念退站成员: 曹羽翀 胡家瑞 李官阳 孔维禹 王毓轩 陈禹安
---------------
| 外层(宇宙工作室)
| 室长: 小轩
| 副室: 吴宇航 胡锦辉
| 经理: 张余辰 李俊鑫 李官阳 徐一茗 黄浩朗
| 主任: 曹羽翀 彭逸航 李欣凌
| 成员: 王瀚哲 李梓涵 梁乐天 冯俊曦
---------------
| 外层(联梦工作室)
| 室长: 小轩 吴宇航
| 副室长: 胡锦辉 李弈霖
| 成员: 王翰德 王瀚哲
| 顾问: 付开霁 Mozart 宋佳豪 王玎珰 张振宇 林林
|       李梦唐 彭禹嘉 符汉衡 郭燕铭 等
---------------
| 分工作室放入[友军及友好人员,工作室,室长]一栏

鸣谢老师(不区分排序):
王敏(原python主讲) 原乔(原python助教)
胜男(原python助教) 小饼干丶
kkksc03(洛谷站长) 阮行止(洛谷老师)
Maxmilite(洛谷老师) 小粉兔(洛谷老师)
disangan233(洛谷老师) chen_zhe(洛谷老师)
一扶苏一(洛谷老师) LeavingZ(洛谷老师)
览遍千秋(洛谷老师) 子衿君(洛谷老师)

友军及友好人员,工作室,室长(不区分排序):
方圆工作室(吴宇航)
mac工作室(胡锦辉)
MA工作室(李梦唐)
wood工作室(张颢译)
五凌(广山凌联)
五联(朱昊涵)
星迹(浅梦)
小王工作室(王翰德)
CZ工作室(陈致,官网https://czoffice.top/)
特种兵(蔡宇翔)
砂糖工作室(季煜杰)
疾烽工作室(张振宇)
Windows滑稽病毒工作室(王张弛)
|竹|工作室(袁梓轩)
若宇工作室(王若宇)
ppy工作室(王祎嘉)
Python工作室(邓子阳)
北极星集团(刘牛牛)
三侠集团(焦旸惠)
黄昏工作室(杨鲲霖)
瑜瑾工作室(郑钰涵)
东方红工作室(刘宇杰)
阿豆工作室(阿豆编程社区https://code.adouwork.com/)
社区公会
十字骨
轩弥
赵乐
周周
宋佳豪
郭燕铭
谢法然
汤浩辰
李健睿
奥利给
温岚之
刘元序
刘汉元
小饼干丶
郭铸锋
倪亦柯
富兰克林
灵笼INCARATION
原火焰工作室(刘炳毅,王玎珰,符汉衡)
原社区星光工作室(严子昱)
原Keps工作室(胡家瑞)
原麻烦的工作室(赵喆)

\033[1;34m由于人数及合作过多，更多正在统计中...
如需查看全部，请向上查阅或者查看源码(推荐)
如有误增、误删、漏写等情况，请向作者核实，如通过即修改。
本作品作为逆天数据库标准，由于作者被限流，希望大家不要多多点赞，要多多收藏和转发关注
另:逆天团队2周年快乐+逆天小轩团队历史原逆天团队™(c)Copyright.(2015-2023)版权所有侵权必究8周年快乐!!!''')