print('逆天工作室正式成立了!\n')

print('现 逆天少年团（逆天团队）：')
print('2021/9逆天少年')
print('2021/11逆天少年队（2人）')
print('2021/11逆天少年队（3人）')
print('2021/12逆天少年营（4人）')
print('2022/1/1逆天少年团（5人）')
print('2022/1/8逆天少年团巩固，正式成立')

print('''
逆天少年团（逆天团队）：

主部-线下（同级别不区分排名顺序）
团长|小  轩| 3级
团员|张余辰| 2级
    |李俊鑫| 2级
    | Ella | 2级
    |      |
    |      |
    |      |

逆天工作室-线上C站
室长|小  轩| 8级
副室|胡锦辉| 7级
室员|张余辰| 4级
    |李俊鑫| 2级
    |      |
    |      |
    |      |
    |      |
    |      |

小部-线上微信（同级别不区分排名顺序）
人员|张余辰| 1级
    |李俊鑫| 1级
    | Ella | 1级
    |      |
    |      |
''')