from time import *
input('前方高能——亲切的计算机……非工作人员请立刻撤离，这里是核试验室，闲人免进，确定没有别人时按下回车开始')
t = 11
n = 1
while t >= 0:
    print('\033[2J\033[100A\033[3J\033[100A')
    print('时间',t)
    print('数字',n)
    sleep(t)
    n += 1
    if t >= 6.1:
        t -= 5
    if t >= 1.1:
        t -= 1
    elif t >= 0.11:
        print('\033[1;36m')
        t = round(t-0.1,2)
    elif t >= 0.011:
        print('\033[1;35m')
        t = round(t-0.001,4)
    elif t >= 0.00011:
        print('\033[1;34m')
        t = round(t-0.0001,5)
    elif t >= 0.000011:
        print('\033[1;33m')
        t = round(t-0.00001,6)
    elif t >= 0.0000011:
        print('\033[1;32m')
        t = round(t-0.000001,7)
    elif t >= 0.0000000011:
        print('\033[1;31m')
        t = round(t-0.000000001,10)
    elif t >= 0.00000000011:
        print('\033[1;34m')
        t = round(t-0.0000000001,11)
    elif t >= 0.000000000011:
        print('\033[1;36m')
        t = round(t-0.00000000001,12)
    elif t >= 0.0000000000011:
        print('\033[1;35m')
        t = round(t-0.000000000001,13)
    elif t >= 0.00000000000011:
        print('\033[1;32m')
        t = round(t-0.0000000000001,14)
    elif t >= 0.000000000000011:
        print('\033[1;33m')
        t = round(t-0.00000000000001,15)
    elif t >= 0.0000000000000011:
        print('\033[36m')
        t = round(t-0.000000000000001,16)
    if n >= 2001:
        t = -1
    elif n >= 2000:
        print('\033[30m')
        t = 0
    elif n >= 1888:
        print('\033[31m')
        t -= 0.00000000000000001
sleep(1)
print('\033[2J\033[100A\033[3J\033[100A下一个体验：指数级别增长')
x = 1
for i in range(1000):
    print('\033[2J\033[100A\033[3J\033[100A')
    print('2的',i,'次方')
    if i <= 200:
        print('数字',x)
    else:
        print('数字','≈'+str(x)[0]+'×10^'+str(len(str(x))))
    x*=2
    if i <= 20:
        sleep(0.1)
    elif i <= 50:
        sleep(0.05)
    elif i <= 100:
        sleep(0.02)
    elif i <= 200:
        sleep(0.01)
print('\033[2J\033[100A\033[3J\033[100A')
print('\033[32m2的1w次方 2^10000')
sleep(0.5)
print('\033[2J\033[100A\033[3J\033[100A')
print('\033[32m2的5w次方 2^50000')
sleep(0.5)
print('\033[2J\033[100A\033[3J\033[100A')
print('\033[32m2的10w次方 2^10^6')
sleep(0.5)
print('\033[2J\033[100A\033[3J\033[100A')
print('\033[32m10的10w次方 10^10^6')
sleep(0.5)
print('\033[2J\033[100A\033[3J\033[100A')
print('\033[33m10的20w次方 10^(10^6*2)')
sleep(0.5)
print('\033[2J\033[100A\033[3J\033[100A')
print('\033[33m10的50w次方 10^(10^6*5)')
sleep(0.5)
print('\033[2J\033[100A\033[3J\033[100A')
print('\033[33m10的100w次方 10^10^7')
sleep(0.5)
print('\033[2J\033[100A\033[3J\033[100A')
print('\033[34m10的1000w次方 10^10^8')
sleep(0.5)
print('\033[2J\033[100A\033[3J\033[100A')
print('\033[34m10的1b(10亿)次方 10^10^10')
sleep(0.5)
print('\033[2J\033[100A\033[3J\033[100A')
print('\033[34m10的10b(100亿)次方 10^10^11')
sleep(0.5)
print('\033[2J\033[100A\033[3J\033[100A')
print('\033[34m10的10wb次方 10^10^15')
sleep(0.5)
print('\033[2J\033[100A\033[3J\033[100A')
print('\033[36m10的(1mh)1bb次方 10^10^20')
sleep(0.5)
print('\033[2J\033[100A\033[3J\033[100A')
print('\033[36m10^10^10^10')
sleep(0.5)
print('\033[2J\033[100A\033[3J\033[100A')
print('\033[31m电脑炸了')