from time import *
print('''\033[1;31m宇宙工作室的科研部队快来了！激动吗？！
人员：宇宙全体人员\033[0m''')
print('''
科技发展：
\033[1;32m1.作品升级 [完成了,以后继续升级]\033[0m
\033[1;32m2.鲜艳、显眼的标志 [已完成]
\033[1;32m3.黑科技科研病毒库 [完成，以后继续]\033[0m
4.游戏大厅 [准备]
5.超级编程地 [准备]
6.更新聊天区 [准备好了，快开始了]
\033[1;32m7.超级不用赞 [行动了，完成了]\033[0m
\033[1;33m8.jhx方便0元公用库 [正在做]\033[0m
9.pygame大放送 [准备]
10.秃头大催 [准备]
\033[1;32m11.全面发展 [完成了,以后继续升级]\033[0m
\033[1;33m12.满站宇宙 [行动中……]\033[0m
13.知识作品 [准备好了，快开始了]
\033[1;33m14.小轩个性签名跟踪 [好了，未发布，新的就更]\033[0m''')
print('\n以上为宇宙工作室的科技发展趋势')
print('做好超级大更的心理准备！')
print('3')
sleep(1)
print('2')
sleep(1)
print('1')
sleep(1)
print('11/20日更 后天蓝桥')
print('未来已来！')
print('还有，蓝桥杯加油，进省赛，进国赛！')
print('好了，本作品更新到此，886')