"""
I am a module.
People's histroy is in me!
It is funny,is it?
My name...
  game_hdata.py!!!
you're right.This is a python file.
I love Python!
xiaoxuan did

我是一个python库，人类的历史在我这应有尽有！这很有趣是吗？
我的名字是game_hdata.py
你说的对，我是一个python文件。我爱python编程语言！

小轩[智]造
"""

def PythonZen():
    import this

histroy_dict = {
    -230000:['非洲人属开始发展'],
    -190000:['人类在非洲不断活动'],
    -180000:['人类进化'],
    -170000:['智人开始酝酿'],
    -160000:['智人出现'],
    -150000:['人类踏足到欧亚大陆'],
    -140000:['人类返回非洲'],
    -130000:['人类再次来到欧亚'],
    -120000:['人类返回非洲'],
    -110000:['人类大量繁衍'],
    -100000:['人类占领整个非洲','剩余人类重返欧亚'],
    -90000:['人类占领整个非洲','大量人类驻居欧亚'],
    -80000:['人类开始扩散到全世界'],
    -70000:['人类占领欧亚大陆','人类占领美洲','大量生物被猎杀灭绝'],
    -60000:['人类扩散至全地球','占领除两极以外的60%'],
    -50000:['人类扩散至全地球','占领除两极以外的65%'],
    -40000:['人类扩散至全地球','占领除两极以外的70%'],
    -30000:['人类扩散至全地球','占领除两极以外的80%'],
    -20000:['人类扩散至全地球','占领除两极以外的95%'],
    -10000:['新石器时代开始'],
    -5000:['仰韶文化开始','诸文化兴起','西方闪米特人出现'],
    -2070:['夏朝开始','西方小型文化纷争'],
    -1600:['商朝开始'],
    -1046:['周灭商，周朝开始'],
    -770:['春秋时代，东周开始','由于周朝的分封制不稳定','导致国家分裂','各诸侯国叛乱'],
    -700:['毋庸置疑下面的国家有名','晋楚齐燕宋卫鲁邢秦','郑吴越陈蔡蜀巴'],
    -600:['排名','楚晋齐燕郑宋秦卫鲁','邢吴越陈蔡蜀巴'],
    -500:['排名','楚晋齐燕秦郑宋鲁卫','吴越陈蔡蜀巴'],
    -400:['排名','楚齐燕赵魏韩秦宋','郑越蜀巴鲁卫'],
    -300:['排名','楚 田齐 燕秦赵魏','韩宋越鲁卫 中山','西方文化出现孔雀王朝'],
    -250:['排名','秦楚 田齐','燕赵魏韩宋卫'],
    -230:['排名','秦楚','田齐 燕代'],
    -221:['秦朝'],
    -203:['汉朝','西方文化发展ing'],
    -139:['汉朝开辟丝绸之路'],
    -30:['罗马帝国帝制开始'],
    9:['新朝，王莽篡汉'],
    25:['东汉'],
    220:['三国'],
    280:['晋朝开始','一段很长的乱世开始','出了很多英雄'],
    383:['淝水之战'],
    420:['南北朝','宋齐梁陈出现'],
    581:['隋朝','杨坚代周称帝','杨广修长城','建立京杭大运河'],
    618:['唐朝'],
    1120:['宋|西夏|辽|金','各国鼎立'],
    1206:['蒙古国产生'],
    1271:['元朝'],
    1368:['明朝'],
    1453:['拜占庭灭亡','奥斯曼帝国攻陷君士坦丁堡'],
    1776:['美利坚合众国诞生'],
    1800:['1800-1950年','有一段大量发展与战争'],
    1810:['发生拿破仑战争'],
    1949:['中华人民共和国成立'],
    1980:['在这期间中国不断发展'],
    2000:['公元的第二个千年到了','世界稳定了','非洲却还在确定边界中'],
    1980:['在这期间中国不断发展'],
    2019:['发生新冠疫情','中国及时防控','将它扼制在摇篮之中','美国大量疫情爆发','情况极为严重'],
    2020:['人类的科技很不错'],
    2022:['创造星球模拟器alpha版','于2022/1/22发布在','学而思编程社区|C站','https://code.xueersi.com','开发者：小轩','你发现游戏里的你','正在玩这个游戏']
    }