# l可以理解为life/list
# 元古宙
l1 = ['单细胞生物','细菌','多细胞生物','藻类']

# 前寒武纪
l2 = ['细菌','藻类','水母','原虫']

# 寒武纪
l3 = ['三叶虫','鹦鹉螺','细菌','藻类','水母','原虫']

# 奥陶纪
l4 = ['三叶虫','鱼','鹦鹉螺','细菌','珊瑚','藻类','水母']

# 志留纪
l5 = ['笔石','鱼','三叶虫','鹦鹉螺','细菌','珊瑚','藻类','水母','苔藓']

# 泥盆纪
l6 = ['鱼','珊瑚','蕨类植物','裸子植物','苔藓','三叶虫']

# 石炭纪
l7 = ['青蛙','鱼','巨型蜻蜓','巨型蟑螂','巨型蜘蛛','蕨类植物','裸子植物','苔藓']

# 二叠纪
l8 = ['各类爬行动物','青蛙','鱼','昆虫','裸子植物','蕨类植物','苔藓']

# 三叠纪
l9 = ['鱼龙','青蛙','初期恐龙','鱼','裸子植物','昆虫']

# 侏罗纪
l10 = ['恐龙','鱼','裸子植物','昆虫']

# 白垩纪
l11 = ['恐龙','鱼','裸子植物','被子植物','昆虫']

# 古近纪
l12 = ['鸟类','鱼','被子植物','昆虫']

# 新近纪
l13 = ['哺乳动物','鱼类','植物','昆虫']

# 第四纪
l14 = ['人类','其他动物','植物','微生物']