# 更新日志

'''
2022年
1/14#{
along0.1
s.更新此日志
1.制造基本框架
2.方框小窗口
3.一个小按钮“我的行星”
4.控制台及其话语
5.事件监测以及其按钮下一步
6.初步梳理代码
7.定义初始变量
8.定义类
9.定义函数
10.调用一部分，灵活运转程序
11.字体大小及颜色的调整

along0.2
1.代码进一步梳理优化
2.调用全部定义的东西
3.美化窗口布局
4.新增矩形边框
5.函数调整后参数及其值更加活跃，调用能力强

}
1/15#{
along0.3
1.新增星球类
2.调用星球类
3.绘制星球、新增变量
4.随机增加
5.体验感增强
6.巩固代码

along0.4
1.增加情节：水源，控制水源的按键qw
2.行星颜色带来优良体验
}
1/16#{
along0.5
创建按钮类并调用

along0.6
确定水源、行星颜色的事件判断与大系统变量的转换，进入下一步深入操作
}
1/18#{
along0.7
1.确定水源产生的几种后果
2.打开时间大匣

along0.8
1.完成冷却幼儿星球和完成冷却
2.编写情节

along0.9
1.优化代码、梳理代码
2.添加变量及情节，代码进入2h行环节
3.星球颜色变化多端
}
1/19#{
along1.0
1.增加事件
2.增加情节
3.增加按钮
4.增加part变量
5.优化代码、梳理代码
6.增加data生物库
7.增加体验效果
8.增加卫星

along1.1(along正式版)
1.增加事件
2.增加情节
3.搜索资料、载入
4.添加数据
}
1/20#{
along1.2(along修复版1.0)
修复6个bug(其中最大的为显示不了下一个纪元)

along1.3(along增强版)
显示生物，更新生物副页

along1.4(along重置版,修复版2.0)
1.解决字体重叠
2.字体更加有颜色感，更显眼
3.解决垃圾星球培养生物成功的bug
4.调整写错的注释
5.调整星球时间流速，以免太快太慢

along1.5(along更新版)
1.整体完全完善
2.梳理代码
3.增加图片素材并调用
}
1/21#{
along1.6(along可视化-高可读性版)
1.整体优化
2.添加注释
3.收拾更新日志

along1.6(along图片版)
1.添加图片
2.添加视频

along1.7(along简洁美观版，修复版3.0)
1.添加变量及情节
2.增加事件
3.整体优化
4.修复1个bug
5.增加按钮
6.添加效果，剪辑视频嵌入
7.3D一点了
8.正式开通数据库
9.整体全部开通、调用、应用，准备发布

α正式版(along1.8,along图标版,总“架构版”)
1.设置窗口图标
2.视频先后的代码、流程通畅直观
}
1/22#{
1.1 Edition(along1.9,2.0,alpha精致版)
1.调整星球时间流速
2.增加按钮
3.增加情节
4.添加历史资料及其页面

1.6 Edition
1.大系统变量有所更新
2.图片、视频更加精美
3.添加变量及情节
4.增加按钮
5.增加体验效果
6.增加histroy历史库
7.谱写历史，增加新页面
8.增加事件
9.控制台全面更新
10.游戏方向大反转，目标锁定
11.编辑至未来准备

1.8 Edition(NE版,new file with planet edition)
相逼以前全新的体验
刷新所有模块，修改所有bug，全新设置体验，增加、添加一些东西
优化代码、梳理代码逻辑、可视化、简单化、可读性更高
代码空行明显分辨

夜班：突然肝(赶)作品
1.9 Edition(NSE版,NE|SECOND Edition)
1.刷新图标，改掉分辨率，更加有趣
2.改掉【错别字】（本作者也笑死/doge）
3.改掉大量问题
4.一部分无趣内容变得活跃一点了
5.删掉bug
6.替换更好的逻辑方法、更好的图形界面
}
1/24#{
1.9 Edition X(NTE版,NE|THIRD Edition)
1.打出注释：游戏制造人和建议者
2.听取胡锦辉的建议，把[X]的功能改为关闭窗口
3.修复2个bug
4.修改一些文本内容
5.更改进化此更新日志
6.将历史库的无用数据删除，新增有用数据
7.修改历史库一处语病

1.9 Edition 2X(NFE版,NE|FOURTH Edition)
图片被自由截图，抠图，更加精美
}
1/27#{
1.9 Edition 3X(NLE版,NE|LAST Edition)
1.修改bug，字体重叠
2.修改气态行星，有三分之一的概率成功稳定
3.[智]造成就：富得流油
4.大陆图片位置更加精准
5.达到未来的2023年
}
'''