print('''欢迎来到讨论版。这里是实变函数的频道。
预先叠个buff：讨论版作品内容仅为个人意见，与现实不一定相关，不代表客观内容。
              我支持中国特色社会主义。本作品保证安全。
              我认为秃头管理员的工作十分有利于社区。
              C站是一个拥有良好环境的社区。
              我认为学而思的产品非常有效，十分适合儿童进行学习。
              拥有一些特殊疾病人群阅读过程中有异常请立即退出。
              本作品不包含任何危险因素、政治因素，坚决不违反社区公约V1.2
              本作品不包含任何极端主义，无任何不良引导，抵制任何负能量。
好的，让我们直接开始！


讨论1：评论区限制、学习机限制。
评论区这一点显而易见，经常会不明不白地被删除一些评论，有时候提示违禁词，但是看来看去都看不出说了什么不正常的话。
尤其是有的两个词语合起来也会误解，比如AB/CD，被识别成A/BC/D，这就非常不好。而且用户连什么不能发都不知道。
再说学习机限制，这一点显而易见了，操作键盘也不方便，没有编程助手很难观看python作品，而很多学员都是使用学习机的。
这一点对稍微年轻一点的朋友们呢是友好的，他们大多看看scratch就可以，更多的是鬼畜。但是也有很多人渴望技术，这样就不太好。，
学习机功能或许很强，但是它……真的拦截了我们的热度啊。
另外学习机用户帮我测试一下，看看我这次python低阶你们能不能运行起来。

解决办法：
评论的话可以找一些聊天工具。（对了，为什么连qq都成违禁词了）
学而思编程不是聊天工具，这我很明白，但是也不至于和qq形成敌竞争关系啊awa
像洛谷、b站、github那样处理其实都挺好的，用不着什么违禁词，违禁信息自然有人举报。
这样交流会更自由一点，只有开放，才能促进社区交流，吸引新学员啊……
违禁词反而会导致大家往那几个其他少儿编程网站跑的……你说是不是？当然我不提名了啊。
另外大家能不能帮忙在评论区发一下自己是几年级，谢谢，我就可以了解人群趋势了。

学习机就没办法了，或许能装系统破解（？（这个不推荐啊，千万别真去弄，应该是不行的）
多看看教程，使用学习机专门网站，应该是可以玩一些作品的。
学习机咱们就专搞学习啊，你要来编程的话还是得用电脑。编程助手肯定不能缺。


讨论2：关于鬼畜
关于鬼畜这类作品，我认为质量稍微比之前高一点。（比如《童话镇》。）
我首先肯定它们给大家的快乐，所以我支持。
不过呢，我需要调研一下大家的年级，就是为了了解大众的理解能力。
因为我奇怪啊，为什么林林和小轩的《病》这种神作一点都不火呢？还被限流了。
小轩那个作品完全就是慷慨激昂的创作啊？还是因为有关他的都得限流，如果是这样的话，我也没办法。为什么非要给他限流呢？
《童话镇》，我认为一般到五六年级就能完全看懂了，所以是非常易于理解的。
《病》的话我觉得八九年级理解起来也不困难啊，是我高估人群的理解力了吗？我记得社区在五年级以上的人群还是很多的。还没全退站呢。
小小吐槽一下，能站在巅峰的配乐动画，只有2019年的《奥利给之歌》（现在正版原创已经没了）、2024年的两部《病》吧。
无论从动画时长、震撼程度、共鸣感、制作时间、动画质量、存在意义上，都是能碾压的吧。
这才叫真鬼畜。（以上有一些主观因素）
当然啊，刘元序，谢法然那些大佬我也是很欣赏的。他们属于不同的风格。
《童话镇》已经很震撼了，但是视觉效果主要还只有一个角色移动。
建议大家提高一下鉴赏能力。在b站，鬼畜有两种，一种是【赤石】，一种是【经典】
他们的区别是显而易见的，前者是纯粹搞笑搞事，后者是升华和意义所在。
好的，大众可能认为某些【赤石】的作品更好一些。这我也就没办法了。真正的作品火不起来，火起来了也没有用，只能自娱自乐。
鬼畜区的不说，技术区的，根本抬不起头。
首页的作品，和社区存在的大作比起来，就是原子的量级和大象的量级一样。
这些大象其实也不少，找找都是有的。
那么有一些宇宙量级的作品，我怎么说呢？
PLPG：你好。
Lightpad：你好。
IDU：你好。
有人说【社区已死】，但是这个社区提供了完整的python环境，所以我认为【社区已死】是错误的。
我更喜欢和那些同辈们攀谈。
不过没关系，我只希望更有人观看、评论、理解我的作品就好了。
我会尝试培养新手和留住他们交流。
而鬼畜，有它自己的家。
当然啊，我认为你们喜欢什么，让它作为社区的主导来推动进步也是不错的。

散会。欢迎讨论。''')