# 请你自己创建地图的二维列表，并选择难度吧~
#作答区域有2处哦~（左侧素材区有游戏秘籍~）
from  snake import *
#作答区域（1），补充10-11行的列表，让你的地图更大吧！
map = [
    [0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,1,1,0,0,1,1,1,0,1,1,1,0],
    [0,0,0,0,0,1,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,1,0,1,1,0,0],
    [0,0,0,1,0,1,0,0,0,0,0,0,1],
    [0,0,0,0,1,0,0,0,0,1,0,0,1]
]

n = input("萌新请输1，大神请输2:")
if n == "1":
   print("欢迎萌新，不用修改地图")
if n == "2":
    print("欢迎大神，提升地图难度")
    map[3][2] = 1 
    map[2][7] = 1 
    #作答区域（2），参照上一行在地图中增加障碍物，至少再改一处
    map[5][3] = 1
    map[3][4] = 1
    
set_map(map)
speed(20)  #设置游戏速度
start(3)   #设置蛇初始长度
end(20)    #设置蛇目标长度
#double()   #双人模式
#ipad_control()  #ipad按键提示
play()