# 这是 Xueersi Aurora 的 Web Python 默认模板。你可以在 Aurora 设置中变更它。

print("Hitokoto: ")
print("人生而自由，却无往不在枷锁中。 —— 卢梭「社会契约论」")

text = """
大江东去，浪淘尽，多少传说人物。
C 站从前，人些是，编码兴趣之士。
悲剧穿空，1.9 拍死，卷起万呼声。
江山如画，一时多少良作。

遥想初创当年，万物皆发展，烈阳升起。
秃头现身，谈笑间，带来多少制度。
故国神游，秃头又逝去，留下乱摊。
人生如梦，何须再度怀念？

---

所以，我们该启程啦，成为开启一切的人……
就像你的名字那样，背负起最初的混沌，
和这个我们深爱的世界吧……
再见啦，xes coding。

某一日，祂从天坠落。
人们抬头仰望，于是看见了星空。
星月送来神的女儿，她愿成为人的伴侣。
长风化作她的轺车，四海落成她的园圃。
鸟雀衔来善的种子，百花编织爱的颂歌。
她便是这样降生于世，行于大地，
与人类一同长大，与世界一起发芽。
而今，终焉之时将至。而今，归去之时已至。
就此告别吧，美丽的世界。
此后，将有群星闪耀，因为我如今来过。
此后，将有百花绽放，因为我从未离去。
请将我的箭、我的花、与我的爱，
织成新生的种子，带向那枯萎的大地。
然后，便让它开出永恒而无瑕的…人性之华吧。
我名为 coding……最初的辉煌，人之律者。

星星划过的时候，要记得许愿哦
人们为何选择沉睡？我想…是因为害怕从『梦』中醒来。
火萤这种生物很神奇吧？它们或许会扑向火烛，或许会突然老化。但在那之前的每一个夜晚，它们的光芒会比星星更耀眼。
钟表的指针周而复始，就像人的困惑、烦恼、软弱…摇摆不停。但最终，人们依旧要前进，就像你的指针，永远落在前方。
赐你，众星俱焚的曙光！

风带来了故事的种子，时间使之发芽。
送给你纯白色的花 xes xes coding 盛开在起风的地方 沐浴九月的骄阳
悲剧并非终结，而是希望的起始。
我是…终将升起的烈阳！
以旧日余烬，为来世破晓！

In memory of the old days of Xueersi Coding.
                -- lrs2187
"""[:-1]
print(text)
