'''
0——打印一个空格长度的黑色背景

1——打印一个空格长度的红色背景

2——打印一个空格长度的绿色背景

3——打印一个空格长度的黄色背景

4——打印一个空格长度的蓝色背景

5——打印一个空格长度的紫红色背景

6——打印一个空格长度的青蓝色背景

7——打印一个空格长度的白色背景

d——将下一个字符染为黑色

r——将下一个字符染为红色

g——将下一个字符染为绿色

y——将下一个字符染为黄色

b——将下一个字符染为蓝色

p——将下一个字符染为紫红色

q——将下一个字符染为青蓝色

w——将下一个字符染为白色
'''
def logo(a):
    for x in range(len(a)):
        if a[x] == "0":
            print("\033[40m ", end="")
        elif a[x] == "1":
            print("\033[41m ", end="")
        elif a[x] == "2":
            print("\033[42m ", end="")
        elif a[x] == "3":
            print("\033[43m ", end="")
        elif a[x] == "4":
            print("\033[44m ", end="")
        elif a[x] == "5":
            print("\033[45m ", end="")
        elif a[x] == "6":
            print("\033[46m ", end="")
        elif a[x] == "7":
            print("\033[47m ", end="")
        elif a[x] == "d":
            print("\033[30m ", end='')
        elif a[x] == "r":
            print("\033[31m ", end="")
        elif a[x] == "g":
            print("\033[32m ", end="")
        elif a[x] == "y":
            print("\033[33m ", end="")
        elif a[x] == "b":
            print("\033[34m ", end="")
        elif a[x] == "p":
            print("\033[35m ", end="")
        elif a[x] == "q":
            print("\033[36m ", end="")
        elif a[x] == "w":
            print("\033[37m ", end="")
        else:
            print(a[x], end="")
    print("\033[0m")
if __name__ == '__main__':
    logo("333333333333333333333333333333333333333333")
    logo("322222222232222222222232222222223222222223")
    logo("433333333343333333333343333333334333333334")
    logo("433333333343333333333343333333334333333334")
    logo("433333333343333333333343333333334333333334")
    logo("322222222232222222222232222222223222222223")
    logo("w4343434343434343434343434343434343434343")
    logo("w4343434343434343434343434343434343434343")
    logo("w4343434343434343434343434343434343434343")
    logo("w4343434343434343434343434343434343434343")
    logo("132132132132132132132132132132132132132132")
    logo("132132132132132132132132132132132132132132")
    logo("132132132132132132132132132132132132132132")
    logo("333333333333333333333333333333333333333333")
    logo("             -r g陈y锦b奕p w-         ")
