print('''鬼畜区是目前主导地位。基于硬件设施的限制，大多人根本看不了py作品，也就看不了这些游戏。
（提一嘴，最近黄羿杰和何嘉晨在搞着python的3d联机fps游戏玩呢，但是缺少人物建模，而且联机云变量没有找到速度高的服务器/doge）
技术区的话，我想说真的没什么人看，做出来的主要还是游戏（
真正的技术区基本上我也看不懂，比如吴宇航的PGPL分析器，GLR语法分析之类

我认为鬼畜区应该和技术区结合起来，而不是两方互相发布无建设性的锐评。
这样可以让限流的或者是不火的技术区火起来，也可以为鬼畜添加一些技术性的生机。
它们结合起来，会是新的篇章。
非常感谢刘元序能和我合作。

我觉得目前的鬼畜区不足以描写C站，应该说是整活区罢（

现在学而思并不会出现最后一道极光。（这句话被发言者禁止随意引用了，这里就不是引用）
我们可以认为，学而思还会发出炽热的持续的亮光。

我们可以看到整活区宣传出来的活力，就是兴盛的依据。
这同样代表技术区也可以通过鬼畜的宣传一同兴旺发达。
这同样代表C站的整个未来仍然有无限可能，说不定能挖出一些新人才。
当然，现在不管是整活还是技术，人手都是不缺的。

如你所见，我是一个乐观主义者。
而大多人还处在【C站已死】的悲观之中。
不，你们要看到年轻人的活力！
*注：这个作品使用py基础模版是为了学习机。
     祝愿学习机用户可以早日同时拥有电脑。
     欢迎来到pygame/tkinter的世界。''')