print('''INS IDE最开始的框架已经做好了。（https://code.xueersi.com/home/project/detail?lang=code&pid=38845088&version=offline&form=python&langType=python）
现在大家可以对它提点建议与发展方向
1.布局
做得可能有点难看。顶部菜单栏，左侧控制栏，中间灰色显示栏，右边上方简介栏，下方编辑区
控制栏控制显示栏显示的东西，如文件结构等。简介栏选择语言，输入标题，更改模式等。编辑区写代码
如果有更好的请画图/建议提出

2.功能
日后的新功能

3.云方案
编辑作品需要保存。其中一些加密和非pyinstaller编译方法需保证。
云技术有了，方式可以说说

4.编程社区的主页以及连接IDE的相关建议

5.个人主页以及登录注册页面等的相关建议

6.管理与维护

7.对IDE多种语言的运行利用什么网站的爬虫及其代码

8.加入社区py语言(dragonfly,insjhx,sail等)

9.定制inscodehelper

10.连接显示百度、C站（既然用了C站服务器就回点利益）、洛谷、B站等

11.其他
谢谢参与！
''')