print('同志们，记得不，2019的时候有人在cpp区发布了学而思网校惊天大秘密')
print('后来我发了学而思网校惊天大秘密（二）、（三）')
print('''今天我们就来讲一讲另一个话题，学而思编程放㵘大秘密
在2019刷赞风波以后，学而思教研组说想了一个办法，能抵制刷赞
没人知道怎么回事，从那以后确实看不到设么刷赞作品了
现在我就要解密手动变量
从那以后，学而思一直瞒着我们，知道有人从api里面发现了手动变量
顾名思义，就是学而思调的变量
用法是，手动变量*原本的热度=真实的热度
学而思可以调控它改变热度
于是，一个热度=10的作品，手动变量=0.5，那热度就=5了
可是我看到，手动变量要么是0，要么是1
这是怎么回事？

知道我退站英勇牺牲，发现手动变量变0了
于是我又发了一个传送门，结果也是0
最后我又发了一个又传送门，结果过了一会我才给自己点赞，结果就是1了
这是怎么回事呢？

经过小轩的研究发现，原来这是一个抵制刷赞的变量，当检测到点赞（收藏）＞浏览，就检测到刷赞，于是手动变量=0
你的热度就没了
那么为什么会认为我们点赞比浏览多呢？
因为很多人一发布就给自己点赞藏（比如我），但是在1分钟内它却识别不到你浏览了
于是浏览=0，点赞=1，收藏=1
那不是憨批了吗
所以，建议大家一分钟以后刷新点赞
the end
''')