#include<iostream>
#include<string>
using namespace std;

void p(string s){
    cout << s << endl;
}
 
int main(){
    p("首先说一下，本标题中凌锋两字是违禁词，所以只能暂且用不可见空格字符隔开，可能出现unicode显示的问题");
    p("还有为什么用c++来输出。TA(简写凌锋，真的不好打)是c++技术比较高，用py输出。那我py技术比较高，那就和他相反");
    p("我本来就喜欢编程，所以才编程，每天编程，有空就编程。我不明白为什么有那么多喷子。做编程锻炼的是脑子，开心的原因是你有荣誉感。难道就能让喷子来骂我们吗？");
    p("每年我都会遇见喷子，但是今年我遇到了TA，虽然不能说TA就是个喷子，但是TA也让我很难受");
    p("TA发过一些针对我的言论、几次发一些攻击我的作品");
    p("我们慢慢来看。");
    p("第一次与TA冲突的原因是在逆天云变量的时候");
    p("可以看到，云变量是何嘉晨亲自一行一行代码写出来的，冀厚锦做修改，这本来就是逆天的荣誉，至少何嘉晨是这么说的。我相信他们，所以才会出现后面的事情。");
    p("TA一天突然说了很多我们做的坏处。说建议把吧，语言又不够诚恳，还说这是他做过的，抄了他的云");
    p("我不明白TA为什么要这样做，或许是他的作品人气不如我们的。以他自己的说法，他没有错，是我的错。可是我想不到有什么错，因为这真的是我们自己做的");
    p("于是我和TA就争论了起来。TA以前也有一些支持者，语言十分恶毒，和我们大型争论了一次。以骂战的收尾结束。");
    p("结束之后，我做出了让步，那一段时间我并没有做云作品。（现在差不多刚刚回复，但是也没有开始用）");
    p("我以为就结束了，可是TA后来一直发作品。还说我垃圾，比如说TA的Lightpad Dev，做的其实很好，因为是C++");
    p("可以看到他下面的评论：请不要相信部分编辑器会超越Lightpad的言论，Lightpad永远是C++区（可以说全社区吗？）最好的编辑器。");
    p("TA其实真的有点...狂妄吧。因为是C++就说自己最好吗？其实你做的是终端输出，和CUI差不多，我做的是GUI，效果当然是我的好");
    p("TA认为python比c++低级很多。可是我认为，c++在本地用direct等git上的外部资源头文件做出GUI和py比，能比过我吗？");
    p("我想浅浅地说一句，TA用python做的话，赶上我就不错了。");
    p("如果学C++的话，建议去考CSP，NOIP。我正在向这条路走。");
    p("TA还有一个典型的M人作品，pid=40251334，自己可以去看看，“小轩是若智儿童”“一眼若智儿童，全家病危通知书！建议多吃六个核桃补补脑子”");
    p("这真的是你该说出来的话吗？讽刺到这种程度已经是M人了！！！这就是你的道德修养。");
    p("这样我也只能写一篇长篇大论了。");
    p("下面的评论还说了一些更加**的东西，不把我当人看了。这就是TA与另一个“C++大佬”小埋对我的基础尊重。");
    p("（*虽然四会平常会的不多，但是还是支持我的，我很感动）");
    p("这样我也只能写一篇长篇大论了。");
    p("TA还说我的程序都被TA做过了。是吗？？？TA还说我有抄袭他的可能");
    p("我走到今天，我还是跟大家说，我的良心在这里，发誓我就没有抄袭过作品。TA说我抄了XesExt");
    p("其实不是的，我的自动三连关闭窗口教程完全是看见了pid=37448156的作品才手动做的！！！TA，信不信由你。");
    p("pid=40251432是TA的另一个恶心作品。你的作品介绍又是什么意思，评论区“不幸地，小轩和他的两亲已经逝世，因此无法与您继续互动，让我们永远地怀念它。真的假的”“真的”这就是侮辱我啊！");
    p("我真的很奇怪！");
    p("“令人作呕”？你才令人作呕。");
    p("js能点赞是很正常的，因为py进阶就是用js过来伪装的！");
    p("TA不断打广告，我也不知道是为什么！TA真的很有技术吗？大家思考一下吧");
    p("请大家相信我。不相信的可以点踩举报。相信的也不一定需要三连。支持我就可以");
    p("我不关闭评论区。我了解，TA和TA党可能会在下面评论+喷。我不会难受。你们在下面继续装，让大家看看你们是什么样的人。");
    p("只写一篇数百字，我的学习、编程、阅读等的时间不多，不会再写一篇。没时间耗在喷上，喷不会回答。大家自己感受。");
    p("希望TA不要再骚扰我，完结。\033[1;32;41m上面还有！滚轮翻上去\033[0m");
    return 0;
}