from xes_flipcard import *
from  random import *

# 定义卡牌
cards = [
    {"图片": "五六七.png", "状态":"反"},
    {"图片": "悟空.png", "状态":"反"},
    {"图片": "小黄鸭.png", "状态":"反"},
    {"图片": "李白.png", "状态":"反"},
    {"图片": "迪迦.png", "状态":"反"},
    {"图片": "柯南.png", "状态":"反"},
    {"图片": "小舞.png", "状态":"反"},
    {"图片": "唐三.png", "状态":"反"},
    {"图片": "五六七.png", "状态":"反"},
    {"图片": "悟空.png", "状态":"反"},
    {"图片": "小黄鸭.png", "状态":"反"},
    {"图片": "李白.png", "状态":"反"},
    {"图片": "迪迦.png", "状态":"反"},
    {"图片": "柯南.png", "状态":"反"},
    {"图片": "小舞.png", "状态":"反"},
    {"图片": "唐三.png", "状态":"反"}
]
# 打乱卡牌顺序
shuffle(cards)

# 设置游戏卡牌
set_cards(cards)

# 循环进行游戏
while True:
    # 翻一张
    a = click()
    #作答区域，补充第一次点击实现翻转的代码
    cards[a]["状态"] = "正"
    show()
    
     # 翻两张
    b = click()
    #作答区域，补充第二次点击实现翻转的代码
    cards[b]["状态"] = "正"
    show()
    
    # 判断卡片是都匹配，直到游戏结束
    match(a,b)