
import time

print('先用c++输出python之禅')
import this
time.sleep(0.5)
print('\n\n然后使用python标准库time库等待了0.5s')
time.sleep(0.5)

print('接下来使用python的for循环语句')
for i in range(23400,23601):
    print(chr(i),end='')

time.sleep(0.6)
print('\n\n现在使用py变量和while循环，还有if，以及输入、变色功能')
a = 1
while a < 10:
    a += 1
    if a > 5: print()
    if a < 7: print('test')
    if a % 2 == 0: print('偶数',a)
    else: print('奇数不输出。')
print('你输入的是:',input('\033[1;33m这是一个输入框，可以输入\033[0m'))
time.sleep(1)

print('\033[100A\033[2J\033[100A\033[3J'*4)
print('现在，你看到了这个有趣的作品。')
print('''\n\n\n
哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈
呵呵呵呵呵呵呵呵呵呵呵呵呵呵呵呵呵呵呵呵呵呵呵呵
这是不是一种很有意义的消遣呢？——小轩
2023/5/6编.
\033[1;31m(*为什么不看看源代码呢？欢迎)''')

import sys
sys.exit()

# a[10][10][10][10][10][10][10][10][10][10][10][10][10][10][10][10][10][10][10][10][10][10][10][10][10]

# 你干嘛

# 这是c++和py的融合，由学而思的linux系统服务器执行。
# 这是解释器，不会报错的哈哈哈哈哈哈（本地肯定是，不过这里只能用py高阶诶）
# 食不食油饼？
# 食不食？
# 食不？
6
666
66666
666666666666666666666666666666666666666666666666666666666666666
'/bush'



'''
还想让我做点什么？我的想象力越来越少了。
大多大作都是咕咕了。
我 不 明 白 人 为 什 么 要 睡 觉
我 不 明 白 人 为 什 么 有 限 制
我 不 明 白 人 为 什 么 会      
大  抵  是  形  式  主  义(删去)
是    需       要 罢。
——后传
(本文使用富兰克林https://code.xueersi.com/ide/code/38831592工具发布api.)
'''

# 时间线已经被改变，无法逆转的行为。
