import time
print("众所周知, 我作为一个理科生啊, 这个语文一向不好, 所以今天就从理科生的角度给大家拜个年(其实是从别的地方偷的)(P.S. 那个管理员记得发布我作品的时候把前面括号里的删掉)")
time.sleep(7)
print("""2023祝各位：
椎骨、胸骨、颅骨、骶骨，骨骨生威；

背肌、胸肌、颈肌、躯干肌，块块有力；

消化、呼吸、循环、泌尿、生殖、运动、神经、内分泌，八大系统团结友爱；

静脉、动脉，六脉调和；

体循环、肺循环、血液循环、体液循环，环环通畅；

右心房、右心室、左心房、左心室，心心向荣；

中枢神经系统、周围神经系统、躯体神经、内脏神经，协调运作、神清气爽。 

祝福从延髓出发，沿着迷走神经穿过颈静脉孔，出颅绕左锁骨下动脉，越主动脉经左肺根，达第六胸椎左前方那个叫心脏的角落汹涌而出：2023快乐！空气分子振动通过鼓膜，顺着听小骨，通过内耳毛细胞点燃蜗螺旋神经节内的双极细胞，沿着蜗神经经蜗神经腹核和背核经蜗神经腹核和背核经斜方体并交叉上行，经下丘，内侧膝状体，经听辐射，通过内囊到达颞叶颞横回，让我们听到了新年的钟声。夜幕中的光线打到视网膜，经视锥细胞和视杆细胞，双极细胞，来到节细胞，通过视神经，交叉，视束，外侧膝状体，视辐射止于距状沟周围皮质，绚丽的焰火展现在我们脑内。距状沟周围皮质的神经元将焰火经角回，wernicke区，弓状束，来到broca区，经中央前回，通过皮质脑干束，经内囊膝部下行至脑干，到达面神经核下部和舌下神经核，控制着舌，大声疾呼：2023，新年快乐！

还没完
""")

time.sleep(4)
print("""新年祝大家：
电势 磁势 引力势 事事得势
重力 弹力 摩擦力 处处给力
匀速 加速 超音速 致富加速
动能 势能 机械能 万事皆能
质心 重心 几何心 天天顺心
强电 弱电 交流电 秒秒来电
重子 轻子 中微子 龙门贵子
虚像 实像 等大像 人人福像
叉积 点积 内外积 财运累积
积分 差分 偏微分 门门满分
动量 冲量 作用量 前途无量
恒星 行星 脉冲星 满天福星
阴极 阳极 南北极 登峰造极
电场 磁场 规范场 宏大气场
有机 无机 永动机 无限商机
自转 公转 螺旋转 行行玩转
平面 曲面 抛物面 有里有面
散度 旋度 自由度 大方有度
牛顿 莱顿 哈密顿 大吃一顿
三维 四维 十一维 精准思维
气流 湍流 交直流 一代风流
直角 锐角 倒三角 全做主角
固态 液态 双稳态 万方仪态
氢气 氦气 电子气 扬眉吐气
固体 气体 半导体 处处得体""")