print('''5年来感谢大家在c站的陪伴。
大家好，我是逆天小轩，很高兴你能看到这个公告。是的，我要暂退。

接下来阐述原因：
1.我暑假啥也没学，天天刷b站写c站，再不写暑假作业我就要成为万家灯火的一员了
2.我洛谷打比赛上了瘾。记住，以后非必要不要碰oi赛这种毒品（我要报考csp-j试试，但是之前洛谷上课都挂机聊天和刷b站玩c站，所以我要重新听一听
3.暑假我到现在还是宅家，甚至没有运动（？
4.很多喷子已经干完了，维护c站也是应该做的。但我真的没有空余时间再搞了
5.秃头竟然看我作品不回我消息，建议反馈也没用
6.秃头给我所有作品限流，最新作品能看，关注能看。但是搜索和最热里面找我作品都没有。问了也没回

暂退之后：
1.作品更新大量减少，缓更
2.评论会选择性回复，大多仍然会回复
3.IDU项目保持正常速度进行
4.在洛谷等活跃
  洛谷逆天团队 https://www.luogu.com.cn/team/46415
  洛谷小轩个人 https://www.luogu.com.cn/user/714541
  bilibili小轩 https://space.bilibili.com/418073971
  code.xes小轩 https://code.xueersi.com/space/12907647
  qq逆天团队群 652920883

其他：
1.对于https://code.xueersi.com/home/project/detail?lang=code&pid=46759964&version=webpy&form=webpy&langType=webpy
  以及https://code.xueersi.com/home/project/detail?lang=code&pid=46851755&version=cpp&form=cpp&langType=cpp
  我很难过，但是是这样的。不要问。
2.我留下的关注列表90%是c站的精英，如果需要观看可以这样。
3.我被限流所以如果想看我作品请直接看我主页。点赞也没有用，不如收藏。

时间到了，我也要走了。IDU项目会默默积蓄。
感谢大家的观看与收藏转发。
我们逆天已经遍及大站，不用担心。
吴宇航、林林、黄羿杰，你们讨论一下用opengl还是继续原路（其实qq真的很方面但是前两人没有
\033[2;30m(___)的c站和秃头！！！\033[0m
最后祝您身体健康，再见。——B站鬼畜葛平(上面隐藏)\033[8m''')