from loadingline import *
loadline = Loadline(30,(0,0.06),'loading text...')
loadline.load()
loadline.text = 'loading power...'
loadline.speed = 0.02
loadline.load()
loadline.text = 'updating logs...'
loadline.speed = 0.007
loadline.load()

print('''今天，逆天团队已经成立7周年了。有人说，逆天不是2021/8诞生的吗
是啊，不过很多人都不知道逆天团队以前有哪些历史，其实逆天团队只是宇宙工作室扩建后的改名
周年庆我基本不发（好像这是第二次），因为忙，现在退站了，退站后到8/23左右会停止作品的发布和评论，所以我现在把这个作品发了
逆天团队本来有个改革，但是我发现我不用发，成员也能好好遵守它，所以我就不继续改了，不发了
至于部的更改，我也在下面会有

\033[1;32m
让我们来好好看看逆天团队的7年吧（准确说是还多2个月，我发周年庆不瞄准时间的）

  \033[1;33m2015/6\033[1;32m 小轩还在上幼儿园中班，搭建了一个线下团队，没有名字，但是玩着玩着就一年过去了
  \033[1;33m2016/6\033[1;32m 小轩还在上大班，但是自学sc，在scratch官网上做了一个作品，“想想队成立”，不知道有没有了现在，如果发布了或许还能在sc官网搜到（不是学而思！）
  \033[1;33m2016/8\033[1;32m 想想队没有人，于是小轩又做了一个新想想队代替原来的，但是看的人比想想队还少
  \033[1;33m2016/9\033[1;32m 小轩上一年级了，在sc发布了一个小猫吃豆子的游戏
  \033[1;33m2017/1\033[1;32m 小轩发布了sc作品：新年好
  \033[1;33m2017/2\033[1;32m 小轩创立了A字团队（顺便在sc上也改了），几个朋友和几个同学加入，同时我开始编书，写梦里A字团队的奇幻故事，但后来被卖废纸了，找不到了
  \033[1;33m2017/5\033[1;32m 小轩家里第一次养了一盆多肉（也是最后一次），非常漂亮，我很喜欢
  \033[1;33m2017/6\033[1;32m 但是被奶奶放在外面，被别人偷走了，我难过极了，直接一气之下发了个sc作品:宝莲灯的故事。因为我叫它宝莲灯。从此再不养植物
  \033[1;33m2017/9\033[1;32m 小轩上两年级，有一次假性近视，举手后回答把÷看成-，被老师批了一顿，被同学嘲笑了一顿，“第一竟然也会错到这种程度”，过了两小时又好了
  \033[1;33m2018/1\033[1;32m 小轩日常不断编书编程，那些是他的爱好
  \033[1;33m2018/10\033[1;32m 小轩三年级，发现python新大陆，把sc扔了，发现学而思
  \033[1;33m2018/12\033[1;32m 找到一个班报名，随便预习写了点代码，但是发布了不知道发布到哪里了
  \033[1;33m2019/1\033[1;32m 上完print输出的课，小轩又去编程社区，结果写代码到一半，点到了左上角的“学而思编程”，那个时候有超链接，把我直接传送到编程社区主页，我从此发现了新大陆，同时成立J·hx公司，后为jhx公司
  \033[1;33m2019/3\033[1;32m 小轩的同桌一直乱打小报告，搞恶作剧，诬陷小轩，拉帮结派，小轩很惨，再聪明也整不过高级官员，于是写作风格少有改编，三观也提前改变，变成了一个班里最成熟的人之一
  \033[1;33m2019/6\033[1;32m 小轩L1下学完发布作品《时光机》，广受称赞
  \033[1;33m2019/7/23\033[1;32m 我近视到看不太清黑板上的小字了，去配了眼镜，还好，左右眼各100多度，原因是我不怎么锻炼，但是整天看书编书编程写作业
  \033[1;33m2019整年\033[1;32m 小轩一直在编程课上是最靓的仔，因为一学就会，喜欢编程，而且课堂巩固次次都创意，有时候我来个可爱就可爱到别人了
  \033[1;33m2020/1\033[1;32m 小轩开始L3的路程，新冠爆发了
  \033[1;33m看到这里，不知道有没有大米（大敏）班的同学，好怀念
  2020/5\033[1;32m 小轩发布了很多pygame，逐渐精通python
  \033[1;33m2020/7\033[1;32m 编程社区更新了
  \033[1;33m2020/8\033[1;32m 更新成C站了
  \033[1;33m2020/9\033[1;32m 但是小轩四年级了，同时jhx公司发展成了宇宙工作室
  \033[1;33m2021/1/23\033[1;32m 小轩L5了，发布了全站最早的html-python作品之一，并且做了第一个封面，于是成为封面之父，同时爬虫发展到了识别点赞
  \033[1;33m2021/2\033[1;32m 更新一系列宇宙科技产品，宇宙工作室达到15人
  \033[1;33m2021/4\033[1;32m 宇宙工作室顶峰
  \033[1;33m2021/5\033[1;32m 小轩做了很多
  \033[1;33m2021/7\033[1;32m 小轩做逆天设想
  \033[1;33m2021/8\033[1;32m 逆天少年(1人)
  \033[1;33m2021/9-10\033[1;32m 小轩6年级，逆天少年营(3人，线下)
  \033[1;33m2021/11\033[1;32m 线上设想，扩展到逆天少年团队(4人，线下)
  \033[1;33m2021/12\033[1;32m 逆天少年团队改逆天团队，线上招募，把宇宙工作室归入旗下
  \033[1;33m2022/1\033[1;32m 逆天团队成立大会
  \033[1;33m2022/3\033[1;32m A字团队归入逆天团队
  \033[1;33m2022/4\033[1;32m 火焰内乱衰败，火焰当时的副室长小轩组织假投票，火焰重新燃起，小轩默默带了几个人退出了，创办联梦工作室
  \033[1;33m2022/5\033[1;32m 小轩各种大作上榜一，但是从不上首页，小轩说过，要靠实力，而不是推荐作品上首页
  \033[1;33m2022/8\033[1;32m 小轩退站，很快就停止发作品

\033[0m相信各位看完，并没有感慨万千(doge
这是简写的历史，我最近的《未来少年（一）》的历史详细多了，第二册则是哲学性思考

接下来，逆天团队全员准备出场
\033[1;36m
逆天团队
 ·团长:小轩
 -逆天工作室
  ·室长:小轩
  ·副室长:胡锦辉,吴宇航
  ·主任:冀厚锦(月光下的魔术师)
  ·经理:徐一茗,黄浩朗,何嘉晨
  ·副主任:李官阳
  ·副经理:袁梓轩,张颢译
  ·部门长:曹羽翀(永久退站)
  
  -部门
   -技术部成员
    ·小轩 python pypy scratch html css javascript c++ c cmd vbs powershell bat notepad
    ·胡锦辉 python pypy html css javascript cmd c++ c
    ·吴宇航 python pypy html css javascript cmd bat c++ c scratch bash powershell selenium vba vbs it regex
    ·冀厚锦 python-webspider
    ·徐一茗 c++ c
    ·黄浩朗 python-pygame
    ·何嘉晨 python-cloud c++ c
    ·李官阳 html css javascript node.js php 等前端语言
    ·袁梓轩 python-pygame pypy html
    ·张颢译 python
    ·曹羽翀 python
    ·王瀚德 python 高等数学 量子力学
    ·张余辰 python
    ·张宋佳 scratch 主课
    ·蔡金成 python scratch
    ·刘粤辰 python
    ·傅宇桐 python 高等数学
    ·陈禹安(退站) python
    ·王瀚哲 漫威理论
    ·邹启航 python-pygame
    ·彭逸航 python
    ·李俊鑫 python scratch cmd
    ·薛亦涵 python html c++ java vbs scratch
   
   -外交部成员
    ·林天辰
    ·小轩
    ·胡锦辉
    ·吴宇航
    ·袁梓轩
    ·李官阳
    ·李俊鑫
   
   -管理部成员
    ·小轩
    ·胡锦辉
    ·吴宇航
    ·张余辰
   
   -创新部成员
    ·小轩
    ·吴宇航
    ·胡锦辉
    ·何嘉晨
    ·袁梓轩
    ·李俊鑫
   
   -事务部
    ·小轩
    ·胡锦辉
    ·吴宇航
   
   -特别行动队
    ·李俊鑫
    ·林天辰
    ·吴宇航
    %保密*位%
    
   -人民的力量是伟大的（人民部/搁置部/新手部成员）
    ·李俊鑫
    ·葛烨琳
    ·杨浩轩
    ·季煜杰
    ·高熙程
    ·小队长西西
    ·杨鲲霖（黄昏）
    ·广润
    ·冯俊曦
    ·王彬如
    ·王一帆
 
 -宇宙工作室原本成员
   室长:
     小  轩
   副室:
     胡锦辉
   经理:
     李官阳
     小  茗
     黄浩朗
     曹羽翀
     杨一诺
   主任:
     彭逸航
     李欣凌
     张余辰
     胡家瑞
   副任:
     李俊鑫
   成员:
     王瀚哲
     冯俊曦
     梁乐天
     李梓涵
     许卓楠
     林承逸
     黄智灏
     何秋勇
     何若琳
     高原
     次元之主唐博虎
     梁子程
     妥海阳
     陈奕鸣
     王梓瑶
     李哲宸
     徐周韬
     李胜豪
 
 -联梦工作室
    室长:小  轩
    副室:胡锦辉
         吴宇航
    成员:李官阳
         袁梓轩
         王瀚德
         王瀚哲
 
 ·线下部（不详写）
 ·A字团队（不详写）


友情联系:
刘炳毅
王玎珰（王征）
严子昱
富兰克林
烟花易冷（林圣杰）
曾
张歆睿
张紫捷
郑钰涵
张振宇
马子锦
吴振发
...

\033[0m
我们做过社区第一个封面
我们做过社区原创最好的封面
我们做过社区原创最好玩的python游戏
我们做过社区第一个python控制sc的云变量
我们做过唯一通过学而思服务器永久维护聊天工具
我们做过支持十几种语言的编辑器
我们做过空行最多的作品
我们做过最意味深长的海龟图画
我们得到过老师的收藏
我们经过社区数年
我们做过超越老师的作品
我们做过全站最好的作品api数据获取
我们做过代码最多的最好的文字作品
我们做过全站最像样的系统
我们打败过社区4个超牛逼喷子联合的围攻
我们从没输过，我们永远赢过

我们为别人一键三连，别人也给我们素质三连
今生无悔学编程，来世还做程序猿
666

逆天团队(INS,InverseSky Team):
    -逆天工作室(InverseSky Studio)-
    ·开心每一天，体验每一天，逆天每一天
    ·我命由我不由天
    ·逆天少年，永不言败
    
    -宇宙工作室(WeSpace Studio)-
    ·宇宙之大，无奇不有
    ·宇宙之繁，无限探索
    ·宇宙之工作室，无敌编程
    
    -联梦工作室(Lemol Studio/Connect Dream Light Studio)-
    ·联合创梦，共赢创新
    ·助力每一个梦想
    ·筑梦未来
    
    -A字团队(蒋A团队/A·A·A LineGo Team)
\033[2;32m
under 7 years ...
hehe🥲
no people know that.
really no everything.
hehe😨
And I have a strange emotion...
- 精 神 分 裂 -
Ev ery  wi ll  d. . .
f a i l - w i l l - t u r n - w i n......

(^-^)
-----
just beginning

\033[0m
好了，这是逆天团队7周年庆，大家开始在评论区庆祝吧💻 💻 💻 🎂

上面
还有
很多
内容
一定
从头
看起
拜拜
''')