print('''\033[1;44m「有思想的不定积分」天子正式上号。\033[0m
\033[1;34m「有动力的实变函数」优势の势力加持。
「新时代的圆锥曲线」强势创新开拓。
「回忆杀的苏格拉底」进行图腾整理。
「破阵局的质能方程」前锋将领。\033[0m
\033[1;32m「螳螂哥」和「老板」回归本职。\033[0m
\033[1;36m「锐利的笔锋」批评家。\033[0m
\033[1;35m「小丑」必不可少的角色。\033[0m
「终焉之师」天子的禁军。
「联梦军团」天子的第一部队。
「诸神黄昏」天子的第二部队。
「天方夜谭」天子的第三部队。
「逆天神力」天子的文武百官。
\033[1;32m「新智能」人机。\033[0m
\033[1;36m「A字创造」包括「小鲤鱼」「立方体」等管理者。\033[0m
\033[1;33m「虚幻之力」宝物。
「伟大人民」中流砥柱。\033[0m
\033[1;34m「创世神」创哥理赔+刷怪笼。\033[0m
\033[1;31m「逆天小轩」旁观模式。\033[0m
\033[1;33m(*注: 不是游戏！天子已经带领他的横扫大队回来力！awa)\033[0m
(**注: 显示有问题的终端（比如出现天子上面少了一横），请打开改编看文字，或者按住Ctrl和鼠标滚轮/+号进行浏览器页面放大)


孩子们，我回来了！
😅 😅 😅
😈 😈 😈''')