print('''我一些想说的话(重要
所有截图打开改编都在文件素材里

1.因为要标题尽量完整，所以括号为英文，单括号，并缩句使其紧凑。

2.林林的狗头头像账号被封，但实际上他有?个账号。（依照本人意愿保密。

3.凌锋之前被封还能发作品，是因为只封了一个较高的等级。
  很多人不服气，如lbw，但是现在应该是真·封，目前借用Mozart的账号使用。
  我甚至之前发现Mozart的学校和我的学校是一个系列的（
  本消息没有任何针对，但是告诉大家不要乱搞xes了，安于现状吧，xes不好惹（

4.凌锋宣传广告，制作恶意程序。目前已经得到标准信息截图。
  鉴定为: 会网络编程就自吹和批评家。宣传广告+营销号+恶作剧第一人
  通过其个人账号确定为学习成绩垃而只能这样。

5.由于本暑假事情和作业较多，将会有一段时间不在线，不能经常在线
  解决之后就可以

6.DreamUniverse(目前简称IDU项目)需要更多可能性、随机性、种子、结局、剧本分支等。将是庞大的工程
  目前第一阶段的问题：
  1.3D部分
    暂时由吴宇航负责。目前搜查pygame绘制3d及其物理引擎。取得资料上的进展。
  2.2D部分+游戏框架+文件管理+剧本制作+pygame/tkinter的GUI界面+地形+网络搜索引擎+区块设置+情节种子分支+编辑器功能+指令集
    目前全部由逆天小轩负责。
    目前多进程一样地执行中(生动形象
    在搜索引擎上的问题，用我和吴宇航的对话来说:
    “我找了两天网页嵌入了，从tkinter到wx/qt/pyside等的gui一条龙，再到pygame/pyglet等的game一条龙，再到前后端一条龙，exe一条龙，找来找去；网络方面，pythonnet/tkinterie/tkwebview2/selenium/cefpython等一条龙
    全部都是漏洞多多，简直油饼
    我怎么办”
    很多回复见https://code.xueersi.com/home/project/detail?lang=code&pid=45337747&version=offline&form=python&langType=python
    下面的评论，有几十页。目前有200条
  3.其他
    与林林、何嘉晨、浅梦、李梦唐等进行不同方面交流，他们也会提建议，提供一些帮助，稍后提供鸣谢。
  4.鸣谢其他人
    张功喆(uid=3317163) 提出作业块的信息。已采纳。
    周绪航(uid=21320093,小船0612) 提到创造模式。已了解。
    另外，感谢支持者们。
  特别鸣谢吴宇航的支持及帮助，以及日常生活的闲聊。
  特别鸣谢胡锦辉的支持与鼓励，以及日常生活的闲聊。

7.本来想做动画表示闭关修炼，现在都没空肝这事。

8.最近有一些喷子，已经反击；B站喷林林的喷子已经举报成功。
  维护逆天团队的权益。

9.最后看些大家看到这里。我走了哈（
  诶你不能走，还没喝毒鸡汤呢（

上面及作品素材还有很多东西哦(作品内含彩蛋)~''')