print('''以下内容张余辰，李俊鑫看，微信复制粘贴给ella（一字不差），\033[1;31m除了()要填空\033[0m
-------------------------------------------
上次足球课没说到的重点(小轩真名)概述一下

未来预测论：
一种统计科学和未来预测科学复合的理论
通过统计事件以及影响率、发生可能性、时间段进行一件大事的预测
相当于《银河帝国：基地》系列中的心理史学
目前在不断优化预测未来的方程式
这种预测，不能预测个人的随意行为，只能预测整体。参与的事件以及影响率、发生可能性、时间段以及数据越多，准确性越高
比如进行我们班发生事情的预测：
每天都有几个因素：
有害因素1（如嫉妒）：每天发生的可能性为x%(如50%)，影响率为y%(如2%)，每天就有x%*y%(如50%*2%=1%，注意不是100%)的可能因为这件事发生事件，每天不发生事件的可能就是0.99
有害因素2（如隔阂）：每天发生的可能性为x%(如60%)，影响率为y%(如3%)，每天就有x%*y%(如60%*3%=1.8%)的可能因为这件事发生事件，每天不发生事件的可能就是0.982%
有利因素：每天发生的可能性为x%(如30%)，影响率为y%(如5%)，每天就有x%*y%(如30%*5%=1.5%)的可能因为这件事改善班级，每天不发生事件的可能就是1.015(挽回)
综合三点，每天有1*0.99*0.982*1.015=0.9867627的概率不发生事件！
也就是98.67627%，这太好了！
但是，如果是一周，就是1*(98.67627%的7次方)，电脑上记作0.9867627^7
答案大约是91.1%，这也很好！
但是，我只弄了2个有害因素。如果采集详细数据呢？
我试了一下15个因素，结果答案是50%左右
也就是说，我们班每周大约有一般可能会发生令人很不愉快的事！
这才是15个因素！
等我不断完善方程式，一定会更准，准到±2%左右为止！

人生真谛论：
我用追根求源的办法发现的人生的真谛是快乐，后来归结于体验
然后发现这个世界一定是真的
体验，只有体验，只是体验而已！
打字挺累的，下节足球课详细介绍这个理论的推论

逆天工作室版权所有
''')