#请把显示区拉大
#非原创，只把原创变好，在此道歉







































































































































































































































































































































































































































print("看我代码！C++输入方式！if (p =='2/8'),print后有;（分号）")
print("第1关：")
print("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!")
print("!!!!!!!!!!!!!!!!|!!!!!!!!!!!!!!!")
p=input("在2排“!”中，找出1个“|”（格式：第几排 / 第几个）:")
if p==("2/17"):
    print("答对啦！！！！！！！！！！")
if p!=("2/17"):
    print("答错啦！！！！！！！！！！")
print("第2关：")
print("大大大大大大大大大大大大大大");
print("大大大大大大大太大大大大大大");
print("大大大大大大大大大大大大大大");
p=input("在3排“大”中，找出1个“太”（格式：第几排 / 第几个）:");
if (p=="2/8"):
    print("答对啦！！！！！！！！！！")
if (p!="2/8"):
    print("答错啦！！！！！！！！！！")
print("第3关：")
print("天天天天天天天天天天天天天天天天天天天天天天天天");
print("天天天天天天天天天天夭天天天天天天天天天天天天天");
print("天天天天天天天天天天天天天天天天天天天天天天天天");
print("天天天天天天天天天天天天天天天天天天天天天天天天");
p=input("在4排“天”中，找出1个“夭”（格式：第几排 ……&* 第几个）:")
if p==("2……&*11"):
    print("答对啦！！！！！！！！！！")
if p!=("2……&*11"):
    print("答错啦！！！！！！！！！！")
print("第4关：")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未末未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
p=input("在12排“未”中，找出1个“末”（格式：第几排 空格 第几个）:")
if p==("7 8"):
    print("答对啦！！！！！！！！！！")
if p!=("7 8"):
    print("答错啦！！！！！！！！！！")
print("第5关：")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
print("未未未未未未未未未未未未未未未未未")
p=input("在多排“未”中，找出1个“末”（格式：第几排 空格 第几个）:")
if p==("22 9"):
    print("答对啦！！！！！！！！！！")
if p!=("22 9"):
    print("答错啦！！！！！！！！！！")
print("\033[1;31m没有啦！！！！！！！！！！请点赞！！！！！！！！！！！！！！！！")













































































































