import random
print('彭加莱回归很著名，它说明了国一段很长的时间以后时间就会循环一次，这个时间不少于TREE(3)')
print('经过宇宙熵增，每个粒子都会不断打乱，总有一天排列组合会打乱到原来的状态，然后时间就会重现')
input('下面做一个大家能理解的小实验，看看10个元素[1,2,3,4,"h",6,7,8,9,11]的列表实现一次彭加莱回归需要打乱多少次，过程可能要等一会，如果时间长就重新运行，结果每循环10万次输出一次，回车开始')
def upset(l):
    s = []
    while l != []:
        x = random.choice(l)
        l.remove(x)
        s.append(x)
    return s
old = [1,2,3,4,'h',6,7,8,9,11]
list_ = upset(old)
print('打乱1次',list_)
xx = 1
while list_ != [1,2,3,4,'h',6,7,8,9,11]:
    xx += 1
    list_ = upset(list_)
    if xx % 100000 == 0:
        print('\033[2J\033[100A打乱'+str(xx)+'次',list_)
print('\033[2J\033[100A共打乱'+str(xx)+'次，得到',list_)
print('已经实现了一个彭加莱回归！想想看，宇宙那么多元素，回归一次固然长，但是也总有一天能成功！这次实验到这里，有人想要打乱函数见源码')