print("""\033[1;31m耐心看完3连谢谢，作者打字很累\033[0m
h=100 k=1000 w=10000 绿色=完成 青色=整体完成或提示

粉丝：
3h 再换头像（1代可多走路，2代（现在）可多墨镜喝水，3代（达到粉福）探险者可多）
3.3h 出一个和个人中心有关联的好作品
3.7h [暂时不泄密]

\033[1;36m赞：
8h 再次更新网页或作品破解器，有可能的话还会修复聊天区
8.5h 广告借楼区
8.7h 更新首页
9h [要同时满足浏览的9k、收藏 自己破译拼音：wocao,baozhaobiaoqingbao]
1k python IDLE\033[0m

浏览：
累计：
\033[1;32m8.1k 足球游戏 \033[0m
\033[1;32m8.5k 火柴人第六季——火柴人耍酷 \033[0m
9k =赞9h、收藏
1w [暂时不泄密]
单个：
\033[1;32m5h 升级病毒库，送1行pygame代码: import os;os.system('shutdown/s /c憨憨的小轩病毒 /t 21')\033[0m
1k [神秘大礼包]

收藏：
2h 凑单[赞9h、浏览的9k]

改编：
1.8h 放水沙雕礼包【可改编还能抄袭】

汇总满足：
粉丝3.2h 赞8.8h 浏览累计9k 收藏2h 改编179 单作评论100 推上首页1（千万不要先推，告诉我之后我会告诉你我想推的）、
礼品：
pygame大放送3
作品集2
再更首页
作品破解器，修复聊天区，发布\033[1;31m《宇宙战舰大战》（现1400行，可以问我链接抢先一波）\033[0m
[神秘大礼包]
[baoshiping]
\033[1;36m------上面还有------\033[0m
[PS]
\033[1;31m等等……（此处省去很多）\033[0m

目标：
2020.11.15的作品还记得吗，右键复制https://code.xueersi.com/home/project/detail?lang=code&pid=10866556&version=python&form=python&langType=python
现在达成并完工：
1.某些作品升级
2.鲜艳、显眼的标志
3.黑科技科研病毒库
\033[1;31m6.聊天区\033[0m
7.超级不用赞
9.pygame大放送1、2
11.全面发展
12.满站宇宙（这怎么说呢，知名度9/11，以后不算目标）
13.知识作品

现在不想做了（附原因）：
8.jhx方便0元公用库（总没人用，还是帮胡锦辉gameeasy吧）
10.秃头大催（我不是秃头告诉我秋天会更新梦寐以求的工作室功能，而且打算推荐作品用而不是催更了）
14.小轩个性签名跟踪（懒得记录了）

未做、正在做：
4.游戏大厅（总个人中心的分部）
5.超级编程地（需要完善IDLE）
\033[1;31m6.聊天区\033[0m怎么重合了？哦，原来第一个是依靠C站作品下评论区的，这个则是用html自行记录的！
更多：都有都有，你想的都有（最好在评论区告诉我）

最后，学而思惊天大秘密——C站最长论文（7）——所有表情包看你们表现很快就会发
886
""")