print('''INS-DreamUniverse项目
(本来想晚点说的，因为暑假作业，所以还没开始开发，会很晚)
因为浅梦猜中项目名中的“Universe”，我就先说了
项目中文名: 梦想宇宙/联梦宇宙
目前倾向“联梦宇宙”
因为众所不周知，逆天中的分工作室联梦工作室的英文名是DreamSky(

工程介绍:
起初，人们以为这只是一款沙盒游戏，直到它和每个人息息相关(流浪地球起来了
其实这就是一个元宇宙，里面有各种玩家可以操控的东西
你可以在沙盒中通过一些方块化合成物品“电脑”，然后你可以在游戏里访问互联网
你也可以在里面做化学实验、物理实验，使用黑板写内容。
你可以制作传送门，跳转到另一个区块。
你也可以在编程区块里面写代码
除此之外，还会有公共区块，玩家可以通过公共区块云上交流。
你甚至可以看模拟系统，制作自己的编程语言
甚至说，这是一个图灵完备的游戏。
它可以让你感受到虚拟世界真的可以是一个自己的世界。

这个项目我不会弃坑了，因为我以后不管有什么新创意，
都可以扔进这个世界，而不是重开新坑(不过万一世界都没做完就弃坑了就当我没说。

这也是我目前最伟大的目标，做完我就去专门搞学习和c++了(不过万一世界都没做完就弃坑了就当我没说。
我可以在里面做自己喜欢的事，大家都可以创造自己的世界(不过万一世界都没做完就弃坑了就当我没说。
不过万一信息表都没做完就弃坑了就当我没说。(不过万一都没做就弃坑了就当我没说。
不过现在我这个作品懒得继续介绍了，就当我说了。(不正经

和我一起做和提建议。工程量巨大。绝对是逆天聊、IX、INS社区、逆天系统等又双叒叕比不上的(
总结:不来就做，不做就等，不等就议，不议就玩，不玩就赞，不赞就doge
总结全部:废话一篇。''')