def pt(text):
    print(text.replace('#r','\033[1;31m').replace('#g','\033[1;32m').replace('#y','\033[1;33m'))
pt('''绿色为完成，红色为未完成,黄色为其他状况
#g我做作品的清单
#g二次函数模拟器2.0
#g二次函数模拟器2.6
#yDream Sky浏览器1.0
#r二次函数模拟器3.0
#rDream Sky浏览器2.0
#rDream Sky浏览器3.0
#r函数模拟器4
#y小轩电脑AS-SE/TE/LE
#rDream Sky浏览器4.0
#r函数模拟器5
#r小轩电脑1.1
#rDream Sky浏览器4.3
#r小轩电脑1.5
#rDream Sky浏览器4.7
#r小轩电脑1.9
#rDream Sky浏览器5.0
#r小轩电脑2.0
#rDream Sky浏览器5.6
#r小轩电脑3.0
#rDream Sky浏览器7.0
#r小轩电脑4.0
#rDream Sky浏览器8.0
#r小轩电脑5
#rDream Sky浏览器9.0
#r小轩电脑6
#rDream Sky浏览器11
#r小轩电脑6-X1
#y计算器
#y魔力钟表
#r小轩电脑6-X2
#r函数模拟器6
#r文件操作器
#y超级版图
#y死机之歌
#r逆天工作室官网
#y地心游记2.0
#r地心游记3.0
#r地心游记4.0
#r游戏中心
#r地心游记5.0
#yjhx库1.0
#rjhx库2.0
#rjhx库3.0
#rjhx库4.0
#rjhx库5.0
#rjhx库10.0
#r地心游记6.0
#r地心游记7.0
#r小轩电脑6-X3
#y弱肉强食
#y贝叶斯分析
#y未来预测工具
#r游戏中心2
#r地心游记8.0
#r未来预测工具2
#r小轩电脑6-X4
#r小轩书屋
#y超级加密器
#y宇宙战舰大战
#r文件操作器2
#r文件操作器3
#r系统操作器
#r文件操作器4
#r游戏中心3
#r未来预测工具3
#r未来预测工具4
#r代码破译器3
#r小轩电脑7.0
#r小轩电脑7.1
#rjhx库11.0
#r未来预测工具5
#r小轩书屋2
#r小轩书屋3
#r小轩电脑8
#r小轩电脑9
#r小轩电脑10
#r小轩电脑X
#r小轩电脑11
#r小轩电脑XF
#r小轩电脑XLF
#r小轩电脑12
#r小轩电脑13
#r小轩电脑20
#y护屏程序
#r小轩电脑Dream
#零碎作品
#y平常的一天
#r作品集2
#r退·纪念碑
''')
print('\033[1;36m上面还有东西')